# https://ja.wikipedia.org/wiki/%E5%B0%86%E6%A3%8B%E3%81%AE%E6%89%8B%E5%90%88%E5%89%B2
# |--------+------------------+--------------------------------------------|
# | 段級差 | 名称             | 内容                                       |
# |--------+------------------+--------------------------------------------|
# |      0 | 振駒先（平手戦） | 振り駒で先手を決める                       |
# |      1 | 先               | 下位者を先手とする                         |
# |      2 | 香落ち           | 上手が左側（角行のある側）の香車を落とす   |
# |      3 | 角落ち           | 上手が角行を落とす                         |
# |      4 | 飛車落ち         | 上手が飛車を落とす                         |
# |      5 | 飛香落ち(一丁半) | 上手が飛車と左側の香車を落とす             |
# |    6-7 | 二枚落ち         | 上手が飛車と角行を落とす                   |
# |    8-9 | 四枚落ち         | 上手が飛車と角行、両方の香車を落とす       |
# | 10以上 | 六枚落ち         | 上手が飛車と角行、両方の香車と桂馬を落とす |
# |--------+------------------+--------------------------------------------|
class Fanta::CustomPresetInfo < Warabi::PresetInfo
  memory_record_reset superclass.find_all { |e|
    e.name.in?([
        "平手",
        "香落ち",
        # "右香落ち",
        "角落ち",
        "飛車落ち",
        "飛香落ち",
        "二枚落ち",
        # "三枚落ち",
        "四枚落ち",
        "六枚落ち",
        # "八枚落ち",
        # "十枚落ち",
        # "十九枚落ち",
        # "二十枚落ち",
      ])
  }.collect(&:attributes)
end
