require "rails_helper"

module QuickScript
  module Swars
    RSpec.describe GradeHistogramScript, type: :model do
      it "works" do
        battle = ::Swars::Battle.create! do |e|
          e.memberships.build(grade_key: "初段")
          e.memberships.build(grade_key: "初段")
        end
        params = { tag: "居飛車", rule_key: "ten_min" }
        instance = GradeHistogramScript.new(params)
        assert { instance.total_count == 1 }
      end
    end
  end
end
# >> Run options: exclude {:login_spec=>true, :slow_spec=>true}
# >> 
# >> QuickScript::Swars::GradeHistogramScript
# >> |------+------+------+------+------+----------+------------+------------+------+------------------+-------------------+--------------------+--------------------------|
# >> | ID   | 先後 | 勝敗 | 棋力 | 力差 | スタイル | 自分       | 相手       | 対   | defense_tag_list | attack_tag_list   | technique_tag_list | note_tag_list            |
# >> |------+------+------+------+------+----------+------------+------------+------+------------------+-------------------+--------------------+--------------------------|
# >> | 3863 | ▲   | 勝ち | 初段 |    0 | 王道     | user1 初段 | user2 初段 | 3864 |                  | 新嬉野流          |                    | 対振り飛車 居飛車 対抗形 |
# >> | 3864 | △   | 負け | 初段 |    0 | 準王道   | user2 初段 | user1 初段 | 3863 |                  | 2手目△３ニ飛戦法 |                    | 振り飛車 対居飛車 対抗形 |
# >> |------+------+------+------+------+----------+------------+------------+------+------------------+-------------------+--------------------+--------------------------|
# >> |----------+---------------------|
# >> |       ID | 1934                |
# >> |   ルール | 10分                |
# >> |     結末 | 投了                |
# >> |   モード | 野良                |
# >> |   手合割 | 平手                |
# >> |     手数 | 5                   |
# >> | 対局日時 | 2000-01-01 00:00:00 |
# >> | 対局秒数 | 0                   |
# >> | 終了日時 | 2000-01-01 00:00:00 |
# >> |       ▲ | user1 初段 勝ち     |
# >> |       △ | user2 初段 負け     |
# >> |     勝者 | user1               |
# >> | 最終参照 | 2000-01-01 00:00:00 |
# >> |----------+---------------------|
# >> |------+------+------+------+------+----------+------------+------------+------+------------------+-------------------+--------------------+--------------------------|
# >> | ID   | 先後 | 勝敗 | 棋力 | 力差 | スタイル | 自分       | 相手       | 対   | defense_tag_list | attack_tag_list   | technique_tag_list | note_tag_list            |
# >> |------+------+------+------+------+----------+------------+------------+------+------------------+-------------------+--------------------+--------------------------|
# >> | 3863 | ▲   | 勝ち | 初段 |    0 | 王道     | user1 初段 | user2 初段 | 3864 |                  | 新嬉野流          |                    | 対振り飛車 居飛車 対抗形 |
# >> | 3864 | △   | 負け | 初段 |    0 | 準王道   | user2 初段 | user1 初段 | 3863 |                  | 2手目△３ニ飛戦法 |                    | 振り飛車 対居飛車 対抗形 |
# >> |------+------+------+------+------+----------+------------+------------+------+------------------+-------------------+--------------------+--------------------------|
# >> |------+------+----------+--------------+--------+--------+--------|
# >> | 階級 | 度数 | 相対度数 | 累計相対度数 | 階級値 | 基準値 | 偏差値 |
# >> |------+------+----------+--------------+--------+--------+--------|
# >> | 九段 |    0 |      0.0 |          0.0 |      0 | NaN    | NaN    |
# >> | 八段 |    0 |      0.0 |          0.0 |     -1 | NaN    | NaN    |
# >> | 七段 |    0 |      0.0 |          0.0 |     -2 | NaN    | NaN    |
# >> | 六段 |    0 |      0.0 |          0.0 |     -3 | NaN    | NaN    |
# >> | 五段 |    0 |      0.0 |          0.0 |     -4 | NaN    | NaN    |
# >> | 四段 |    0 |      0.0 |          0.0 |     -5 | NaN    | NaN    |
# >> | 三段 |    0 |      0.0 |          0.0 |     -6 | NaN    | NaN    |
# >> | 二段 |    0 |      0.0 |          0.0 |     -7 | NaN    | NaN    |
# >> | 初段 |    1 |      1.0 |          1.0 |     -8 | NaN    | NaN    |
# >> | 1級  |    0 |      0.0 |          1.0 |     -9 | NaN    | NaN    |
# >> | 2級  |    0 |      0.0 |          1.0 |    -10 | NaN    | NaN    |
# >> | 3級  |    0 |      0.0 |          1.0 |    -11 | NaN    | NaN    |
# >> | 4級  |    0 |      0.0 |          1.0 |    -12 | NaN    | NaN    |
# >> | 5級  |    0 |      0.0 |          1.0 |    -13 | NaN    | NaN    |
# >> | 6級  |    0 |      0.0 |          1.0 |    -14 | NaN    | NaN    |
# >> | 7級  |    0 |      0.0 |          1.0 |    -15 | NaN    | NaN    |
# >> | 8級  |    0 |      0.0 |          1.0 |    -16 | NaN    | NaN    |
# >> | 9級  |    0 |      0.0 |          1.0 |    -17 | NaN    | NaN    |
# >> |------+------+----------+--------------+--------+--------+--------|
# >>   works
# >> 
# >> Top 1 slowest examples (0.51394 seconds, 19.9% of total time):
# >>   QuickScript::Swars::GradeHistogramScript works
# >>     0.51394 seconds -:6
# >> 
# >> Finished in 2.58 seconds (files took 2.11 seconds to load)
# >> 1 example, 0 failures
# >> 
