require "#{__dir__}/setup"
Ppl.setup_for_workbench
# (Ppl::SeasonKeyVo["S31前"]..Ppl::SeasonKeyVo["S33前"]).each(&:users_update_from_web)

e = Ppl::AncientSpider.new(season_key_vo: Ppl::SeasonKeyVo["S31前"], take_size: nil, verbose: false, sleep: 0, mock: false)
tp e.table_hash_array
tp e.call
# >> |--------+------+----------+------+--------+------+------+--------+------+------+------------+------|
# >> | 参加期 | 順位 | 氏名     | 段位 | 師匠   | 年齢 | 出身 | 新順位 | 勝数 | 敗数 | ox         | 結果 |
# >> |--------+------+----------+------+--------+------+------+--------+------+------+------------+------|
# >> | 1期    |    1 | 佐藤豊   | 四段 | 宮松   |   42 | 東京 |      6 |    1 |    9 | xoxxxxxxxx |      |
# >> | 1期    |    2 | 浅沼一   | 四段 | 小泉   |   31 | 東京 |      5 |    2 |    8 | oxxxxxoxxx |      |
# >> | 1期    |    3 | 佐藤健伍 | 三段 | 加藤治 |   28 | 東京 |      2 |    7 |    3 | ooooxooxxo |      |
# >> | 1期    |    4 | 大友寛二 | 三段 | 原田   |   22 |      |      3 |    7 |    3 | oooooxooxx |      |
# >> | 1期    |    5 | 木村嘉孝 | 三段 | 木村   |   25 | 東京 |      4 |    4 |    6 | oooxxoxxxx |      |
# >> | 1期    |    6 | 剱持松二 | 三段 | 荒巻   |   22 | 東京 |      1 |    9 |    1 | oooooxoooo | 昇段 |
# >> |--------+------+----------+------+--------+------+------+--------+------+------+------------+------|
# >> |------------+----------+--------+-----+-----+------+------------|
# >> | result_key | name     | mentor | age | win | lose | ox         |
# >> |------------+----------+--------+-----+-----+------+------------|
# >> | 維         | 佐藤豊   | 宮松   |  42 |   1 |    9 | xoxxxxxxxx |
# >> | 維         | 浅沼一   | 小泉   |  31 |   2 |    8 | oxxxxxoxxx |
# >> | 維         | 佐藤健伍 | 加藤治 |  28 |   7 |    3 | ooooxooxxo |
# >> | 維         | 大友寛二 | 原田   |  22 |   7 |    3 | oooooxooxx |
# >> | 維         | 木村嘉孝 | 木村   |  25 |   4 |    6 | oooxxoxxxx |
# >> | 昇         | 剱持松二 | 荒巻   |  22 |   9 |    1 | oooooxoooo |
# >> |------------+----------+--------+-----+-----+------+------------|
