require "#{__dir__}/setup"
e = Ppl::MedievalSpider.new(season_key_vo: "1", take_size: nil, verbose: false, sleep: 0)
tp e.table_values_array
tp e.table_hash_array
tp e.call
# >> |-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
# >> | ["参加", "氏名", "師匠・年齢・出身", "成績", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "順位"]                                                                           |
# >> | ["1期", "村松央一", "平野・28・千葉", "7-9", "●木下", "●高田", "●先崎", "○小泉", "○庄司", "●古作", "○荒井", "○中川", "○中山", "○藤原", "○伊藤", "●北島", "●小池", "●田畑", "●野田", "●杉本", "10"]    |
# >> | ["1期", "田畑良太", "大友・24・東京", "9-7", "●中川", "○荒井", "○藤原", "○野田", "●高田", "●古作", "○北島", "●杉本", "●中山", "○木下", "●庄司", "○小池", "○先崎", "○村松", "●小泉", "○伊藤", "4"]     |
# >> | ["1期", "小泉有明", "芹沢・23・東京", "6-10", "○高田", "●先崎", "●杉本", "●中山", "●村松", "●中川", "○伊藤", "●古作", "●小池", "○北島", "●木下", "●野田", "●藤原", "○荒井", "○田畑", "○庄司", "12"]   |
# >> | ["1期", "伊藤能", "米長・25・東京", "8-8", "○杉本", "●藤原", "○北島", "○木下", "●小池", "●先崎", "●小泉", "○中川", "○荒井", "○高田", "●古作", "●村松", "●庄司", "○野田", "○中山", "●田畑", "8"]       |
# >> | ["1期", "荒井孝則", "西村・23・埼玉", "5-11", "○小池", "●田畑", "●中山", "●杉本", "●先崎", "○高田", "●村松", "●伊藤", "●古作", "○北島", "●藤原", "○野田", "●中川", "●小泉", "○庄司", "●木下", "17"]   |
# >> | ["1期", "古作登", "松下・24・東京", "9-7", "○野田", "●中山", "●中川", "●北島", "○田畑", "○村松", "○小泉", "○庄司", "○荒井", "○伊藤", "○小池", "●先崎", "●杉本", "●藤原", "○木下", "●高田", "5"]       |
# >> | ["1期", "高田尚平", "荒巻・25・東京", "9-7", "●小泉", "○村松", "○野田", "●藤原", "○田畑", "●荒井", "○小池", "○中山", "●杉本", "●伊藤", "○庄司", "●先崎", "●中川", "○木下", "○北島", "○古作", "6"]     |
# >> | ["1期", "庄司俊之", "佐瀬・18・宮城", "8-8", "○中山", "○杉本", "○先崎", "○小池", "○中川", "●村松", "●木下", "○北島", "●古作", "●高田", "○田畑", "○伊藤", "●藤原", "●野田", "●荒井", "●小泉", "9"]     |
# >> | ["1期", "木下浩一", "松田・20・長野", "6-10", "○村松", "●中川", "●小池", "●伊藤", "■北島", "○庄司", "○野田", "●藤原", "●田畑", "○小泉", "●中山", "○杉本", "●高田", "●先崎", "●古作", "○荒井", "13"]   |
# >> | ["1期", "中川大輔", "米長・19・宮城", "13-3", "○田畑", "○木下", "○古作", "●庄司", "○小泉", "○先崎", "●伊藤", "●村松", "○野田", "○杉本", "○北島", "○高田", "○荒井", "○小池", "○中山", "○藤原", "1"]    |
# >> | ["1期", "北島忠雄", "関根・21・埼玉", "6-10", "○藤原", "●野田", "●伊藤", "○古作", "□木下", "○小池", "●田畑", "●庄司", "●先崎", "●小泉", "●荒井", "●中川", "○村松", "○中山", "●杉本", "●高田", "14"]   |
# >> | ["1期", "先崎学", "米長・17・茨城", "12-4", "○小泉", "●庄司", "○村松", "○荒井", "○伊藤", "●中川", "○小池", "○北島", "○藤原", "○野田", "○高田", "○古作", "●田畑", "○木下", "●杉本", "○中山", "2"]      |
# >> | ["1期", "小池裕樹", "安恵・20・東京", "6-10", "●荒井", "○木下", "●庄司", "○伊藤", "●北島", "●高田", "●先崎", "○小泉", "○杉本", "●中山", "●古作", "●田畑", "○村松", "●中川", "○藤原", "●野田", "15"]   |
# >> | ["1期", "中山則男", "板谷進・27・香川", "7-9", "●庄司", "○古作", "○荒井", "○小泉", "●杉本", "○野田", "●藤原", "●高田", "○田畑", "●村松", "○小池", "○木下", "●北島", "●伊藤", "●中川", "●先崎", "11"]  |
# >> | ["1期", "野田敬三", "森安秀・29・兵庫", "6-10", "●古作", "○北島", "●高田", "●田畑", "●藤原", "●中山", "○杉本", "●木下", "●中川", "●先崎", "○小泉", "●荒井", "●伊藤", "○庄司", "○村松", "○小池", "16"] |
# >> | ["1期", "藤原直哉", "若松・22・兵庫", "9-7", "●北島", "○伊藤", "●田畑", "○高田", "○野田", "●杉本", "○中山", "○木下", "●先崎", "●村松", "○荒井", "○小泉", "○庄司", "○古作", "●小池", "●中川", "7"]     |
# >> | ["1期", "杉本昌隆", "板谷進・18・愛知", "10-6", "●伊藤", "●庄司", "○小泉", "○荒井", "○中山", "○藤原", "●野田", "○田畑", "○高田", "●小池", "●中川", "●木下", "○古作", "○北島", "○先崎", "○村松", "3"]  |
# >> |-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
# >> |------+----------+------------------+------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+------|
# >> | 参加 | 氏名     | 師匠・年齢・出身 | 成績 |      1 |      2 |      3 |      4 |      5 |      6 |      7 |      8 |      9 |     10 |     11 |     12 |     13 |     14 |     15 |     16 | 順位 |
# >> |------+----------+------------------+------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+------|
# >> | 1期  | 村松央一 | 平野・28・千葉   | 7-9  | ●木下 | ●高田 | ●先崎 | ○小泉 | ○庄司 | ●古作 | ○荒井 | ○中川 | ○中山 | ○藤原 | ○伊藤 | ●北島 | ●小池 | ●田畑 | ●野田 | ●杉本 |   10 |
# >> | 1期  | 田畑良太 | 大友・24・東京   | 9-7  | ●中川 | ○荒井 | ○藤原 | ○野田 | ●高田 | ●古作 | ○北島 | ●杉本 | ●中山 | ○木下 | ●庄司 | ○小池 | ○先崎 | ○村松 | ●小泉 | ○伊藤 |    4 |
# >> | 1期  | 小泉有明 | 芹沢・23・東京   | 6-10 | ○高田 | ●先崎 | ●杉本 | ●中山 | ●村松 | ●中川 | ○伊藤 | ●古作 | ●小池 | ○北島 | ●木下 | ●野田 | ●藤原 | ○荒井 | ○田畑 | ○庄司 |   12 |
# >> | 1期  | 伊藤能   | 米長・25・東京   | 8-8  | ○杉本 | ●藤原 | ○北島 | ○木下 | ●小池 | ●先崎 | ●小泉 | ○中川 | ○荒井 | ○高田 | ●古作 | ●村松 | ●庄司 | ○野田 | ○中山 | ●田畑 |    8 |
# >> | 1期  | 荒井孝則 | 西村・23・埼玉   | 5-11 | ○小池 | ●田畑 | ●中山 | ●杉本 | ●先崎 | ○高田 | ●村松 | ●伊藤 | ●古作 | ○北島 | ●藤原 | ○野田 | ●中川 | ●小泉 | ○庄司 | ●木下 |   17 |
# >> | 1期  | 古作登   | 松下・24・東京   | 9-7  | ○野田 | ●中山 | ●中川 | ●北島 | ○田畑 | ○村松 | ○小泉 | ○庄司 | ○荒井 | ○伊藤 | ○小池 | ●先崎 | ●杉本 | ●藤原 | ○木下 | ●高田 |    5 |
# >> | 1期  | 高田尚平 | 荒巻・25・東京   | 9-7  | ●小泉 | ○村松 | ○野田 | ●藤原 | ○田畑 | ●荒井 | ○小池 | ○中山 | ●杉本 | ●伊藤 | ○庄司 | ●先崎 | ●中川 | ○木下 | ○北島 | ○古作 |    6 |
# >> | 1期  | 庄司俊之 | 佐瀬・18・宮城   | 8-8  | ○中山 | ○杉本 | ○先崎 | ○小池 | ○中川 | ●村松 | ●木下 | ○北島 | ●古作 | ●高田 | ○田畑 | ○伊藤 | ●藤原 | ●野田 | ●荒井 | ●小泉 |    9 |
# >> | 1期  | 木下浩一 | 松田・20・長野   | 6-10 | ○村松 | ●中川 | ●小池 | ●伊藤 | ■北島 | ○庄司 | ○野田 | ●藤原 | ●田畑 | ○小泉 | ●中山 | ○杉本 | ●高田 | ●先崎 | ●古作 | ○荒井 |   13 |
# >> | 1期  | 中川大輔 | 米長・19・宮城   | 13-3 | ○田畑 | ○木下 | ○古作 | ●庄司 | ○小泉 | ○先崎 | ●伊藤 | ●村松 | ○野田 | ○杉本 | ○北島 | ○高田 | ○荒井 | ○小池 | ○中山 | ○藤原 |    1 |
# >> | 1期  | 北島忠雄 | 関根・21・埼玉   | 6-10 | ○藤原 | ●野田 | ●伊藤 | ○古作 | □木下 | ○小池 | ●田畑 | ●庄司 | ●先崎 | ●小泉 | ●荒井 | ●中川 | ○村松 | ○中山 | ●杉本 | ●高田 |   14 |
# >> | 1期  | 先崎学   | 米長・17・茨城   | 12-4 | ○小泉 | ●庄司 | ○村松 | ○荒井 | ○伊藤 | ●中川 | ○小池 | ○北島 | ○藤原 | ○野田 | ○高田 | ○古作 | ●田畑 | ○木下 | ●杉本 | ○中山 |    2 |
# >> | 1期  | 小池裕樹 | 安恵・20・東京   | 6-10 | ●荒井 | ○木下 | ●庄司 | ○伊藤 | ●北島 | ●高田 | ●先崎 | ○小泉 | ○杉本 | ●中山 | ●古作 | ●田畑 | ○村松 | ●中川 | ○藤原 | ●野田 |   15 |
# >> | 1期  | 中山則男 | 板谷進・27・香川 | 7-9  | ●庄司 | ○古作 | ○荒井 | ○小泉 | ●杉本 | ○野田 | ●藤原 | ●高田 | ○田畑 | ●村松 | ○小池 | ○木下 | ●北島 | ●伊藤 | ●中川 | ●先崎 |   11 |
# >> | 1期  | 野田敬三 | 森安秀・29・兵庫 | 6-10 | ●古作 | ○北島 | ●高田 | ●田畑 | ●藤原 | ●中山 | ○杉本 | ●木下 | ●中川 | ●先崎 | ○小泉 | ●荒井 | ●伊藤 | ○庄司 | ○村松 | ○小池 |   16 |
# >> | 1期  | 藤原直哉 | 若松・22・兵庫   | 9-7  | ●北島 | ○伊藤 | ●田畑 | ○高田 | ○野田 | ●杉本 | ○中山 | ○木下 | ●先崎 | ●村松 | ○荒井 | ○小泉 | ○庄司 | ○古作 | ●小池 | ●中川 |    7 |
# >> | 1期  | 杉本昌隆 | 板谷進・18・愛知 | 10-6 | ●伊藤 | ●庄司 | ○小泉 | ○荒井 | ○中山 | ○藤原 | ●野田 | ○田畑 | ○高田 | ●小池 | ●中川 | ●木下 | ○古作 | ○北島 | ○先崎 | ○村松 |    3 |
# >> |------+----------+------------------+------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+------|
# >> |------------+----------+--------+-----+-----+------+------------------|
# >> | result_key | name     | mentor | age | win | lose | ox               |
# >> |------------+----------+--------+-----+-----+------+------------------|
# >> | 維         | 村松央一 | 平野   |  28 |   7 |    9 | xxxooxoooooxxxxx |
# >> | 維         | 田畑良太 | 大友   |  24 |   9 |    7 | xoooxxoxxoxoooxo |
# >> | 維         | 小泉有明 | 芹沢   |  23 |   6 |   10 | oxxxxxoxxoxxxooo |
# >> | 維         | 伊藤能   | 米長   |  25 |   8 |    8 | oxooxxxoooxxxoox |
# >> | 維         | 荒井孝則 | 西村   |  23 |   5 |   11 | oxxxxoxxxoxoxxox |
# >> | 維         | 古作登   | 松下   |  24 |   9 |    7 | oxxxoooooooxxxox |
# >> | 維         | 高田尚平 | 荒巻   |  25 |   9 |    7 | xooxoxooxxoxxooo |
# >> | 維         | 庄司俊之 | 佐瀬   |  18 |   8 |    8 | oooooxxoxxooxxxx |
# >> | 維         | 木下浩一 | 松田   |  20 |   6 |   10 | oxxxxooxxoxoxxxo |
# >> | 昇         | 中川大輔 | 米長   |  19 |  13 |    3 | oooxooxxoooooooo |
# >> | 維         | 北島忠雄 | 関根   |  21 |   6 |   10 | oxxoooxxxxxxooxx |
# >> | 昇         | 先崎学   | 米長   |  17 |  12 |    4 | oxoooxooooooxoxo |
# >> | 維         | 小池裕樹 | 安恵   |  20 |   6 |   10 | xoxoxxxooxxxoxox |
# >> | 維         | 中山則男 | 板谷進 |  27 |   7 |    9 | xoooxoxxoxooxxxx |
# >> | 維         | 野田敬三 | 森安秀 |  29 |   6 |   10 | xoxxxxoxxxoxxooo |
# >> | 維         | 藤原直哉 | 若松   |  22 |   9 |    7 | xoxooxooxxooooxx |
# >> | 維         | 杉本昌隆 | 板谷進 |  18 |  10 |    6 | xxooooxooxxxoooo |
# >> |------------+----------+--------+-----+-----+------+------------------|
