require "#{__dir__}/setup"
e = Ppl::MedievalSpider.new(season_key_vo: Ppl::SeasonKeyVo["2"], take_size: nil, verbose: false, sleep: 0)
tp e.source_url
tp e.table_values_array
tp e.table_hash_array
tp e.call
# >> |------------------------------------------------------------------------------|
# >> | https://www.ne.jp/asahi/yaston/shogi/syoreikai/3dan/league/3dan_league02.htm |
# >> |------------------------------------------------------------------------------|
# >> |------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
# >> | ["参加", "順位", "氏名", "師匠・年齢・出身", "成績", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "順位"]                                                                    |
# >> | ["2期", "1", "杉本昌隆", "板谷進・19・愛知", "8-7", "●小泉", "●古作", "○庄司", "○藤原", "●荒井", "●中山", "●高田", "○小池", "○伊藤", "●野田", "●北島", "○畠山", "○田畑", "○村松", "○木下", "5"]   |
# >> | ["2期", "2", "田畑良太", "大友・24・東京", "8-7", "●高田", "○村松", "●荒井", "○伊藤", "○古作", "●小池", "○中山", "○木下", "●北島", "○小泉", "○庄司", "●野田", "●杉本", "○藤原", "●畠山", "6"]     |
# >> | ["2期", "2", "古作登", "松下・24・東京", "8-7", "○藤原", "○杉本", "○中山", "○野田", "●田畑", "●高田", "●北島", "○庄司", "●荒井", "●村松", "○小池", "●伊藤", "○木下", "○畠山", "●小泉", "6"]       |
# >> | ["2期", "2", "高田尚平", "荒巻・25・東京", "8-7", "○田畑", "●畠山", "○藤原", "○中山", "●庄司", "○古作", "○杉本", "○荒井", "●木下", "●小池", "●村松", "●北島", "○伊藤", "●小泉", "○野田", "6"]     |
# >> | ["2期", "2", "藤原直哉", "若松・22・兵庫", "5-10", "●古作", "○小泉", "●高田", "●杉本", "○野田", "○村松", "●庄司", "●伊藤", "●畠山", "○荒井", "●木下", "○小池", "●中山", "●田畑", "●北島", "14"]   |
# >> | ["2期", "6", "伊藤能", "米長・26・東京", "6-9", "○荒井", "○木下", "○北島", "●田畑", "○畠山", "●野田", "●小池", "○藤原", "●杉本", "●庄司", "●小泉", "○古作", "●高田", "●中山", "●村松", "12"]      |
# >> | ["2期", "6", "庄司俊之", "佐瀬・19・宮城", "5-10", "●野田", "●中山", "●杉本", "○畠山", "○高田", "●北島", "○藤原", "●古作", "●小泉", "○伊藤", "●田畑", "○村松", "●荒井", "●木下", "●小池", "15"]   |
# >> | ["2期", "8", "村松央一", "平野・28・千葉", "5-10", "●小池", "●田畑", "○小泉", "●木下", "○中山", "●藤原", "●荒井", "●畠山", "●野田", "○古作", "○高田", "●庄司", "●北島", "●杉本", "○伊藤", "16"]   |
# >> | ["2期", "8", "中山則男", "板谷進・28・香川", "8-7", "○北島", "○庄司", "●古作", "●高田", "●村松", "○杉本", "●田畑", "●野田", "●小池", "●木下", "○畠山", "○小泉", "○藤原", "○伊藤", "○荒井", "9"]   |
# >> | ["2期", "10", "小泉有明", "芹沢・23・東京", "8-7", "○杉本", "●藤原", "●村松", "●荒井", "○小池", "○木下", "●畠山", "○北島", "○庄司", "●田畑", "○伊藤", "●中山", "●野田", "○高田", "○古作", "10"]   |
# >> | ["2期", "10", "木下浩一", "松田・20・長野", "10-5", "○畠山", "●伊藤", "○小池", "○村松", "○北島", "●小泉", "○野田", "●田畑", "○高田", "○中山", "○藤原", "○荒井", "●古作", "○庄司", "●杉本", "1"]   |
# >> | ["2期", "10", "北島忠雄", "関根・22・埼玉", "9-6", "●中山", "●野田", "●伊藤", "○小池", "●木下", "○庄司", "○古作", "●小泉", "○田畑", "●畠山", "○杉本", "○高田", "○村松", "○荒井", "○藤原", "3"]    |
# >> | ["2期", "10", "小池裕樹", "安恵・20・東京", "9-6", "○村松", "○荒井", "●木下", "●北島", "●小泉", "○田畑", "○伊藤", "●杉本", "○中山", "○高田", "●古作", "●藤原", "○畠山", "○野田", "○庄司", "3"]    |
# >> | ["2期", "10", "野田敬三", "森安秀・30・兵庫", "10-5", "○庄司", "○北島", "○畠山", "●古作", "●藤原", "○伊藤", "●木下", "○中山", "○村松", "○杉本", "○荒井", "○田畑", "○小泉", "●小池", "●高田", "1"] |
# >> | ["2期", "15", "荒井孝則", "西村・23・埼玉", "6-9", "●伊藤", "●小池", "○田畑", "○小泉", "○杉本", "●畠山", "○村松", "●高田", "○古作", "●藤原", "●野田", "●木下", "○庄司", "●北島", "●中山", "13"]   |
# >> | ["1期", "16", "畠山成幸", "森安正・18・大阪", "7-8", "●木下", "○高田", "●野田", "●庄司", "●伊藤", "○荒井", "○小泉", "○村松", "○藤原", "○北島", "●中山", "●杉本", "●小池", "●古作", "○田畑", "11"] |
# >> |------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
# >> |------+------+----------+------------------+------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+-------|
# >> | 参加 | 順位 | 氏名     | 師匠・年齢・出身 | 成績 |      1 |      2 |      3 |      4 |      5 |      6 |      7 |      8 |      9 |     10 |     11 |     12 |     13 |     14 |     15 | 順位2 |
# >> |------+------+----------+------------------+------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+-------|
# >> | 2期  |    1 | 杉本昌隆 | 板谷進・19・愛知 | 8-7  | ●小泉 | ●古作 | ○庄司 | ○藤原 | ●荒井 | ●中山 | ●高田 | ○小池 | ○伊藤 | ●野田 | ●北島 | ○畠山 | ○田畑 | ○村松 | ○木下 |     5 |
# >> | 2期  |    2 | 田畑良太 | 大友・24・東京   | 8-7  | ●高田 | ○村松 | ●荒井 | ○伊藤 | ○古作 | ●小池 | ○中山 | ○木下 | ●北島 | ○小泉 | ○庄司 | ●野田 | ●杉本 | ○藤原 | ●畠山 |     6 |
# >> | 2期  |    2 | 古作登   | 松下・24・東京   | 8-7  | ○藤原 | ○杉本 | ○中山 | ○野田 | ●田畑 | ●高田 | ●北島 | ○庄司 | ●荒井 | ●村松 | ○小池 | ●伊藤 | ○木下 | ○畠山 | ●小泉 |     6 |
# >> | 2期  |    2 | 高田尚平 | 荒巻・25・東京   | 8-7  | ○田畑 | ●畠山 | ○藤原 | ○中山 | ●庄司 | ○古作 | ○杉本 | ○荒井 | ●木下 | ●小池 | ●村松 | ●北島 | ○伊藤 | ●小泉 | ○野田 |     6 |
# >> | 2期  |    2 | 藤原直哉 | 若松・22・兵庫   | 5-10 | ●古作 | ○小泉 | ●高田 | ●杉本 | ○野田 | ○村松 | ●庄司 | ●伊藤 | ●畠山 | ○荒井 | ●木下 | ○小池 | ●中山 | ●田畑 | ●北島 |    14 |
# >> | 2期  |    6 | 伊藤能   | 米長・26・東京   | 6-9  | ○荒井 | ○木下 | ○北島 | ●田畑 | ○畠山 | ●野田 | ●小池 | ○藤原 | ●杉本 | ●庄司 | ●小泉 | ○古作 | ●高田 | ●中山 | ●村松 |    12 |
# >> | 2期  |    6 | 庄司俊之 | 佐瀬・19・宮城   | 5-10 | ●野田 | ●中山 | ●杉本 | ○畠山 | ○高田 | ●北島 | ○藤原 | ●古作 | ●小泉 | ○伊藤 | ●田畑 | ○村松 | ●荒井 | ●木下 | ●小池 |    15 |
# >> | 2期  |    8 | 村松央一 | 平野・28・千葉   | 5-10 | ●小池 | ●田畑 | ○小泉 | ●木下 | ○中山 | ●藤原 | ●荒井 | ●畠山 | ●野田 | ○古作 | ○高田 | ●庄司 | ●北島 | ●杉本 | ○伊藤 |    16 |
# >> | 2期  |    8 | 中山則男 | 板谷進・28・香川 | 8-7  | ○北島 | ○庄司 | ●古作 | ●高田 | ●村松 | ○杉本 | ●田畑 | ●野田 | ●小池 | ●木下 | ○畠山 | ○小泉 | ○藤原 | ○伊藤 | ○荒井 |     9 |
# >> | 2期  |   10 | 小泉有明 | 芹沢・23・東京   | 8-7  | ○杉本 | ●藤原 | ●村松 | ●荒井 | ○小池 | ○木下 | ●畠山 | ○北島 | ○庄司 | ●田畑 | ○伊藤 | ●中山 | ●野田 | ○高田 | ○古作 |    10 |
# >> | 2期  |   10 | 木下浩一 | 松田・20・長野   | 10-5 | ○畠山 | ●伊藤 | ○小池 | ○村松 | ○北島 | ●小泉 | ○野田 | ●田畑 | ○高田 | ○中山 | ○藤原 | ○荒井 | ●古作 | ○庄司 | ●杉本 |     1 |
# >> | 2期  |   10 | 北島忠雄 | 関根・22・埼玉   | 9-6  | ●中山 | ●野田 | ●伊藤 | ○小池 | ●木下 | ○庄司 | ○古作 | ●小泉 | ○田畑 | ●畠山 | ○杉本 | ○高田 | ○村松 | ○荒井 | ○藤原 |     3 |
# >> | 2期  |   10 | 小池裕樹 | 安恵・20・東京   | 9-6  | ○村松 | ○荒井 | ●木下 | ●北島 | ●小泉 | ○田畑 | ○伊藤 | ●杉本 | ○中山 | ○高田 | ●古作 | ●藤原 | ○畠山 | ○野田 | ○庄司 |     3 |
# >> | 2期  |   10 | 野田敬三 | 森安秀・30・兵庫 | 10-5 | ○庄司 | ○北島 | ○畠山 | ●古作 | ●藤原 | ○伊藤 | ●木下 | ○中山 | ○村松 | ○杉本 | ○荒井 | ○田畑 | ○小泉 | ●小池 | ●高田 |     1 |
# >> | 2期  |   15 | 荒井孝則 | 西村・23・埼玉   | 6-9  | ●伊藤 | ●小池 | ○田畑 | ○小泉 | ○杉本 | ●畠山 | ○村松 | ●高田 | ○古作 | ●藤原 | ●野田 | ●木下 | ○庄司 | ●北島 | ●中山 |    13 |
# >> | 1期  |   16 | 畠山成幸 | 森安正・18・大阪 | 7-8  | ●木下 | ○高田 | ●野田 | ●庄司 | ●伊藤 | ○荒井 | ○小泉 | ○村松 | ○藤原 | ○北島 | ●中山 | ●杉本 | ●小池 | ●古作 | ○田畑 |    11 |
# >> |------+------+----------+------------------+------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+-------|
# >> |------------+----------+--------+-----+-----+------+-----------------+-------------|
# >> | result_key | name     | mentor | age | win | lose | ox              | ranking_pos |
# >> |------------+----------+--------+-----+-----+------+-----------------+-------------|
# >> | 維持       | 杉本昌隆 | 板谷進 |  19 |   8 |    7 | xxooxxxooxxoooo |           5 |
# >> | 維持       | 田畑良太 | 大友   |  24 |   8 |    7 | xoxooxooxooxxox |           6 |
# >> | 維持       | 古作登   | 松下   |  24 |   8 |    7 | ooooxxxoxxoxoox |           6 |
# >> | 維持       | 高田尚平 | 荒巻   |  25 |   8 |    7 | oxooxoooxxxxoxo |           6 |
# >> | 維持       | 藤原直哉 | 若松   |  22 |   5 |   10 | xoxxooxxxoxoxxx |          14 |
# >> | 維持       | 伊藤能   | 米長   |  26 |   6 |    9 | oooxoxxoxxxoxxx |          12 |
# >> | 維持       | 庄司俊之 | 佐瀬   |  19 |   5 |   10 | xxxooxoxxoxoxxx |          15 |
# >> | 維持       | 村松央一 | 平野   |  28 |   5 |   10 | xxoxoxxxxooxxxo |          16 |
# >> | 維持       | 中山則男 | 板谷進 |  28 |   8 |    7 | ooxxxoxxxxooooo |           9 |
# >> | 維持       | 小泉有明 | 芹沢   |  23 |   8 |    7 | oxxxooxooxoxxoo |          10 |
# >> | 昇段       | 木下浩一 | 松田   |  20 |  10 |    5 | oxoooxoxooooxox |           1 |
# >> | 維持       | 北島忠雄 | 関根   |  22 |   9 |    6 | xxxoxooxoxooooo |           3 |
# >> | 維持       | 小池裕樹 | 安恵   |  20 |   9 |    6 | ooxxxooxooxxooo |           3 |
# >> | 昇段       | 野田敬三 | 森安秀 |  30 |  10 |    5 | oooxxoxooooooxx |           1 |
# >> | 維持       | 荒井孝則 | 西村   |  23 |   6 |    9 | xxoooxoxoxxxoxx |          13 |
# >> | 維持       | 畠山成幸 | 森安正 |  18 |   7 |    8 | xoxxxoooooxxxxo |          11 |
# >> |------------+----------+--------+-----+-----+------+-----------------+-------------|
