require "#{__dir__}/setup"
e = Ppl::ModernitySpider.new(season_key_vo: Ppl::SeasonKeyVo["66"], take_size: nil, verbose: false, sleep: 0, mock: false)
tp e.table_values_array
tp e.table_hash_array
tp e.call
# >> |------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
# >> | ["結果", "順位", "氏名", "師匠", "年齢", "勝", "敗", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18"]                                                                                  |
# >> | ["", "1", "古賀悠聖", "中田功", "18", "6", "12", "○谷合", "●齊藤", "●横山", "○狩山", "●井田", "●貫島", "●小髙", "○伊藤", "●川村", "●柵木", "●山川", "●岡井", "○関矢", "○服部", "●冨田", "●宮嶋", "●荒田", "○中沢"]     |
# >> | ["昇", "2", "服部慎一郎", "中田章", "20", "14", "4", "○田中", "○古田", "○徳田", "○伊藤", "○柵木", "○井田", "●相川", "○宮田", "●横山", "○関矢", "○冨田", "○三田", "○川村", "●古賀", "●荒田", "○貫島", "○岡部", "○小髙"] |
# >> | ["", "3", "関矢寛之", "武者野", "26", "9", "9", "●三田", "●柵木", "○川村", "○谷合", "○小髙", "○古田", "●西山", "○岡井", "●徳田", "●服部", "○中沢", "●荒田", "●古賀", "○冨田", "●岡部", "○相川", "●井田", "○上野"]      |
# >> | ["昇", "4", "谷合廣紀", "中座", "25", "14", "4", "●古賀", "●井田", "○岡井", "●関矢", "○冨田", "○三田", "○岡部", "○小山", "○荒田", "○中沢", "○宮田", "○宮嶋", "○田中", "○山川", "○川村", "○小髙", "○柵木", "●狩山"]     |
# >> | ["", "5", "柵木幹太", "増田裕", "21", "10", "8", "●中沢", "○関矢", "●小髙", "○横山", "●服部", "●上野", "○田中", "○冨田", "●貫島", "○古賀", "●古田", "○西山", "○森本", "●齊藤", "○狩山", "○宮田", "●谷合", "○川村"]     |
# >> | ["", "6", "荒田敏史", "石田和", "26", "8", "10", "●森本", "●川村", "●山川", "●中沢", "○古田", "●岡部", "○宮田", "●横山", "●谷合", "●小山", "●小髙", "○関矢", "○相川", "○伊藤", "○服部", "○冨田", "○古賀", "●井田"]     |
# >> | ["", "7", "井田明宏", "小林健", "22", "13", "5", "○岡部", "○谷合", "●三田", "○田中", "○古賀", "●服部", "○中沢", "○相川", "●森本", "○徳田", "○岡井", "○山川", "●冨田", "○上野", "●宮嶋", "○横山", "○関矢", "○荒田"]     |
# >> | ["", "8", "伊藤匠", "宮田利", "16", "9", "9", "●貫島", "○宮田", "○冨田", "●服部", "●相川", "○齊藤", "○森本", "●古賀", "●岡井", "●古田", "○川村", "○田中", "●小髙", "●荒田", "○山川", "○岡部", "○上野", "●西山"]        |
# >> | ["", "9", "岡部怜央", "加瀬", "20", "8", "10", "●井田", "○三田", "●古田", "●齊藤", "○中沢", "○荒田", "●谷合", "○西山", "●宮嶋", "○狩山", "○田中", "●相川", "●横山", "●徳田", "○関矢", "●伊藤", "●服部", "○宮田"]       |
# >> | ["", "10", "上野裕寿", "井上", "16", "7", "11", "●岡井", "○小髙", "○狩山", "●相川", "●西山", "○柵木", "○貫島", "○森本", "●冨田", "●宮田", "●小山", "○徳田", "●古田", "●井田", "○中沢", "●三田", "●伊藤", "●関矢"]      |
# >> | ["", "11", "三田敏弘", "中田章", "23", "9", "9", "○関矢", "●岡部", "○井田", "○小髙", "○小山", "●谷合", "○宮嶋", "●狩山", "○宮田", "○齊藤", "●森本", "●服部", "●岡井", "●貫島", "●徳田", "○上野", "●山川", "○田中"]     |
# >> | ["", "12", "貫島永州", "小林健", "21", "11", "7", "○伊藤", "○岡井", "●宮嶋", "○宮田", "○森本", "○古賀", "●上野", "○田中", "○柵木", "●冨田", "●西山", "○古田", "●徳田", "○三田", "○横山", "●服部", "○齊藤", "●相川"]    |
# >> | ["", "13", "山川泰煕", "広瀬", "21", "8", "10", "●宮田", "○森本", "○荒田", "○小山", "●狩山", "●横山", "●川村", "○古田", "●相川", "●西山", "○古賀", "●井田", "●中沢", "●谷合", "●伊藤", "○田中", "○三田", "○冨田"]      |
# >> | ["", "14", "小山直希", "戸辺", "19", "13", "5", "○古田", "○冨田", "○齊藤", "●山川", "●三田", "○森本", "●岡井", "●谷合", "○小髙", "○荒田", "○上野", "○横山", "●西山", "○相川", "○田中", "○川村", "○宮嶋", "○徳田"]      |
# >> | ["", "15", "岡井良樹", "大野", "24", "8", "10", "○上野", "●貫島", "●谷合", "●西山", "○川村", "●田中", "○小山", "●関矢", "○伊藤", "○相川", "●井田", "○古賀", "○三田", "●狩山", "●古田", "○齊藤", "●冨田", "●森本"]      |
# >> | ["", "16", "冨田誠也", "小林健", "23", "6", "12", "●西山", "●小山", "●伊藤", "○宮嶋", "●谷合", "●狩山", "●横山", "●柵木", "○上野", "○貫島", "●服部", "●森本", "○井田", "●関矢", "○古賀", "●荒田", "○岡井", "●山川"]    |
# >> | ["", "17", "齊藤優希", "深浦", "23", "10", "8", "○横山", "○古賀", "●小山", "○岡部", "○田中", "●伊藤", "○古田", "○川村", "●狩山", "●三田", "●相川", "○中沢", "●宮田", "○柵木", "○小髙", "●岡井", "●貫島", "○宮嶋"]      |
# >> | ["", "18", "徳田拳士", "小林健", "21", "11", "7", "●川村", "○西山", "●服部", "○森本", "○横山", "○宮田", "○狩山", "●小髙", "○関矢", "●井田", "○宮嶋", "●上野", "○貫島", "○岡部", "○三田", "○中沢", "●古田", "●小山"]    |
# >> | ["", "19", "横山友紀", "井上", "19", "9", "9", "●齊藤", "●相川", "○古賀", "●柵木", "●徳田", "○山川", "○冨田", "○荒田", "○服部", "●宮嶋", "○狩山", "●小山", "○岡部", "○宮田", "●貫島", "●井田", "●西山", "○古田"]       |
# >> | ["", "20", "古田龍生", "宮田利", "22", "6", "12", "●小山", "●服部", "○岡部", "●川村", "●荒田", "●関矢", "●齊藤", "●山川", "●中沢", "○伊藤", "○柵木", "●貫島", "○上野", "●森本", "○岡井", "●西山", "○徳田", "●横山"]    |
# >> | ["次", "21", "西山朋佳", "伊藤博", "24", "14", "4", "○冨田", "●徳田", "○中沢", "○岡井", "○上野", "○宮嶋", "○関矢", "●岡部", "○田中", "○山川", "○貫島", "●柵木", "○小山", "●小髙", "○相川", "○古田", "○横山", "○伊藤"]  |
# >> | ["", "22", "小髙悠太郎", "所司", "23", "8", "10", "○狩山", "●上野", "○柵木", "●三田", "●関矢", "●中沢", "○古賀", "○徳田", "●小山", "○田中", "○荒田", "●川村", "○伊藤", "○西山", "●齊藤", "●谷合", "●森本", "●服部"]    |
# >> | ["", "23", "中沢良輔", "飯野", "21", "8", "10", "○柵木", "○狩山", "●西山", "○荒田", "●岡部", "○小髙", "●井田", "●宮嶋", "○古田", "●谷合", "●関矢", "●齊藤", "○山川", "○田中", "●上野", "●徳田", "○相川", "●古賀"]      |
# >> | ["", "24", "森本才跳", "小林健", "18", "10", "8", "○荒田", "●山川", "●相川", "●徳田", "●貫島", "●小山", "●伊藤", "●上野", "○井田", "○川村", "○三田", "○冨田", "●柵木", "○古田", "○宮田", "○狩山", "○小髙", "○岡井"]    |
# >> | ["", "25", "川村悠人", "小倉", "20", "8", "10", "○徳田", "○荒田", "●関矢", "○古田", "●岡井", "●相川", "○山川", "●齊藤", "○古賀", "●森本", "●伊藤", "○小髙", "●服部", "○宮嶋", "●谷合", "●小山", "○宮田", "●柵木"]      |
# >> | ["", "26", "相川浩治", "安恵", "23", "10", "8", "●宮嶋", "○横山", "○森本", "○上野", "○伊藤", "○川村", "○服部", "●井田", "○山川", "●岡井", "○齊藤", "○岡部", "●荒田", "●小山", "●西山", "●関矢", "●中沢", "○貫島"]      |
# >> | ["", "27", "田中大貴", "北島", "20", "3", "15", "●服部", "●宮嶋", "○宮田", "●井田", "●齊藤", "○岡井", "●柵木", "●貫島", "●西山", "●小髙", "●岡部", "●伊藤", "●谷合", "●中沢", "●小山", "●山川", "○狩山", "●三田"]      |
# >> | ["", "28", "宮田大暉", "杉本昌", "20", "4", "14", "○山川", "●伊藤", "●田中", "●貫島", "○宮嶋", "●徳田", "●荒田", "●服部", "●三田", "○上野", "●谷合", "●狩山", "○齊藤", "●横山", "●森本", "●柵木", "●川村", "●岡部"]    |
# >> | ["", "29", "宮嶋健太", "大野", "20", "9", "9", "○相川", "○田中", "○貫島", "●冨田", "●宮田", "●西山", "●三田", "○中沢", "○岡部", "○横山", "●徳田", "●谷合", "○狩山", "●川村", "○井田", "○古賀", "●小山", "●齊藤"]       |
# >> | ["", "30", "狩山幹生", "井上", "17", "7", "11", "●小髙", "●中沢", "●上野", "●古賀", "○山川", "○冨田", "●徳田", "○三田", "○齊藤", "●岡部", "●横山", "○宮田", "●宮嶋", "○岡井", "●柵木", "●森本", "●田中", "○谷合"]      |
# >> |------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
# >> |------+------+------------+--------+------+----+----+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------|
# >> | 結果 | 順位 | 氏名       | 師匠   | 年齢 | 勝 | 敗 |      1 |      2 |      3 |      4 |      5 |      6 |      7 |      8 |      9 |     10 |     11 |     12 |     13 |     14 |     15 |     16 |     17 |     18 |
# >> |------+------+------------+--------+------+----+----+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------|
# >> |      |    1 | 古賀悠聖   | 中田功 |   18 |  6 | 12 | ○谷合 | ●齊藤 | ●横山 | ○狩山 | ●井田 | ●貫島 | ●小髙 | ○伊藤 | ●川村 | ●柵木 | ●山川 | ●岡井 | ○関矢 | ○服部 | ●冨田 | ●宮嶋 | ●荒田 | ○中沢 |
# >> | 昇   |    2 | 服部慎一郎 | 中田章 |   20 | 14 |  4 | ○田中 | ○古田 | ○徳田 | ○伊藤 | ○柵木 | ○井田 | ●相川 | ○宮田 | ●横山 | ○関矢 | ○冨田 | ○三田 | ○川村 | ●古賀 | ●荒田 | ○貫島 | ○岡部 | ○小髙 |
# >> |      |    3 | 関矢寛之   | 武者野 |   26 |  9 |  9 | ●三田 | ●柵木 | ○川村 | ○谷合 | ○小髙 | ○古田 | ●西山 | ○岡井 | ●徳田 | ●服部 | ○中沢 | ●荒田 | ●古賀 | ○冨田 | ●岡部 | ○相川 | ●井田 | ○上野 |
# >> | 昇   |    4 | 谷合廣紀   | 中座   |   25 | 14 |  4 | ●古賀 | ●井田 | ○岡井 | ●関矢 | ○冨田 | ○三田 | ○岡部 | ○小山 | ○荒田 | ○中沢 | ○宮田 | ○宮嶋 | ○田中 | ○山川 | ○川村 | ○小髙 | ○柵木 | ●狩山 |
# >> |      |    5 | 柵木幹太   | 増田裕 |   21 | 10 |  8 | ●中沢 | ○関矢 | ●小髙 | ○横山 | ●服部 | ●上野 | ○田中 | ○冨田 | ●貫島 | ○古賀 | ●古田 | ○西山 | ○森本 | ●齊藤 | ○狩山 | ○宮田 | ●谷合 | ○川村 |
# >> |      |    6 | 荒田敏史   | 石田和 |   26 |  8 | 10 | ●森本 | ●川村 | ●山川 | ●中沢 | ○古田 | ●岡部 | ○宮田 | ●横山 | ●谷合 | ●小山 | ●小髙 | ○関矢 | ○相川 | ○伊藤 | ○服部 | ○冨田 | ○古賀 | ●井田 |
# >> |      |    7 | 井田明宏   | 小林健 |   22 | 13 |  5 | ○岡部 | ○谷合 | ●三田 | ○田中 | ○古賀 | ●服部 | ○中沢 | ○相川 | ●森本 | ○徳田 | ○岡井 | ○山川 | ●冨田 | ○上野 | ●宮嶋 | ○横山 | ○関矢 | ○荒田 |
# >> |      |    8 | 伊藤匠     | 宮田利 |   16 |  9 |  9 | ●貫島 | ○宮田 | ○冨田 | ●服部 | ●相川 | ○齊藤 | ○森本 | ●古賀 | ●岡井 | ●古田 | ○川村 | ○田中 | ●小髙 | ●荒田 | ○山川 | ○岡部 | ○上野 | ●西山 |
# >> |      |    9 | 岡部怜央   | 加瀬   |   20 |  8 | 10 | ●井田 | ○三田 | ●古田 | ●齊藤 | ○中沢 | ○荒田 | ●谷合 | ○西山 | ●宮嶋 | ○狩山 | ○田中 | ●相川 | ●横山 | ●徳田 | ○関矢 | ●伊藤 | ●服部 | ○宮田 |
# >> |      |   10 | 上野裕寿   | 井上   |   16 |  7 | 11 | ●岡井 | ○小髙 | ○狩山 | ●相川 | ●西山 | ○柵木 | ○貫島 | ○森本 | ●冨田 | ●宮田 | ●小山 | ○徳田 | ●古田 | ●井田 | ○中沢 | ●三田 | ●伊藤 | ●関矢 |
# >> |      |   11 | 三田敏弘   | 中田章 |   23 |  9 |  9 | ○関矢 | ●岡部 | ○井田 | ○小髙 | ○小山 | ●谷合 | ○宮嶋 | ●狩山 | ○宮田 | ○齊藤 | ●森本 | ●服部 | ●岡井 | ●貫島 | ●徳田 | ○上野 | ●山川 | ○田中 |
# >> |      |   12 | 貫島永州   | 小林健 |   21 | 11 |  7 | ○伊藤 | ○岡井 | ●宮嶋 | ○宮田 | ○森本 | ○古賀 | ●上野 | ○田中 | ○柵木 | ●冨田 | ●西山 | ○古田 | ●徳田 | ○三田 | ○横山 | ●服部 | ○齊藤 | ●相川 |
# >> |      |   13 | 山川泰煕   | 広瀬   |   21 |  8 | 10 | ●宮田 | ○森本 | ○荒田 | ○小山 | ●狩山 | ●横山 | ●川村 | ○古田 | ●相川 | ●西山 | ○古賀 | ●井田 | ●中沢 | ●谷合 | ●伊藤 | ○田中 | ○三田 | ○冨田 |
# >> |      |   14 | 小山直希   | 戸辺   |   19 | 13 |  5 | ○古田 | ○冨田 | ○齊藤 | ●山川 | ●三田 | ○森本 | ●岡井 | ●谷合 | ○小髙 | ○荒田 | ○上野 | ○横山 | ●西山 | ○相川 | ○田中 | ○川村 | ○宮嶋 | ○徳田 |
# >> |      |   15 | 岡井良樹   | 大野   |   24 |  8 | 10 | ○上野 | ●貫島 | ●谷合 | ●西山 | ○川村 | ●田中 | ○小山 | ●関矢 | ○伊藤 | ○相川 | ●井田 | ○古賀 | ○三田 | ●狩山 | ●古田 | ○齊藤 | ●冨田 | ●森本 |
# >> |      |   16 | 冨田誠也   | 小林健 |   23 |  6 | 12 | ●西山 | ●小山 | ●伊藤 | ○宮嶋 | ●谷合 | ●狩山 | ●横山 | ●柵木 | ○上野 | ○貫島 | ●服部 | ●森本 | ○井田 | ●関矢 | ○古賀 | ●荒田 | ○岡井 | ●山川 |
# >> |      |   17 | 齊藤優希   | 深浦   |   23 | 10 |  8 | ○横山 | ○古賀 | ●小山 | ○岡部 | ○田中 | ●伊藤 | ○古田 | ○川村 | ●狩山 | ●三田 | ●相川 | ○中沢 | ●宮田 | ○柵木 | ○小髙 | ●岡井 | ●貫島 | ○宮嶋 |
# >> |      |   18 | 徳田拳士   | 小林健 |   21 | 11 |  7 | ●川村 | ○西山 | ●服部 | ○森本 | ○横山 | ○宮田 | ○狩山 | ●小髙 | ○関矢 | ●井田 | ○宮嶋 | ●上野 | ○貫島 | ○岡部 | ○三田 | ○中沢 | ●古田 | ●小山 |
# >> |      |   19 | 横山友紀   | 井上   |   19 |  9 |  9 | ●齊藤 | ●相川 | ○古賀 | ●柵木 | ●徳田 | ○山川 | ○冨田 | ○荒田 | ○服部 | ●宮嶋 | ○狩山 | ●小山 | ○岡部 | ○宮田 | ●貫島 | ●井田 | ●西山 | ○古田 |
# >> |      |   20 | 古田龍生   | 宮田利 |   22 |  6 | 12 | ●小山 | ●服部 | ○岡部 | ●川村 | ●荒田 | ●関矢 | ●齊藤 | ●山川 | ●中沢 | ○伊藤 | ○柵木 | ●貫島 | ○上野 | ●森本 | ○岡井 | ●西山 | ○徳田 | ●横山 |
# >> | 次   |   21 | 西山朋佳   | 伊藤博 |   24 | 14 |  4 | ○冨田 | ●徳田 | ○中沢 | ○岡井 | ○上野 | ○宮嶋 | ○関矢 | ●岡部 | ○田中 | ○山川 | ○貫島 | ●柵木 | ○小山 | ●小髙 | ○相川 | ○古田 | ○横山 | ○伊藤 |
# >> |      |   22 | 小髙悠太郎 | 所司   |   23 |  8 | 10 | ○狩山 | ●上野 | ○柵木 | ●三田 | ●関矢 | ●中沢 | ○古賀 | ○徳田 | ●小山 | ○田中 | ○荒田 | ●川村 | ○伊藤 | ○西山 | ●齊藤 | ●谷合 | ●森本 | ●服部 |
# >> |      |   23 | 中沢良輔   | 飯野   |   21 |  8 | 10 | ○柵木 | ○狩山 | ●西山 | ○荒田 | ●岡部 | ○小髙 | ●井田 | ●宮嶋 | ○古田 | ●谷合 | ●関矢 | ●齊藤 | ○山川 | ○田中 | ●上野 | ●徳田 | ○相川 | ●古賀 |
# >> |      |   24 | 森本才跳   | 小林健 |   18 | 10 |  8 | ○荒田 | ●山川 | ●相川 | ●徳田 | ●貫島 | ●小山 | ●伊藤 | ●上野 | ○井田 | ○川村 | ○三田 | ○冨田 | ●柵木 | ○古田 | ○宮田 | ○狩山 | ○小髙 | ○岡井 |
# >> |      |   25 | 川村悠人   | 小倉   |   20 |  8 | 10 | ○徳田 | ○荒田 | ●関矢 | ○古田 | ●岡井 | ●相川 | ○山川 | ●齊藤 | ○古賀 | ●森本 | ●伊藤 | ○小髙 | ●服部 | ○宮嶋 | ●谷合 | ●小山 | ○宮田 | ●柵木 |
# >> |      |   26 | 相川浩治   | 安恵   |   23 | 10 |  8 | ●宮嶋 | ○横山 | ○森本 | ○上野 | ○伊藤 | ○川村 | ○服部 | ●井田 | ○山川 | ●岡井 | ○齊藤 | ○岡部 | ●荒田 | ●小山 | ●西山 | ●関矢 | ●中沢 | ○貫島 |
# >> |      |   27 | 田中大貴   | 北島   |   20 |  3 | 15 | ●服部 | ●宮嶋 | ○宮田 | ●井田 | ●齊藤 | ○岡井 | ●柵木 | ●貫島 | ●西山 | ●小髙 | ●岡部 | ●伊藤 | ●谷合 | ●中沢 | ●小山 | ●山川 | ○狩山 | ●三田 |
# >> |      |   28 | 宮田大暉   | 杉本昌 |   20 |  4 | 14 | ○山川 | ●伊藤 | ●田中 | ●貫島 | ○宮嶋 | ●徳田 | ●荒田 | ●服部 | ●三田 | ○上野 | ●谷合 | ●狩山 | ○齊藤 | ●横山 | ●森本 | ●柵木 | ●川村 | ●岡部 |
# >> |      |   29 | 宮嶋健太   | 大野   |   20 |  9 |  9 | ○相川 | ○田中 | ○貫島 | ●冨田 | ●宮田 | ●西山 | ●三田 | ○中沢 | ○岡部 | ○横山 | ●徳田 | ●谷合 | ○狩山 | ●川村 | ○井田 | ○古賀 | ●小山 | ●齊藤 |
# >> |      |   30 | 狩山幹生   | 井上   |   17 |  7 | 11 | ●小髙 | ●中沢 | ●上野 | ●古賀 | ○山川 | ○冨田 | ●徳田 | ○三田 | ○齊藤 | ●岡部 | ●横山 | ○宮田 | ●宮嶋 | ○岡井 | ●柵木 | ●森本 | ●田中 | ○谷合 |
# >> |------+------+------------+--------+------+----+----+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+--------|
# >> |------------+------------+--------+-----+-----+------+--------------------|
# >> | result_key | name       | mentor | age | win | lose | ox                 |
# >> |------------+------------+--------+-----+-----+------+--------------------|
# >> | 維         | 古賀悠聖   | 中田功 |  18 |   6 |   12 | oxxoxxxoxxxxooxxxo |
# >> | 昇         | 服部慎一郎 | 中田章 |  20 |  14 |    4 | ooooooxoxooooxxooo |
# >> | 維         | 関矢寛之   | 武者野 |  26 |   9 |    9 | xxooooxoxxoxxoxoxo |
# >> | 昇         | 谷合廣紀   | 中座   |  25 |  14 |    4 | xxoxooooooooooooox |
# >> | 維         | 柵木幹太   | 増田裕 |  21 |  10 |    8 | xoxoxxooxoxooxooxo |
# >> | 維         | 荒田敏史   | 石田和 |  26 |   8 |   10 | xxxxoxoxxxxoooooox |
# >> | 維         | 井田明宏   | 小林健 |  22 |  13 |    5 | ooxooxooxoooxoxooo |
# >> | 維         | 伊藤匠     | 宮田利 |  16 |   9 |    9 | xooxxooxxxooxxooox |
# >> | 維         | 岡部怜央   | 加瀬   |  20 |   8 |   10 | xoxxooxoxooxxxoxxo |
# >> | 維         | 上野裕寿   | 井上   |  16 |   7 |   11 | xooxxoooxxxoxxoxxx |
# >> | 維         | 三田敏弘   | 中田章 |  23 |   9 |    9 | oxoooxoxooxxxxxoxo |
# >> | 維         | 貫島永州   | 小林健 |  21 |  11 |    7 | ooxoooxooxxoxooxox |
# >> | 維         | 山川泰煕   | 広瀬   |  21 |   8 |   10 | xoooxxxoxxoxxxxooo |
# >> | 維         | 小山直希   | 戸辺   |  19 |  13 |    5 | oooxxoxxooooxooooo |
# >> | 維         | 岡井良樹   | 大野   |  24 |   8 |   10 | oxxxoxoxooxooxxoxx |
# >> | 維         | 冨田誠也   | 小林健 |  23 |   6 |   12 | xxxoxxxxooxxoxoxox |
# >> | 維         | 齊藤優希   | 深浦   |  23 |  10 |    8 | ooxooxooxxxoxooxxo |
# >> | 維         | 徳田拳士   | 小林健 |  21 |  11 |    7 | xoxooooxoxoxooooxx |
# >> | 維         | 横山友紀   | 井上   |  19 |   9 |    9 | xxoxxooooxoxooxxxo |
# >> | 維         | 古田龍生   | 宮田利 |  22 |   6 |   12 | xxoxxxxxxooxoxoxox |
# >> | 次         | 西山朋佳   | 伊藤博 |  24 |  14 |    4 | oxoooooxoooxoxoooo |
# >> | 維         | 小髙悠太郎 | 所司   |  23 |   8 |   10 | oxoxxxooxooxooxxxx |
# >> | 維         | 中沢良輔   | 飯野   |  21 |   8 |   10 | ooxoxoxxoxxxooxxox |
# >> | 維         | 森本才跳   | 小林健 |  18 |  10 |    8 | oxxxxxxxooooxooooo |
# >> | 維         | 川村悠人   | 小倉   |  20 |   8 |   10 | ooxoxxoxoxxoxoxxox |
# >> | 維         | 相川浩治   | 安恵   |  23 |  10 |    8 | xooooooxoxooxxxxxo |
# >> | 維         | 田中大貴   | 北島   |  20 |   3 |   15 | xxoxxoxxxxxxxxxxox |
# >> | 維         | 宮田大暉   | 杉本昌 |  20 |   4 |   14 | oxxxoxxxxoxxoxxxxx |
# >> | 維         | 宮嶋健太   | 大野   |  20 |   9 |    9 | oooxxxxoooxxoxooxx |
# >> | 維         | 狩山幹生   | 井上   |  17 |   7 |   11 | xxxxooxooxxoxoxxxo |
# >> |------------+------------+--------+-----+-----+------+--------------------|
