#!/usr/bin/env ruby
require File.expand_path('../../config/environment', __FILE__)

RoomChatMessage.destroy_all
ChatUser.destroy_all
ChatRoom.destroy_all
ChatMembership.destroy_all

alice = ChatUser.create!
bob = ChatUser.create!

chat_room = alice.owner_rooms.create!
chat_room.chat_users << alice
chat_room.chat_users << bob

tp chat_room.chat_memberships

alice.room_chat_messages.create(chat_room: chat_room, message: "(body)")
tp RoomChatMessage

tp chat_room

alice.update!(current_chat_room: chat_room)
tp chat_room.current_chat_users

# >> |----+--------------+--------------+------------+--------------+----------+------------+-----------------+---------------------------+---------------------------|
# >> | id | chat_room_id | chat_user_id | preset_key | location_key | position | standby_at | fighting_now_at | created_at                | updated_at                |
# >> |----+--------------+--------------+------------+--------------+----------+------------+-----------------+---------------------------+---------------------------|
# >> |  1 |            1 |            2 | 平手       | black        |        0 |            |                 | 2018-05-17 20:31:14 +0900 | 2018-05-17 20:31:14 +0900 |
# >> |  2 |            1 |            3 | 平手       | white        |        1 |            |                 | 2018-05-17 20:31:14 +0900 | 2018-05-17 20:31:14 +0900 |
# >> |----+--------------+--------------+------------+--------------+----------+------------+-----------------+---------------------------+---------------------------|
# >> |----+--------------+--------------+---------+---------------------------+---------------------------|
# >> | id | chat_room_id | chat_user_id | message | created_at                | updated_at                |
# >> |----+--------------+--------------+---------+---------------------------+---------------------------|
# >> |  1 |            1 |            2 | (body)  | 2018-05-17 20:31:14 +0900 | 2018-05-17 20:31:14 +0900 |
# >> |----+--------------+--------------+---------+---------------------------+---------------------------|
# >> |--------------------------+-------------------------------------------------------------------------------|
# >> |                       id | 1                                                                             |
# >> |            room_owner_id | 2                                                                             |
# >> |         black_preset_key | 平手                                                                          |
# >> |         white_preset_key | 平手                                                                          |
# >> |             lifetime_key | lifetime5_min                                                                 |
# >> |                     name | 野良1号の対戦部屋 #1                                                          |
# >> |           kifu_body_sfen | position sfen lnsgkgsnl/1r5b1/ppppppppp/9/9/9/PPPPPPPPP/1B5R1/LNSGKGSNL b - 1 |
# >> |             clock_counts | {:black=>[], :white=>[]}                                                      |
# >> |                 turn_max | 0                                                                             |
# >> |        battle_request_at |                                                                               |
# >> |          auto_matched_at |                                                                               |
# >> |                 begin_at |                                                                               |
# >> |                   end_at |                                                                               |
# >> |          last_action_key |                                                                               |
# >> |         win_location_key |                                                                               |
# >> | current_chat_users_count | 0                                                                             |
# >> |  watch_memberships_count | 0                                                                             |
# >> |               created_at | 2018-05-17 20:31:14 +0900                                                     |
# >> |               updated_at | 2018-05-17 20:31:14 +0900                                                     |
# >> |--------------------------+-------------------------------------------------------------------------------|
# >> |----+---------+----------------------+-----------+-----------------+-------------+---------------+---------------+---------------+---------------------------+---------------------------|
# >> | id | name    | current_chat_room_id | online_at | fighting_now_at | matching_at | lifetime_key  | ps_preset_key | po_preset_key | created_at                | updated_at                |
# >> |----+---------+----------------------+-----------+-----------------+-------------+---------------+---------------+---------------+---------------------------+---------------------------|
# >> |  2 | 野良1号 |                    1 |           |                 |             | lifetime5_min | 平手          | 平手          | 2018-05-17 20:31:14 +0900 | 2018-05-17 20:31:14 +0900 |
# >> |----+---------+----------------------+-----------+-----------------+-------------+---------------+---------------+---------------+---------------------------+---------------------------|
