#!/usr/bin/env ruby
require File.expand_path('../../config/environment', __FILE__)

module Swars
  user1 = User.create!
  user2 = User.create!

  battle = Battle.new
  battle.csa_seq = [["+5756FU", 0],["-5354FU", 0],["+5958OU", 0],["-5152OU", 0],["+5857OU", 0],["-5253OU", 0],["+5746OU", 0],["-5364OU", 0],["+4645OU", 0],["-6465OU", 0],["+4544OU", 0],["-6566OU", 0],["+4453OU", 0],["-6657OU", 0]]
  battle.memberships.build(user: user1, judge_key: :win,  location_key: :black)
  battle.memberships.build(user: user2, judge_key: :lose, location_key: :white)
  battle.save!                  # => true

  puts battle.to_cached_kifu(:kif)
  battle.note_tag_list     # => ["入玉", "相入玉"]
  battle.memberships[0].note_tag_list # => ["入玉", "相入玉"]
  battle.memberships[1].note_tag_list # => ["入玉", "相入玉"]

  tp Battle.last
end
# >> 先手：d5756b4aff6028ca7351f3b400d79532 30級
# >> 後手：c2c9a4f7aea9b2be37e944e2d6ee6f16 30級
# >> 開始日時：2019/03/21 18:57:44
# >> 棋戦：将棋ウォーズ(10分切れ負け)
# >> 持ち時間：10分
# >> 先手の備考：入玉
# >> 後手の備考：入玉
# >> 手合割：平手
# >> 手数----指手---------消費時間--
# >>    1 ５六歩(57)   (10:00/00:10:00)
# >>    2 ５四歩(53)   (10:00/00:10:00)
# >>    3 ５八玉(59)   (00:00/00:10:00)
# >>    4 ５二玉(51)   (00:00/00:10:00)
# >>    5 ５七玉(58)   (00:00/00:10:00)
# >>    6 ５三玉(52)   (00:00/00:10:00)
# >>    7 ４六玉(57)   (00:00/00:10:00)
# >>    8 ６四玉(53)   (00:00/00:10:00)
# >>    9 ４五玉(46)   (00:00/00:10:00)
# >>   10 ６五玉(64)   (00:00/00:10:00)
# >>   11 ４四玉(45)   (00:00/00:10:00)
# >>   12 ６六玉(65)   (00:00/00:10:00)
# >>   13 ５三玉(44)   (00:00/00:10:00)
# >> *▲備考：入玉
# >>   14 ５七玉(66)   (00:00/00:10:00)
# >> *△備考：入玉
# >>   15 投了
# >> まで14手で後手の勝ち
# >> |--------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
# >> |                 id | 98                                                                                                                                                                                                                                                                                                           |
# >> |                key | a2c2f8fac7789e68a43c76d93134f695                                                                                                                                                                                                                                                                             |
# >> |         battled_at | 2019-03-21 18:57:44 +0900                                                                                                                                                                                                                                                                                    |
# >> |           rule_key | ten_min                                                                                                                                                                                                                                                                                                      |
# >> |            csa_seq | [["+5756FU", 0], ["-5354FU", 0], ["+5958OU", 0], ["-5152OU", 0], ["+5857OU", 0], ["-5253OU", 0], ["+5746OU", 0], ["-5364OU", 0], ["+4645OU", 0], ["-6465OU", 0], ["+4544OU", 0], ["-6566OU", 0], ["+4453OU", 0], ["-6657OU", 0]]                                                                             |
# >> |          final_key | TORYO                                                                                                                                                                                                                                                                                                        |
# >> |        win_user_id | 67                                                                                                                                                                                                                                                                                                           |
# >> |           turn_max | 14                                                                                                                                                                                                                                                                                                           |
# >> |          meta_info | {:header=>{"先手"=>"d5756b4aff6028ca7351f3b400d79532 30級", "後手"=>"c2c9a4f7aea9b2be37e944e2d6ee6f16 30級", "開始日時"=>"2019/03/21 18:57:44", "棋戦"=>"将棋ウォーズ(10分切れ負け)", "持ち時間"=>"00:10+00", "先手の備考"=>"入玉", "後手の備考"=>"入玉"}, :detail_names=>[[], []], :simple_names=>[[["d5... |
# >> |    last_accessd_at | 2019-03-21 18:57:44 +0900                                                                                                                                                                                                                                                                                    |
# >> |  access_logs_count | 0                                                                                                                                                                                                                                                                                                            |
# >> |         created_at | 2019-03-21 18:57:45 +0900                                                                                                                                                                                                                                                                                    |
# >> |         updated_at | 2019-03-21 18:57:45 +0900                                                                                                                                                                                                                                                                                    |
# >> |         preset_key | 平手                                                                                                                                                                                                                                                                                                         |
# >> |   defense_tag_list |                                                                                                                                                                                                                                                                                                              |
# >> |    attack_tag_list |                                                                                                                                                                                                                                                                                                              |
# >> | technique_tag_list |                                                                                                                                                                                                                                                                                                              |
# >> |      note_tag_list |                                                                                                                                                                                                                                                                                                              |
# >> |     other_tag_list |                                                                                                                                                                                                                                                                                                              |
# >> |    secret_tag_list |                                                                                                                                                                                                                                                                                                              |
# >> |--------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
