#!/usr/bin/env ruby
require File.expand_path('../../config/environment', __FILE__)

# KifuExtractor.extract("http://example.com/#68S")  # => "68S"
# KifuExtractor.extract("http://example.com/#76%E6%AD%A9") # => "76歩"
# KifuExtractor.extract("http://example.com/?body=76%E6%AD%A9") # => "76歩"
# KifuExtractor.extract("https://www.shogi-extend.com/share-board?body=position.sfen.4k4%2F9%2F4p4%2F9%2F9%2F9%2F4P4%2F9%2F4K4.b.P.1.moves.5g5f.5c5d.P%2a5e&turn=3&abstract_viewpoint=black&color_theme_key=is_color_theme_groovy_board_texture1") # => "position sfen 4k4/9/4p4/9/9/9/4P4/9/4K4 b P 1 moves 5g5f 5c5d P*5e"
# KifuExtractor.extract("https://shogidb2.com/games/0e0f7f6518bca14e5b784015963d5f38795c86a7") # => "開始日時：2021-12-18T05:00:00.000Z\n終了日時：2021-12-18T06:48:00.000Z\n棋戦詳細：第15回朝日杯将棋オープン戦二次予選\n棋戦：朝日杯将棋オープン戦\n手合割：平手\n戦型：横歩取り\n後手：飯島栄治 八段\n場所：東京都渋谷区「シャトーアメーバ」\n先手：丸山忠久 九段\n\n２六歩(27) ３四歩(33) ７六歩(77) ８四歩(83) ２五歩(26) ８五歩(84) ７八金(69) ３二金(41) ２四歩(25) 同歩(23) 同飛(28) ８六歩(85) 同歩(87) 同飛(82) ３四飛(24) ３三角(22) ５八玉(59) ８二飛(86) ３六歩(37) ２六歩打 ２八歩打 ２二銀(31) ３七桂(29) ４二玉(51) ８七歩打 ６二銀(71) ３八銀(39) ５一金(61) ３五飛(34) ２七歩成(26) 同歩(28) ７四歩(73) ９六歩(97) ６四歩(63) ７七桂(89) ７三桂(81) ７五歩(76) ８四飛(82) ８六歩(87) ２三銀(22) ４五桂(37) ４四角(33) ８五歩(86) 同桂(73) 同桂(77) ８八角成(44) 同銀(79) ３四歩打 ２五飛(35) ２四歩打 ５三桂成(45) 同銀(62) ５五飛(25) ８五飛(84) ７三角打 ５二金(51) ９一角成(73) ５四桂打 ４五桂打 ２八角打 ５六飛(55) ７五飛(85) ５三桂成(45) 同金(52) ７七香打 ５五飛(75) ７三馬(91) ３三玉(42) ６二馬(73) ４四金(53) ５一馬(62) ２二玉(33) ４一馬(51) ５六飛(55) 同歩(57) ６六桂打 同歩(67) 同桂(54) ４八玉(58) ７八桂成(66) １五桂打 ６八飛打 ５八金(49) 同飛成(68) 同玉(48) ６八金打 投了\n"
# KifuExtractor.extract("https://shogidb2.com/board?sfen=lnsgkgsnl%2F1r5b1%2Fppppppppp%2F9%2F9%2F2P6%2FPP1PPPPPP%2F1B5R1%2FLNSGKGSNL%20w%20-%202&moves=-3334FU%2B2726FU-8384FU%2B2625FU-8485FU%2B5958OU-4132KI%2B6978KI-8586FU%2B8786FU-8286HI%2B2524FU-2324FU%2B2824HI-8684HI%2B0087FU-0023FU%2B2428HI-2233KA%2B5868OU-7172GI%2B9796FU-3142GI%2B8833UM") # => "position sfen lnsgkgsnl/1r5b1/ppppppppp/9/9/2P6/PP1PPPPPP/1B5R1/LNSGKGSNL w - 2"
# KifuExtractor.extract("https://www.shogi-extend.com/swars/battles/Kato_Hifumi-SiroChannel-20200927_180900/?viewpoint=white&turn=9") == "N+Kato_Hifumi 三段\nN-SiroChannel 四段\n$START_TIME:2020/09/27 18:09:00\n$EVENT:将棋ウォーズ(10分切れ負け)\n$TIME_LIMIT:00:10+00\n+\n+5756FU\nT0\n-8384FU\nT1\n+7776FU\nT2\n-8485FU\nT1\n+8877KA\nT1\n-6152KI\nT1\n+2858HI\nT2\n-7162GI\nT9\n+7968GI\nT1\n-5142OU\nT0\n+6857GI\nT1\n-4232OU\nT2\n+5948OU\nT1\n-1314FU\nT7\n+1716FU\nT1\n-6364FU\nT1\n+5655FU\nT1\n-6263GI\nT3\n+5756GI\nT1\n-3142GI\nT1\n+4838OU\nT1\n-4344FU\nT2\n+3828OU\nT1\n-4243GI\nT1\n+3938GI\nT2\n-7374FU\nT0\n+9796FU\nT2\n-9394FU\nT2\n+9997KY\nT1\n-3334FU\nT7\n+4746FU\nT2\n-2233KA\nT5\n+5898HI\nT2\n-8586FU\nT7\n+8786FU\nT2\n-8284HI\nT2\n+..." }

# KifuExtractor.extract("https://lishogi.org/ZY2Tyy2dUdLl")   # => "開始日時：2021/12/06 04:37:40\n終了日時：2021/12/21 04:11:52\n棋戦：Rated Correspondence game\n場所：https://lishogi.org/ZY2Tyy2d\n手合割：平手\n先手：dopamine57\n後手：Megeton\n手数----指手---------消費時間--\n   1   ２六歩(27)\n   2   ３四歩(33)\n   3   ２五歩(26)\n   4   ３三角(22)\n   5   ７六歩(77)\n   6   ３二銀(31)\n   7   ３三角成(88)\n   8   同　銀(32)\n   9   ８八銀(79)\n  10   ３二金(41)\n  11   ７七銀(88)\n  12   ６二銀(71)\n  13   ７八金(69)\n  14   ６四歩(63)\n  15   ３八銀(39)\n  16   ６三銀(62)\n  17   ６八玉(59)\n  18   ８四歩(83)\n  19   ２七銀(38)\n  20   ５二金(61)\n  21   ２六銀(27)\n  22   ７四歩(73)\n  23   １五銀(26)\n  24   ５四角打\n  25   ３六角打\n  26   同　角(54)\n  27   同　歩(37)\n  28   ５五角打\n  29   ３七角打\n  30   同　角成(55)\n  31   同　桂(29)\n  32   ５五角打\n  33   ３八金(49)\n  34   ２二銀(33)\n  35   ５六歩(57)\n  36   ４四角(55)\n  37   ４六歩(47)\n  38   ７三桂(81)\n  39   ６六歩(67)\n  40   ５四歩(53)\n  41   ４五歩(46)\n  42   ５三角(44)\n  43   ４七金(38)\n  44   ８一飛(82)\n  45   ４六角打\n  46   ６二玉(51)\n  47   １六歩(17)\n  48   １四歩(13)\n  49   ２六銀(15)\n  50   ３三銀(22)\n  51   ３五歩(36)\n  52   同　歩(34)\n  53   同　銀(26)\n  54   ２二銀(33)\n  55   ２四歩(25)\n  56   同　歩(23)\n  57   同　銀(35)\n  58   ２三歩打\n  59   ３五銀(24)\n  60   ３三銀(22)\n  61   ２四歩打\n  62   同　歩(23)\n  63   同　銀(35)\n  64   ２七歩打\n  65   ５八飛(28)\n  66   ３六歩打\n  67   ２五桂(37)\n  68   ２四銀(33)\n  69   同　角(46)\n  70   ４二金(32)\n  71   ３四歩打\n  72   ３五銀打\n  73   ４二角成(24)\n  74   同　金(52)\n  75   ７五歩(76)\n  76   同　歩(74)\n  77   ５五歩(56)\n  78   同　歩(54)\n  79   ３三歩成(34)\n  80   同　桂(21)\n  81   同　桂成(25)\n  82   同　金(42)\n  83   ７四歩打\n  84   ３七歩成(36)\n  85   ７三歩成(74)\n  86   同　玉(62)\n  87   ３七金(47)\n  88   ８五歩(84)\n  89   ５四歩打\n  90   同　銀(63)\n  91   ４七桂打\n  92   ８六歩(85)\n  93   同　歩(87)\n  94   ７六歩(75)\n  95   ７四歩打\n  96   ６二玉(73)\n  97   ７六銀(77)\n  98   ４九角打\n  99   ７三歩成(74)\n 100   ５二玉(62)\n 101   ２二銀打\n 102   ３二金(33)\n 103   ３三金打\n 104   ２二金(32)\n 105   同　金(33)\n 106   ５六桂打\n 107   ６九玉(68)\n 108   ５八角成(49)"
# KifuExtractor.extract("https://lishogi.org/ZY2Tyy2d/sente") # => "開始日時：2021/12/06 04:37:40\n終了日時：2021/12/21 04:11:52\n棋戦：Rated Correspondence game\n場所：https://lishogi.org/ZY2Tyy2d\n手合割：平手\n先手：dopamine57\n後手：Megeton\n手数----指手---------消費時間--\n   1   ２六歩(27)\n   2   ３四歩(33)\n   3   ２五歩(26)\n   4   ３三角(22)\n   5   ７六歩(77)\n   6   ３二銀(31)\n   7   ３三角成(88)\n   8   同　銀(32)\n   9   ８八銀(79)\n  10   ３二金(41)\n  11   ７七銀(88)\n  12   ６二銀(71)\n  13   ７八金(69)\n  14   ６四歩(63)\n  15   ３八銀(39)\n  16   ６三銀(62)\n  17   ６八玉(59)\n  18   ８四歩(83)\n  19   ２七銀(38)\n  20   ５二金(61)\n  21   ２六銀(27)\n  22   ７四歩(73)\n  23   １五銀(26)\n  24   ５四角打\n  25   ３六角打\n  26   同　角(54)\n  27   同　歩(37)\n  28   ５五角打\n  29   ３七角打\n  30   同　角成(55)\n  31   同　桂(29)\n  32   ５五角打\n  33   ３八金(49)\n  34   ２二銀(33)\n  35   ５六歩(57)\n  36   ４四角(55)\n  37   ４六歩(47)\n  38   ７三桂(81)\n  39   ６六歩(67)\n  40   ５四歩(53)\n  41   ４五歩(46)\n  42   ５三角(44)\n  43   ４七金(38)\n  44   ８一飛(82)\n  45   ４六角打\n  46   ６二玉(51)\n  47   １六歩(17)\n  48   １四歩(13)\n  49   ２六銀(15)\n  50   ３三銀(22)\n  51   ３五歩(36)\n  52   同　歩(34)\n  53   同　銀(26)\n  54   ２二銀(33)\n  55   ２四歩(25)\n  56   同　歩(23)\n  57   同　銀(35)\n  58   ２三歩打\n  59   ３五銀(24)\n  60   ３三銀(22)\n  61   ２四歩打\n  62   同　歩(23)\n  63   同　銀(35)\n  64   ２七歩打\n  65   ５八飛(28)\n  66   ３六歩打\n  67   ２五桂(37)\n  68   ２四銀(33)\n  69   同　角(46)\n  70   ４二金(32)\n  71   ３四歩打\n  72   ３五銀打\n  73   ４二角成(24)\n  74   同　金(52)\n  75   ７五歩(76)\n  76   同　歩(74)\n  77   ５五歩(56)\n  78   同　歩(54)\n  79   ３三歩成(34)\n  80   同　桂(21)\n  81   同　桂成(25)\n  82   同　金(42)\n  83   ７四歩打\n  84   ３七歩成(36)\n  85   ７三歩成(74)\n  86   同　玉(62)\n  87   ３七金(47)\n  88   ８五歩(84)\n  89   ５四歩打\n  90   同　銀(63)\n  91   ４七桂打\n  92   ８六歩(85)\n  93   同　歩(87)\n  94   ７六歩(75)\n  95   ７四歩打\n  96   ６二玉(73)\n  97   ７六銀(77)\n  98   ４九角打\n  99   ７三歩成(74)\n 100   ５二玉(62)\n 101   ２二銀打\n 102   ３二金(33)\n 103   ３三金打\n 104   ２二金(32)\n 105   同　金(33)\n 106   ５六桂打\n 107   ６九玉(68)\n 108   ５八角成(49)"
# KifuExtractor.extract("https://lishogi.org/ZY2Tyy2d/gote")  # => "開始日時：2021/12/06 04:37:40\n終了日時：2021/12/21 04:11:52\n棋戦：Rated Correspondence game\n場所：https://lishogi.org/ZY2Tyy2d\n手合割：平手\n先手：dopamine57\n後手：Megeton\n手数----指手---------消費時間--\n   1   ２六歩(27)\n   2   ３四歩(33)\n   3   ２五歩(26)\n   4   ３三角(22)\n   5   ７六歩(77)\n   6   ３二銀(31)\n   7   ３三角成(88)\n   8   同　銀(32)\n   9   ８八銀(79)\n  10   ３二金(41)\n  11   ７七銀(88)\n  12   ６二銀(71)\n  13   ７八金(69)\n  14   ６四歩(63)\n  15   ３八銀(39)\n  16   ６三銀(62)\n  17   ６八玉(59)\n  18   ８四歩(83)\n  19   ２七銀(38)\n  20   ５二金(61)\n  21   ２六銀(27)\n  22   ７四歩(73)\n  23   １五銀(26)\n  24   ５四角打\n  25   ３六角打\n  26   同　角(54)\n  27   同　歩(37)\n  28   ５五角打\n  29   ３七角打\n  30   同　角成(55)\n  31   同　桂(29)\n  32   ５五角打\n  33   ３八金(49)\n  34   ２二銀(33)\n  35   ５六歩(57)\n  36   ４四角(55)\n  37   ４六歩(47)\n  38   ７三桂(81)\n  39   ６六歩(67)\n  40   ５四歩(53)\n  41   ４五歩(46)\n  42   ５三角(44)\n  43   ４七金(38)\n  44   ８一飛(82)\n  45   ４六角打\n  46   ６二玉(51)\n  47   １六歩(17)\n  48   １四歩(13)\n  49   ２六銀(15)\n  50   ３三銀(22)\n  51   ３五歩(36)\n  52   同　歩(34)\n  53   同　銀(26)\n  54   ２二銀(33)\n  55   ２四歩(25)\n  56   同　歩(23)\n  57   同　銀(35)\n  58   ２三歩打\n  59   ３五銀(24)\n  60   ３三銀(22)\n  61   ２四歩打\n  62   同　歩(23)\n  63   同　銀(35)\n  64   ２七歩打\n  65   ５八飛(28)\n  66   ３六歩打\n  67   ２五桂(37)\n  68   ２四銀(33)\n  69   同　角(46)\n  70   ４二金(32)\n  71   ３四歩打\n  72   ３五銀打\n  73   ４二角成(24)\n  74   同　金(52)\n  75   ７五歩(76)\n  76   同　歩(74)\n  77   ５五歩(56)\n  78   同　歩(54)\n  79   ３三歩成(34)\n  80   同　桂(21)\n  81   同　桂成(25)\n  82   同　金(42)\n  83   ７四歩打\n  84   ３七歩成(36)\n  85   ７三歩成(74)\n  86   同　玉(62)\n  87   ３七金(47)\n  88   ８五歩(84)\n  89   ５四歩打\n  90   同　銀(63)\n  91   ４七桂打\n  92   ８六歩(85)\n  93   同　歩(87)\n  94   ７六歩(75)\n  95   ７四歩打\n  96   ６二玉(73)\n  97   ７六銀(77)\n  98   ４九角打\n  99   ７三歩成(74)\n 100   ５二玉(62)\n 101   ２二銀打\n 102   ３二金(33)\n 103   ３三金打\n 104   ２二金(32)\n 105   同　金(33)\n 106   ５六桂打\n 107   ６九玉(68)\n 108   ５八角成(49)"
# KifuExtractor.extract("https://lishogi.org/ZY2Tyy2d")       # => "開始日時：2021/12/06 04:37:40\n終了日時：2021/12/21 04:11:52\n棋戦：Rated Correspondence game\n場所：https://lishogi.org/ZY2Tyy2d\n手合割：平手\n先手：dopamine57\n後手：Megeton\n手数----指手---------消費時間--\n   1   ２六歩(27)\n   2   ３四歩(33)\n   3   ２五歩(26)\n   4   ３三角(22)\n   5   ７六歩(77)\n   6   ３二銀(31)\n   7   ３三角成(88)\n   8   同　銀(32)\n   9   ８八銀(79)\n  10   ３二金(41)\n  11   ７七銀(88)\n  12   ６二銀(71)\n  13   ７八金(69)\n  14   ６四歩(63)\n  15   ３八銀(39)\n  16   ６三銀(62)\n  17   ６八玉(59)\n  18   ８四歩(83)\n  19   ２七銀(38)\n  20   ５二金(61)\n  21   ２六銀(27)\n  22   ７四歩(73)\n  23   １五銀(26)\n  24   ５四角打\n  25   ３六角打\n  26   同　角(54)\n  27   同　歩(37)\n  28   ５五角打\n  29   ３七角打\n  30   同　角成(55)\n  31   同　桂(29)\n  32   ５五角打\n  33   ３八金(49)\n  34   ２二銀(33)\n  35   ５六歩(57)\n  36   ４四角(55)\n  37   ４六歩(47)\n  38   ７三桂(81)\n  39   ６六歩(67)\n  40   ５四歩(53)\n  41   ４五歩(46)\n  42   ５三角(44)\n  43   ４七金(38)\n  44   ８一飛(82)\n  45   ４六角打\n  46   ６二玉(51)\n  47   １六歩(17)\n  48   １四歩(13)\n  49   ２六銀(15)\n  50   ３三銀(22)\n  51   ３五歩(36)\n  52   同　歩(34)\n  53   同　銀(26)\n  54   ２二銀(33)\n  55   ２四歩(25)\n  56   同　歩(23)\n  57   同　銀(35)\n  58   ２三歩打\n  59   ３五銀(24)\n  60   ３三銀(22)\n  61   ２四歩打\n  62   同　歩(23)\n  63   同　銀(35)\n  64   ２七歩打\n  65   ５八飛(28)\n  66   ３六歩打\n  67   ２五桂(37)\n  68   ２四銀(33)\n  69   同　角(46)\n  70   ４二金(32)\n  71   ３四歩打\n  72   ３五銀打\n  73   ４二角成(24)\n  74   同　金(52)\n  75   ７五歩(76)\n  76   同　歩(74)\n  77   ５五歩(56)\n  78   同　歩(54)\n  79   ３三歩成(34)\n  80   同　桂(21)\n  81   同　桂成(25)\n  82   同　金(42)\n  83   ７四歩打\n  84   ３七歩成(36)\n  85   ７三歩成(74)\n  86   同　玉(62)\n  87   ３七金(47)\n  88   ８五歩(84)\n  89   ５四歩打\n  90   同　銀(63)\n  91   ４七桂打\n  92   ８六歩(85)\n  93   同　歩(87)\n  94   ７六歩(75)\n  95   ７四歩打\n  96   ６二玉(73)\n  97   ７六銀(77)\n  98   ４九角打\n  99   ７三歩成(74)\n 100   ５二玉(62)\n 101   ２二銀打\n 102   ３二金(33)\n 103   ３三金打\n 104   ２二金(32)\n 105   同　金(33)\n 106   ５六桂打\n 107   ６九玉(68)\n 108   ５八角成(49)"
# KifuExtractor.extract("76歩")   # => nil

# KifuExtractor.extract("https://lishogi.org/")
# puts FreeBattle.adapter_post(input_text: "https://lishogi.org/")

# puts KifuExtractor.extract("https://lishogi.org/ZY2Tyy2d/sente")
# puts KifuExtractor.extract("https://lishogi.org/ZY2Tyy2dUdLl")
puts KifuExtractor.extract("https://lishogi.org/wbvpq4cR")

# puts KifuExtractor.extract("https://lishogi.org/151jxej8juO1")
# puts KifuExtractor.extract("https://lishogi.org/151jxej8")
# puts WebAgent.raw_fetch("https://lishogi.org/game/export/151jxej8juO1?csa=1&clocks=0")
# puts WebAgent.raw_fetch("https://lishogi.org/game/export/151jxej8juO1?csa=1&clocks=0")

# >> 開始日時：2021/12/17 09:45:44
# >> 終了日時：2021/12/17 09:49:44
# >> 棋戦：Rated Minishogi game
# >> 場所：https://lishogi.org/wbvpq4cR
# >> 持ち時間：10分+10秒
# >> 手合割：五々将棋
# >> 先手：Megeton
# >> 後手：qinoa-ninngenn
# >> 手数----指手---------消費時間--
# >>    1   ４四銀(35)
# >>    2   ４二銀(31)
# >>    3   ４三銀(44)
# >>    4   同　銀(42)
# >>    5   同　角(25)
# >>    6   ２四銀打
# >>    7   １四飛(15)
# >>    8   同　角(41)
# >>    9   ４二銀打
# >>   10   ３一飛(51)
# >>   11   同　銀成(42)
# >>   12   同　金(21)
# >>   13   ３四飛打
# >>   14   ３三銀打
# >>   15   ２四飛(34)
# >>   16   同　銀(33)
# >>   17   ５二角(43)
# >>   18   ２二飛打
# >>   19   ３四角(52)
# >>   20   ３三銀(24)
# >>   21   ４三角(34)
# >>   22   ２三角(14)
# >>   23   ３四銀打
# >>   24   同　銀(33)
# >>   25   同　角(43)
# >>   26   同　角(23)
# >>   27   同　金(45)
# >>   28   ２五飛成(22)
# >>   29   ３五銀打
# >>   30   ３三銀打
# >>   31   同　金(34)
# >>   32   ３五龍(25)
# >>   33   ４五銀打
# >>   34   ４四銀打
# >>   35   詰み
