require "./setup"
tp Swars::User["BOUYATETSU5"].stat.badge_stat.time_stats
# _ { Swars::User["BOUYATETSU5"].stat.badge_stat.as_json } # => "64.36 ms"
# s { Swars::User["BOUYATETSU5"].stat.badge_stat.as_json } # => [{"message"=>"居飛車党", "method"=>"raw", "name"=>"⬆️", "type"=>nil}, {"message"=>"右玉で勝った", "method"=>"raw", "name"=>"➡", "type"=>nil}, {"message"=>"UFO銀で勝った", "method"=>"raw", "name"=>"🛸", "type"=>nil}, {"message"=>"大駒全部捨てて勝った", "method"=>"raw", "name"=>"🧠", "type"=>nil}, {"message"=>"10連勝した", "method"=>"raw", "name"=>"💮", "type"=>nil}, {"message"=>"居玉で勝った", "method"=>"raw", "name"=>"🗿", "type"=>nil}, {"message"=>"開幕千日手をした", "method"=>"raw", "name"=>"❓", "type"=>nil}, {"message"=>"千日手をした", "method"=>"raw", "name"=>"🍌", "type"=>nil}]

# >> |--------------------+--------+------+----------|
# >> | バッジ名           | 時間   | 結果 | 絵       |
# >> |--------------------+--------+------+----------|
# >> | 長考マン           | 101.60 |      | 🤯       |
# >> | 廃指しマン         |  26.30 |      | 😡       |
# >> | レア戦法マン       |  15.22 |      | 🍀       |
# >> | 1手詰じらしマン    |   8.31 |      | 😈       |
# >> | 切断マン           |   6.87 |      | 💩       |
# >> | 筋違い角マン       |   4.50 | ○   | 👨🏻     |
# >> | プロ越えマン       |   3.63 |      | 💪       |
# >> | 絶対投了しないマン |   3.59 |      | 🪳       |
# >> | 無気力マン         |   2.30 |      | 🦥       |
# >> | 200手越えマン      |   2.29 |      | ⚡️     |
# >> | 相手退席待ちマン   |   2.24 |      | 🪰       |
# >> | 10連敗             |   2.10 |      | ⛈       |
# >> | 投了マン           |   2.07 |      | 🙇‍♂️ |
# >> | 運営支えマン       |   1.98 |      | 🧙‍♂️ |
# >> | 心強すぎマン       |   1.80 |      | 🫀       |
# >> | 開幕千日手         |   1.65 |      | ❓       |
# >> | 切れ負けマン       |   1.08 |      | ⌛       |
# >> | 大長考マン         |   0.90 |      | 😴       |
# >> | 急戦マン           |   0.28 |      | 🐝       |
# >> | 耀龍マン           |   0.03 |      | 🐉       |
# >> | チョコレートマン   |   0.01 |      | 🍫       |
# >> | 友対勝ち越しマン       |   0.01 |      | 🆚       |
# >> | ポンポンマン       |   0.01 |      | 🦗       |
# >> | 駒柱マン           |   0.01 |      | 🗽       |
# >> | レグスペマン       |   0.01 |      | 🐔       |
# >> | 四間飛車マン       |   0.01 | ○   | 4⃣      |
# >> | UFOマン            |   0.01 |      | 🛸       |
# >> | 幽霊角マン         |   0.01 |      | 👻       |
# >> | 無敵囲いマン       |   0.01 |      | 🔰       |
# >> | 音無しマン         |   0.01 |      | 🦉       |
# >> | 入玉勝ちマン       |   0.01 |      | 🏈       |
# >> | 都詰めマン         |   0.01 |      | 🏯       |
# >> | 一間飛車マン       |   0.01 | ○   | 1️⃣    |
# >> | 居飛車党           |   0.01 |      | ⬆️     |
# >> | カメレオンマン     |   0.00 |      | 🦎       |
# >> | 飛車不成マン       |   0.00 |      | 💀       |
# >> | 振り飛車党         |   0.00 |      | ⬅️     |
# >> | カニ執着マン       |   0.00 |      | 🦀       |
# >> | 遠見の角マン       |   0.00 |      | 🔭       |
# >> | ダイヤマン         |   0.00 |      | 💎       |
# >> | オールラウンダー   |   0.00 | ○   | 🅰       |
# >> | 九間飛車マン       |   0.00 |      | 9⃣      |
# >> | 右四間飛車マン     |   0.00 | ○   | ⚔       |
# >> | 嬉野マン           |   0.00 |      | ↗️     |
# >> | 角不成マン         |   0.00 |      | ☠       |
# >> | 極限早繰りマン     |   0.00 |      | 🏃🏻     |
# >> | 穴熊マン           |   0.00 | ○   | 🐻       |
# >> | 三間飛車マン       |   0.00 | ○   | 3⃣      |
# >> | ただの千日手       |   0.00 |      | 🍌       |
# >> | 10連勝             |   0.00 | ○   | 💮       |
# >> | 波が激しいマン     |   0.00 |      | 🌊       |
# >> | 袖飛車マン         |   0.00 | ○   | 👘       |
# >> | アヒルマン         |   0.00 | ○   | 🐥       |
# >> | パンツマン         |   0.00 |      | 🩲       |
# >> | スイーツマン       |   0.00 |      | 🍓       |
# >> | 指導受けマン       |   0.00 |      | 🔥       |
# >> | 背水マン           |   0.00 | ○   | 🧠       |
# >> | 小部屋マン         |   0.00 |      | 🛖       |
# >> | ロケットマン       |   0.00 | ○   | 🚀       |
# >> | 中飛車マン         |   0.00 | ○   | 🀄       |
# >> | 屋敷マン           |   0.00 |      | 🥷       |
# >> | エルモマン         |   0.00 | ○   | 🐒       |
# >> | 鬼殺しマン         |   0.00 | ○   | 👹       |
# >> | 右玉マン           |   0.00 | ○   | ➡       |
# >> | 稲庭マン           |   0.00 |      | 👾       |
# >> | パックマン野郎     |   0.00 |      | 🅿       |
# >> | 居玉勝ちマン       |   0.00 | ○   | 🗿       |
# >> | 坊主マン           |   0.00 |      | 👴🏻     |
# >> |--------------------+--------+------+----------|
