require "./setup"
tp Swars::User["BOUYATETSU5"].stat.badge_stat.time_stats
tp Swars::User["anpirika"].stat.badge_stat.time_stats
# _ { Swars::User["BOUYATETSU5"].stat.badge_stat.as_json } # => "64.36 ms"
# s { Swars::User["BOUYATETSU5"].stat.badge_stat.as_json } # => [{"message"=>"居飛車党", "method"=>"raw", "name"=>"⬆️", "type"=>nil}, {"message"=>"右玉で勝った", "method"=>"raw", "name"=>"➡", "type"=>nil}, {"message"=>"UFO銀で勝った", "method"=>"raw", "name"=>"🛸", "type"=>nil}, {"message"=>"大駒全部捨てて勝った", "method"=>"raw", "name"=>"🧠", "type"=>nil}, {"message"=>"10連勝した", "method"=>"raw", "name"=>"💮", "type"=>nil}, {"message"=>"居玉で勝った", "method"=>"raw", "name"=>"🗿", "type"=>nil}, {"message"=>"開幕千日手をした", "method"=>"raw", "name"=>"❓", "type"=>nil}, {"message"=>"千日手をした", "method"=>"raw", "name"=>"🍌", "type"=>nil}]

# >> |--------------------+-------+------+----------|
# >> | バッジ名           | 時間  | 結果 | 絵       |
# >> |--------------------+-------+------+----------|
# >> | 屋敷マン           | 87.43 |      | 🥷       |
# >> | 廃指しマン         | 27.38 |      | 😡       |
# >> | レア戦法マン       | 19.81 |      | 🍀       |
# >> | 示範マン           | 17.65 |      | 🏆       |
# >> | 絶対投了しないマン |  7.09 |      | 🪳       |
# >> | 指導受けマン       |  3.76 |      | 👨‍🎓   |
# >> | 200手越えマン      |  3.70 |      | ⚡️     |
# >> | 長考マン           |  3.40 |      | 🤯       |
# >> | 無気力マン         |  3.35 |      | 🦥       |
# >> | 相手退席待ちマン   |  3.33 |      | 🪰       |
# >> | 友対無双マン       |  2.78 |      | 💔       |
# >> | 運営支えマン       |  2.70 |      | 🧙‍♂️ |
# >> | 投了マン           |  2.39 |      | 🙇‍♂️ |
# >> | ただの千日手       |  2.19 |      | 🍌       |
# >> | 波が激しいマン     |  1.55 |      | 🌊       |
# >> | 大長考マン         |  1.16 |      | 😴       |
# >> | 小部屋マン         |  0.58 |      | 🛖       |
# >> | 急戦マン           |  0.33 |      | 🐝       |
# >> | プロ越えマン       |  0.28 |      | 🦁       |
# >> | 心強すぎマン       |  0.02 |      | 🫀       |
# >> | 友対GGマン         |  0.01 |      | ❤️     |
# >> | 三間飛車マン       |  0.01 | ○   | 3⃣      |
# >> | 坊主マン           |  0.01 |      | 👴🏻     |
# >> | 詰まされマン       |  0.01 |      | Ⓜ️     |
# >> | 居飛車党           |  0.01 |      | ⬆️     |
# >> | 右玉マン           |  0.01 | ○   | ➡       |
# >> | 穴熊マン           |  0.01 | ○   | 🐻       |
# >> | 10連勝             |  0.01 | ○   | 🔥       |
# >> | 稲庭マン           |  0.01 |      | 👾       |
# >> | ブッチマン         |  0.01 | ○   | 🧠       |
# >> | 鬼殺しマン         |  0.01 | ○   | 👹       |
# >> | 都詰めマン         |  0.01 |      | 🏯       |
# >> | 切れ負けマン       |  0.01 |      | ⌛       |
# >> | オールラウンダー   |  0.01 | ○   | 🅰       |
# >> | カニ執着マン       |  0.01 |      | 🦀       |
# >> | 極限早繰りマン     |  0.01 |      | 🏃🏻     |
# >> | 幽霊角マン         |  0.01 |      | 👻       |
# >> | 嬉野マン           |  0.01 |      | ↗️     |
# >> | 筋違い角マン       |  0.01 | ○   | 👨🏻     |
# >> | 一間飛車マン       |  0.01 | ○   | 1️⃣    |
# >> | 右四間飛車マン     |  0.01 | ○   | 🪓       |
# >> | レグスペマン       |  0.01 |      | 🐔       |
# >> | 切断マン           |  0.01 |      | 💩       |
# >> | 耀龍マン           |  0.01 |      | 🐉       |
# >> | ポンポンマン       |  0.01 |      | 🦗       |
# >> | パックマン野郎     |  0.00 |      | 🅿       |
# >> | 四間飛車マン       |  0.00 | ○   | 4⃣      |
# >> | 駒柱マン           |  0.00 |      | 🗽       |
# >> | 入玉勝ちマン       |  0.00 |      | 🏈       |
# >> | アヒルマン         |  0.00 | ○   | 🐥       |
# >> | 飛車不成マン       |  0.00 |      | 💀       |
# >> | 音無しマン         |  0.00 |      | 🦉       |
# >> | 10連敗             |  0.00 |      | ⛈       |
# >> | 金底マン           |  0.00 |      | 🪨       |
# >> | UFOマン            |  0.00 |      | 🛸       |
# >> | 袖飛車マン         |  0.00 | ○   | 👘       |
# >> | 九間飛車マン       |  0.00 |      | 9⃣      |
# >> | ダイヤマン         |  0.00 |      | 💎       |
# >> | 角不成マン         |  0.00 |      | ☠       |
# >> | 遠見の角マン       |  0.00 |      | 🔭       |
# >> | 1手詰じらしマン    |  0.00 |      | 😈       |
# >> | カメレオンマン     |  0.00 |      | 🦎       |
# >> | 居玉勝ちマン       |  0.00 | ○   | 🗿       |
# >> | 振り飛車党         |  0.00 |      | ⬅️     |
# >> | ロケットマン       |  0.00 | ○   | 🚀       |
# >> | エルモマン         |  0.00 | ○   | 🐒       |
# >> | パンツマン         |  0.00 |      | 🩲       |
# >> | チョコレートマン   |  0.00 |      | 🍫       |
# >> | 中飛車マン         |  0.00 | ○   | 🀄       |
# >> | 無敵囲いマン       |  0.00 |      | 🔰       |
# >> | スイーツマン       |  0.00 |      | 🍓       |
# >> |--------------------+-------+------+----------|
# >> |--------------------+-------+------+----------|
# >> | バッジ名           | 時間  | 結果 | 絵       |
# >> |--------------------+-------+------+----------|
# >> | レア戦法マン       | 11.02 |      | 🍀       |
# >> | 示範マン           | 10.01 | ○   | 🏆       |
# >> | 廃指しマン         |  4.32 |      | 😡       |
# >> | 四間飛車マン       |  3.62 |      | 4⃣      |
# >> | 無気力マン         |  2.99 |      | 🦥       |
# >> | 10連敗             |  2.85 |      | ⛈       |
# >> | 友対GGマン         |  1.67 |      | ❤️     |
# >> | 200手越えマン      |  1.49 |      | ⚡️     |
# >> | 投了マン           |  1.44 |      | 🙇‍♂️ |
# >> | 長考マン           |  1.16 |      | 🤯       |
# >> | 心強すぎマン       |  1.15 | ○   | 🫀       |
# >> | 指導受けマン       |  1.07 |      | 👨‍🎓   |
# >> | 急戦マン           |  0.02 |      | 🐝       |
# >> | オールラウンダー   |  0.01 | ○   | 🅰       |
# >> | 友対無双マン       |  0.01 |      | 💔       |
# >> | プロ越えマン       |  0.01 |      | 🦁       |
# >> | 詰まされマン       |  0.01 |      | Ⓜ️     |
# >> | ただの千日手       |  0.01 |      | 🍌       |
# >> | 振り飛車党         |  0.00 |      | ⬅️     |
# >> | アヒルマン         |  0.00 |      | 🐥       |
# >> | 波が激しいマン     |  0.00 |      | 🌊       |
# >> | 袖飛車マン         |  0.00 | ○   | 👘       |
# >> | 居玉勝ちマン       |  0.00 |      | 🗿       |
# >> | 坊主マン           |  0.00 |      | 👴🏻     |
# >> | 金底マン           |  0.00 |      | 🪨       |
# >> | 穴熊マン           |  0.00 | ○   | 🐻       |
# >> | 切れ負けマン       |  0.00 |      | ⌛       |
# >> | チョコレートマン   |  0.00 |      | 🍫       |
# >> | 居飛車党           |  0.00 |      | ⬆️     |
# >> | 切断マン           |  0.00 |      | 💩       |
# >> | 絶対投了しないマン |  0.00 |      | 🪳       |
# >> | 都詰めマン         |  0.00 |      | 🏯       |
# >> | 耀龍マン           |  0.00 |      | 🐉       |
# >> | エルモマン         |  0.00 |      | 🐒       |
# >> | 鬼殺しマン         |  0.00 |      | 👹       |
# >> | 一間飛車マン       |  0.00 |      | 1️⃣    |
# >> | 音無しマン         |  0.00 |      | 🦉       |
# >> | 中飛車マン         |  0.00 |      | 🀄       |
# >> | カニ執着マン       |  0.00 |      | 🦀       |
# >> | 遠見の角マン       |  0.00 |      | 🔭       |
# >> | ブッチマン         |  0.00 |      | 🧠       |
# >> | パックマン野郎     |  0.00 |      | 🅿       |
# >> | カメレオンマン     |  0.00 |      | 🦎       |
# >> | 大長考マン         |  0.00 |      | 😴       |
# >> | 10連勝             |  0.00 |      | 🔥       |
# >> | 無敵囲いマン       |  0.00 |      | 🔰       |
# >> | ダイヤマン         |  0.00 |      | 💎       |
# >> | 幽霊角マン         |  0.00 |      | 👻       |
# >> | パンツマン         |  0.00 |      | 🩲       |
# >> | 稲庭マン           |  0.00 |      | 👾       |
# >> | 右玉マン           |  0.00 |      | ➡       |
# >> | レグスペマン       |  0.00 |      | 🐔       |
# >> | 屋敷マン           |  0.00 |      | 🥷       |
# >> | 三間飛車マン       |  0.00 | ○   | 3⃣      |
# >> | 小部屋マン         |  0.00 |      | 🛖       |
# >> | 嬉野マン           |  0.00 |      | ↗️     |
# >> | 筋違い角マン       |  0.00 |      | 👨🏻     |
# >> | ロケットマン       |  0.00 |      | 🚀       |
# >> | 極限早繰りマン     |  0.00 |      | 🏃🏻     |
# >> | 右四間飛車マン     |  0.00 |      | 🪓       |
# >> | 飛車不成マン       |  0.00 |      | 💀       |
# >> | 駒柱マン           |  0.00 | ○   | 🗽       |
# >> | 角不成マン         |  0.00 |      | ☠       |
# >> | 九間飛車マン       |  0.00 |      | 9⃣      |
# >> | ポンポンマン       |  0.00 |      | 🦗       |
# >> | 入玉勝ちマン       |  0.00 |      | 🏈       |
# >> | スイーツマン       |  0.00 |      | 🍓       |
# >> | 1手詰じらしマン    |  0.00 |      | 😈       |
# >> | 相手退席待ちマン   |  0.00 |      | 🪰       |
# >> | UFOマン            |  0.00 |      | 🛸       |
# >> | 運営支えマン       |  0.00 |      | 🧙‍♂️ |
# >> |--------------------+-------+------+----------|
