require "./setup"
tp Swars::User["BOUYATETSU5"].stat.badge_stat.time_stats
# _ { Swars::User["BOUYATETSU5"].stat.badge_stat.as_json } # => "64.36 ms"
# s { Swars::User["BOUYATETSU5"].stat.badge_stat.as_json } # => [{"message"=>"居飛車党", "method"=>"raw", "name"=>"⬆️", "type"=>nil}, {"message"=>"右玉で勝った", "method"=>"raw", "name"=>"➡", "type"=>nil}, {"message"=>"UFO銀で勝った", "method"=>"raw", "name"=>"🛸", "type"=>nil}, {"message"=>"大駒全部捨てて勝った", "method"=>"raw", "name"=>"🧠", "type"=>nil}, {"message"=>"10連勝した", "method"=>"raw", "name"=>"💮", "type"=>nil}, {"message"=>"居玉で勝った", "method"=>"raw", "name"=>"🗿", "type"=>nil}, {"message"=>"開幕千日手をした", "method"=>"raw", "name"=>"❓", "type"=>nil}, {"message"=>"千日手をした", "method"=>"raw", "name"=>"🍌", "type"=>nil}]

# >> |--------------------+-------+------+----------|
# >> | バッジ名           | 時間  | 結果 | 絵       |
# >> |--------------------+-------+------+----------|
# >> | 開幕千日手         | 80.84 |      | ❓       |
# >> | 廃指しマン         | 25.60 |      | 😡       |
# >> | 右四間飛車マン     | 14.52 | ○   | ⚔       |
# >> | レア戦法マン       | 11.83 |      | 🍀       |
# >> | 切れ負けマン       |  9.20 |      | ⌛       |
# >> | 飛車不成マン       |  6.33 |      | 💀       |
# >> | 指導受けマン       |  4.55 |      | 🔥       |
# >> | 200手越えマン      |  3.63 |      | ⚡️     |
# >> | 1手詰じらしマン    |  3.44 |      | 😈       |
# >> | 相手退席待ちマン   |  3.42 |      | 🪰       |
# >> | 急戦マン           |  3.20 |      | 🐝       |
# >> | 長考マン           |  3.13 |      | 🤯       |
# >> | 絶対投了しないマン |  2.85 |      | 🪳       |
# >> | 無気力マン         |  2.72 |      | 🦥       |
# >> | 投了マン           |  2.62 |      | 🙇‍♂️ |
# >> | 運営支えマン       |  2.40 |      | 🧙‍♂️ |
# >> | 心強すぎマン       |  2.23 |      | 🫀       |
# >> | 10連敗             |  1.61 |      | ⛈       |
# >> | 切断マン           |  1.23 |      | 💩       |
# >> | 大長考マン         |  1.08 |      | 😴       |
# >> | 入玉勝ちマン       |  0.69 |      | 🏈       |
# >> | ただの千日手       |  0.02 |      | 🍌       |
# >> | エルモマン         |  0.01 | ○   | 🐒       |
# >> | 振り飛車党         |  0.01 |      | ⬅️     |
# >> | 10連勝             |  0.01 | ○   | 💮       |
# >> | プロ越えマン       |  0.01 |      | 💪       |
# >> | 四間飛車マン       |  0.01 | ○   | 4⃣      |
# >> | カニ執着マン       |  0.01 |      | 🦀       |
# >> | 駒柱マン           |  0.01 |      | 🗽       |
# >> | 角不成マン         |  0.01 |      | ☠       |
# >> | 遠見の角マン       |  0.01 |      | 🔭       |
# >> | 無敵囲いマン       |  0.01 |      | 🔰       |
# >> | パンツマン         |  0.01 |      | 🩲       |
# >> | パックマン野郎     |  0.01 |      | 🅿       |
# >> | 居飛車党           |  0.01 | ○   | ⬆️     |
# >> | 背水マン           |  0.01 | ○   | 🧠       |
# >> | 波が激しいマン     |  0.01 |      | 🌊       |
# >> | 右玉マン           |  0.01 | ○   | ➡       |
# >> | 筋違い角マン       |  0.01 | ○   | 👨🏻     |
# >> | 鬼殺しマン         |  0.01 | ○   | 👹       |
# >> | オールラウンダー   |  0.01 | ○   | 🅰       |
# >> | 稲庭マン           |  0.01 |      | 👾       |
# >> | 三間飛車マン       |  0.01 | ○   | 3⃣      |
# >> | 中飛車マン         |  0.01 | ○   | 🀄       |
# >> | 音無しマン         |  0.01 |      | 🦉       |
# >> | スイーツマン       |  0.01 |      | 🍓       |
# >> | 小部屋マン         |  0.00 |      | 🛖       |
# >> | 友対勝ちマン       |  0.00 |      | 🆚       |
# >> | 嬉野マン           |  0.00 |      | ↗️     |
# >> | 居玉勝ちマン       |  0.00 | ○   | 🗿       |
# >> | 九間飛車マン       |  0.00 |      | 9⃣      |
# >> | 都詰めマン         |  0.00 |      | 🏯       |
# >> | カメレオンマン     |  0.00 |      | 🦎       |
# >> | 耀龍マン           |  0.00 |      | 🐉       |
# >> | ダイヤマン         |  0.00 |      | 💎       |
# >> | チョコレートマン   |  0.00 |      | 🍫       |
# >> | ポンポンマン       |  0.00 |      | 🦗       |
# >> | 一間飛車マン       |  0.00 | ○   | 1️⃣    |
# >> | 屋敷マン           |  0.00 |      | 🥷       |
# >> | 幽霊角マン         |  0.00 |      | 👻       |
# >> | 穴熊マン           |  0.00 | ○   | 🐻       |
# >> | 袖飛車マン         |  0.00 | ○   | 👘       |
# >> | レグスペマン       |  0.00 |      | 🐔       |
# >> | ロケットマン       |  0.00 | ○   | 🚀       |
# >> | アヒルマン         |  0.00 | ○   | 🐥       |
# >> | 坊主マン           |  0.00 |      | 👴🏻     |
# >> | UFOマン            |  0.00 |      | 🛸       |
# >> | 極限早繰りマン     |  0.00 |      | 🏃🏻     |
# >> |--------------------+-------+------+----------|
