require "./setup"
tp Swars::User["Taichan0601"].stat(sample_max: 100).gentleman_stat.to_a
# tp Swars::User["yomeP"].stat(sample_max: 50).gentleman_stat.to_a
# tp Swars::User["yomeP"].stat(sample_max: 0).gentleman_stat.to_a
# tp Swars::User::Stat::GentlemanStat.report(sample_max: 5)
# >> |----------------+------+---------+-------|
# >> | 項目           | 重み | 回数    | 減点  |
# >> |----------------+------+---------+-------|
# >> | 友達無双       | 20.0 |         |       |
# >> | 切れ負け       |  0.4 |     8.0 |   3.2 |
# >> | 詰み負け       |  0.2 |     3.0 |   0.6 |
# >> | 敗勢諦め       |  0.8 |         |       |
# >> | 無理攻め       |  0.4 |     1.0 |   0.4 |
# >> | 連続王手       |  8.0 |         |       |
# >> | 先手千日手     |  2.0 |     1.0 |   2.0 |
# >> | 舐めプ戦法     |  1.0 |   0.664 |  0.66 |
# >> | 指し手速い     | 10.0 |         |       |
# >> | 指し手遅い     |  5.0 |         |       |
# >> | 無気力         |  3.0 |         |       |
# >> | 棋力調整       |  6.0 |         |       |
# >> | 角不成         |  2.0 |         |       |
# >> | 飛車不成       |  4.0 |         |       |
# >> | 全駒           |  5.0 |         |       |
# >> | 玉単騎         | 10.0 |         |       |
# >> | 1手詰焦らし    | 15.0 |         |       |
# >> | 勝ち焦らし     | 20.0 |         |       |
# >> | 棋神           | 10.0 |         |       |
# >> | 逆棋力詐欺(強) |  0.5 |    28.0 |  14.0 |
# >> | 棋力詐欺(弱)   |  5.0 | 3.54945 | 17.75 |
# >> | 対局放棄長考   |  5.0 |         |       |
# >> | 切断逃亡       | 10.0 |         |       |
# >> | 放置           | 15.0 |         |       |
# >> | 退席待ち狙い   | 20.0 |         |       |
# >> | 悪環境         |  5.0 |         |       |
# >> |----------------+------+---------+-------|
