require "./setup"
tp Swars::User::Stat::OtherInfo["勝敗別平均手数"].bottom_message # => #<Proc:0x000000010c0900a8 /Users/ikeda/src/shogi-extend/app/models/swars/user/stat/other_info.rb:94>
tp Swars::User::Stat::OtherInfo
# >> |------------------------------------------------------------------------------------------------------|
# >> | #<Proc:0x000000010c0900a8 /Users/ikeda/src/shogi-extend/app/models/swars/user/stat/other_info.rb:94> |
# >> |------------------------------------------------------------------------------------------------------|
# >> |--------------------------------------|
# >> | テスト                               |
# >> | ids_count                            |
# >> | 指導対局で勝った                     |
# >> | 切断逃亡                             |
# >> | 投了せずに放置                       |
# >> | 1手詰を焦らして悦に入る              |
# >> | 角不成                               |
# >> | 飛車不成                             |
# >> | 無気力な対局                         |
# >> | 指導対局                             |
# >> | 友達対局                             |
# >> | 棋風                                 |
# >> | 派閥                                 |
# >> | 居飛車                               |
# >> | 振り飛車                             |
# >> | 相居飛車                             |
# >> | 対振り                               |
# >> | 対抗形                               |
# >> | 相振り                               |
# >> | 連勝                                 |
# >> | 連敗                                 |
# >> | 棋風 (速度)                          |
# >> | 急戦                                 |
# >> | 持久戦                               |
# >> | 棋風 (手数)                          |
# >> | 短手数                               |
# >> | 長手数                               |
# >> | 勝敗別平均手数                       |
# >> | 不屈の闘志                           |
# >> | 最長手数                             |
# >> | 平均手数                             |
# >> | 投了時の平均手数                     |
# >> | 投了せずに放置した時間 (最長)        |
# >> | 投了せずに放置した頻度               |
# >> | 勝ち                                 |
# >> | 1手詰を焦らして悦に入った時間 (最長) |
# >> | 1手詰を焦らして悦に入った頻度        |
# >> | 負け                                 |
# >> | 投了までの心の準備                   |
# >> | 投了までの心の準備 (平均)            |
# >> | 投了までの心の準備 (最長)            |
# >> | 最長考                               |
# >> | 平均思考                             |
# >> | 詰ます速度 (1手平均)                 |
# >> | 大駒全ブッチ                         |
# >> | 大駒コンプリート                     |
# >> | 入玉                                 |
# >> | 垂れ歩                               |
# >> | 金底の歩                             |
# >> | 割り打ちの銀                         |
# >> | 腹銀                                 |
# >> | 継ぎ桂                               |
# >> | 駒の使用率                           |
# >> | 対戦相手との段級差 (平均)            |
# >> | ルール別対局頻度                     |
# >> | 対局モード                           |
# >> | 1日の平均対局数                      |
# >> | 1日の最高対局数                      |
# >> | 対局時間帯                           |
# >> | 右玉度                               |
# >> | 右玉ファミリー                       |
# >> | 将棋ウォーズの運営を支える力         |
# >> |--------------------------------------|
