require "./setup"

_ { Swars::User["SugarHuuko"].stat.tag_stat.counts_hash }                      # => "252.89 ms"
Swars::User["SugarHuuko"].stat.tag_stat.win_count_by(:"居飛車")                # => 35
Swars::User["SugarHuuko"].stat.tag_stat.lose_count_by(:"居飛車")               # => 15
Swars::User["SugarHuuko"].stat.tag_stat.draw_count_by(:"居飛車")               # => 0
Swars::User["SugarHuuko"].stat.tag_stat.counts_hash                            # => {:角換わり=>1, :居飛車=>50, :相居飛車=>28, :急戦=>23, :長手数=>27, :垂れ歩=>15, :桂頭の銀=>5, :へこみ矢倉=>1, :大駒全ブッチ=>7, :背水の陣=>2, :腹銀=>2, :▲４五歩早仕掛け=>2, :舟囲い=>11, :対振り=>22, :対抗形=>22, :持久戦=>23, :カブト囲い=>1, :居玉=>4, :相居玉=>3, :へなちょこ急戦=>4, :短手数=>23, :相振り飛車=>1, :力戦=>17, :棒銀=>1, :右四間飛車=>1, :大駒コンプリート=>5, :ふんどしの桂=>4, :原始棒銀=>1, :UFO銀=>3, :新型雁木=>3, :右玉=>3, :横歩取り=>1, :銀雲雀=>2, :ボナンザ囲い=>1, :ツノ銀雁木=>4, :ツノ銀型右玉=>2, :対振り持久戦=>1, :居飛車金美濃=>1, :松尾流穴熊=>1, :角換わり腰掛け銀=>1, :相掛かり棒銀=>1, :箱入り娘=>1, :金盾囲い=>2, :角交換型=>2, :手得角交換型=>2, :地下鉄飛車=>1}
Swars::User["SugarHuuko"].stat.tag_stat.ratios_hash                            # => {:角換わり=>1.0, :居飛車=>0.7, :相居飛車=>0.6785714285714286, :急戦=>0.7391304347826086, :長手数=>0.7407407407407407, :垂れ歩=>0.6666666666666666, :桂頭の銀=>0.6, :へこみ矢倉=>1.0, :大駒全ブッチ=>0.7142857142857143, :背水の陣=>1.0, :腹銀=>1.0, :▲４五歩早仕掛け=>1.0, :舟囲い=>0.6363636363636364, :対振り=>0.7272727272727273, :対抗形=>0.7272727272727273, :持久戦=>0.6521739130434783, :カブト囲い=>1.0, :居玉=>0.75, :相居玉=>1.0, :へなちょこ急戦=>0.75, :短手数=>0.6521739130434783, :相振り飛車=>1.0, :力戦=>0.6470588235294118, :棒銀=>1.0, :右四間飛車=>1.0, :大駒コンプリート=>0.8, :ふんどしの桂=>1.0, :原始棒銀=>1.0, :UFO銀=>1.0, :新型雁木=>0.6666666666666666, :右玉=>0.3333333333333333, :横歩取り=>0.0, :銀雲雀=>0.5, :ボナンザ囲い=>0.0, :ツノ銀雁木=>0.5, :ツノ銀型右玉=>0.5, :対振り持久戦=>1.0, :居飛車金美濃=>1.0, :松尾流穴熊=>1.0, :角換わり腰掛け銀=>1.0, :相掛かり棒銀=>1.0, :箱入り娘=>1.0, :金盾囲い=>0.5, :角交換型=>0.5, :手得角交換型=>1.0, :地下鉄飛車=>1.0}
Swars::User["SugarHuuko"].stat.tag_stat.to_s                                   # => "角換わり,居飛車,相居飛車,急戦,長手数,垂れ歩,桂頭の銀,へこみ矢倉,大駒全ブッチ,背水の陣,腹銀,▲４五歩早仕掛け,舟囲い,対振り,対抗形,持久戦,カブト囲い,居玉,相居玉,へなちょこ急戦,短手数,相振り飛車,力戦,棒銀,右四間飛車,大駒コンプリート,ふんどしの桂,原始棒銀,UFO銀,新型雁木,右玉,横歩取り,銀雲雀,ボナンザ囲い,ツノ銀雁木,ツノ銀型右玉,対振り持久戦,居飛車金美濃,松尾流穴熊,角換わり腰掛け銀,相掛かり棒銀,箱入り娘,金盾囲い,角交換型,手得角交換型,地下鉄飛車"
Swars::User["SugarHuuko"].stat.tag_stat.to_pie_chart([:"居飛車", :"振り飛車"]) # => [{:name=>:居飛車, :value=>50}, {:name=>:振り飛車, :value=>0}]
Swars::User["SugarHuuko"].stat.tag_stat.to_win_lose_chart(:"居飛車")           # => {:judge_counts=>{:win=>35, :lose=>15}}

Swars::User["SugarHuuko"].stat.win_stat.exist?(:"居飛車")                      # => true
Swars::User["SugarHuuko"].stat.win_stat.match?(/角交換/)                       # => true

Swars::User["SugarHuuko"].stat.tag_stat.bad_tactic_count        # => 0

Swars::User["slowstep3210"].stat(sample_max: 100).tag_stat.to_win_lose_h(:"大駒全ブッチ") # => {:win=>2, :lose=>19}
Swars::User["BOUYATETSU5"].stat(sample_max: 100).tag_stat.to_win_lose_h(:"大駒全ブッチ") # => {:win=>7, :lose=>0}

Swars::User["slowstep3210"].stat(sample_max: 100).tag_stat.muriseme_level # => 17
Swars::User["BOUYATETSU5"].stat(sample_max: 100).tag_stat.muriseme_level  # => nil

tp Swars::User::Stat::TagStat.report(sample_max: 2000)
