require "./setup"
Swars::User["SugarHuuko"].stat.win_stat.to_h                 # => {相掛かり: 0.7, 居玉: 0.625, 居飛車: 0.78, 大駒コンプリート: 0.75, 相居飛車: 0.8333333333333334, 相居玉: 0.8, 急戦: 0.75, 長手数: 0.6666666666666666, 桂頭の銀: 0.7777777777777778, 控えの桂: 1.0, 持久戦: 0.8076923076923077, 短手数: 0.8846153846153846, 中住まい: 0.6666666666666666, 手得角交換型: 1.0, 壁銀: 0.7692307692307693, 金頭の桂: 0.75, 肩金: 0.8888888888888888, たたきの歩: 0.75, 腹金: 0.8571428571428571, 力戦: 0.8, 名人に定跡なし: 1.0, 垂れ歩: 0.625, ふんどしの桂: 0.75, 肩銀: 1.0, 舟囲い: 0.8, 対抗形: 0.6428571428571429, 頭銀: 1.0, 新型雁木: 1.0, 尻金: 1.0, ロケット: 1.0, 土下座の歩: 0.8571428571428571, "2段ロケット": 1.0, 右四間飛車: 0.6666666666666666, 歩頭の桂: 1.0, 一間竜: 0.8, 裾銀: 0.6666666666666666, 連打の歩: 0.75, ▲4六銀右急戦: 1.0, へなちょこ急戦: 1.0, 継ぎ歩: 1.0, 右玉: 1.0, ツノ銀雁木: 1.0, 腹銀: 1.0, 角交換型: 0.8, 菊水矢倉: 1.0, 頭金: 1.0, 大駒全ブッチ: 1.0, 幽霊角: 1.0, 対振り持久戦: 1.0, 居飛車銀冠: 1.0, カブト囲い: 1.0, オールド雁木: 1.0, 一手損角換わり: 1.0, 極限早繰り銀: 1.0, いちご囲い: 1.0}
Swars::User["SugarHuuko"].stat.win_stat.to_s                 # => "相掛かり,居玉,居飛車,大駒コンプリート,相居飛車,相居玉,急戦,長手数,桂頭の銀,控えの桂,持久戦,短手数,中住まい,手得角交換型,壁銀,金頭の桂,肩金,たたきの歩,腹金,力戦,名人に定跡なし,垂れ歩,ふんどしの桂,肩銀,舟囲い,対抗形,頭銀,新型雁木,尻金,ロケット,土下座の歩,2段ロケット,右四間飛車,歩頭の桂,一間竜,裾銀,連打の歩,▲4六銀右急戦,へなちょこ急戦,継ぎ歩,右玉,ツノ銀雁木,腹銀,角交換型,菊水矢倉,頭金,大駒全ブッチ,幽霊角,対振り持久戦,居飛車銀冠,カブト囲い,オールド雁木,一手損角換わり,極限早繰り銀,いちご囲い"
Swars::User["SugarHuuko"].stat.win_stat.exist?(:"居飛車")    # => true
Swars::User["SugarHuuko"].stat.win_stat.include?("角換わり") # => true
Swars::User["SugarHuuko"].stat.win_stat.match?(/角交換/)     # => true
Swars::User["SugarHuuko"].stat.win_stat.anaguma_medal?       # => false

# >> |------------------+--------------------|
# >> |         相掛かり | 0.7                |
# >> |         腰掛け銀 | 0.5                |
# >> |             居玉 | 0.625              |
# >> |           居飛車 | 0.78               |
# >> | 大駒コンプリート | 0.75               |
# >> |         相居飛車 | 0.8333333333333334 |
# >> |           相居玉 | 0.8                |
# >> |             急戦 | 0.75               |
# >> |           長手数 | 0.6666666666666666 |
# >> |         桂頭の銀 | 0.7777777777777778 |
# >> |       こびん攻め | 0.4                |
# >> |         控えの桂 | 1.0                |
# >> |           持久戦 | 0.8076923076923077 |
# >> |           短手数 | 0.8846153846153846 |
# >> |         中住まい | 0.6666666666666666 |
# >> |     手得角交換型 | 1.0                |
# >> |             壁銀 | 0.7692307692307693 |
# >> |         金頭の桂 | 0.75               |
# >> |             肩金 | 0.8888888888888888 |
# >> |            UFO銀 | 0.0                |
# >> |       たたきの歩 | 0.75               |
# >> |             腹金 | 0.8571428571428571 |
# >> |             力戦 | 0.8                |
# >> |   名人に定跡なし | 1.0                |
# >> |           垂れ歩 | 0.625              |
# >> |     ふんどしの桂 | 0.75               |
# >> |             肩銀 | 1.0                |
# >> |           舟囲い | 0.8                |
# >> |           対抗形 | 0.6428571428571429 |
# >> |             頭銀 | 1.0                |
# >> |         新型雁木 | 1.0                |
# >> |             尻金 | 1.0                |
# >> |         ロケット | 1.0                |
# >> |       土下座の歩 | 0.8571428571428571 |
# >> |      2段ロケット | 1.0                |
# >> |   新村田システム | 0.5                |
# >> |         下段の香 | 0.5                |
# >> |         遠見の角 | 0.2                |
# >> |       右四間飛車 | 0.6666666666666666 |
# >> |         箱入り娘 | 0.0                |
# >> |     居飛車の税金 | 0.0                |
# >> |           継ぎ桂 | 0.0                |
# >> |         歩頭の桂 | 1.0                |
# >> |     相掛かり棒銀 | 0.0                |
# >> |         角換わり | 0.0                |
# >> |           一間竜 | 0.8                |
# >> |             裾銀 | 0.6666666666666666 |
# >> |     端玉には端歩 | 0.0                |
# >> |         連打の歩 | 0.75               |
# >> |    ▲4六銀右急戦 | 1.0                |
# >> |   へなちょこ急戦 | 1.0                |
# >> |           継ぎ歩 | 1.0                |
# >> |             右玉 | 1.0                |
# >> |       ツノ銀雁木 | 1.0                |
# >> |             腹銀 | 1.0                |
# >> |         角交換型 | 0.8                |
# >> |         菊水矢倉 | 1.0                |
# >> |             頭金 | 1.0                |
# >> |     大駒全ブッチ | 1.0                |
# >> |           幽霊角 | 1.0                |
# >> |     対振り持久戦 | 1.0                |
# >> |       居飛車銀冠 | 1.0                |
# >> |             入玉 | 0.0                |
# >> |         位の確保 | 0.0                |
# >> |       カブト囲い | 1.0                |
# >> |     オールド雁木 | 1.0                |
# >> |   一手損角換わり | 1.0                |
# >> |     極限早繰り銀 | 1.0                |
# >> |       いちご囲い | 1.0                |
# >> |------------------+--------------------|
