require "./setup"
Swars::User["SugarHuuko"].stat.win_stat.to_h                 # => {:へなちょこ急戦=>0.6666666666666666, :居飛車=>0.64, :対振り飛車=>0.6, :対穴熊=>1.0, :対抗形=>0.6, :短手数=>0.6875, :こびん攻め=>0.625, :長手数=>0.6176470588235294, :相掛かり=>0.7142857142857143, :居玉=>0.6666666666666666, :大駒コンプリート=>0.8, :相居飛車=>0.6666666666666666, :対居飛車=>0.6666666666666666, :ふんどしの桂=>0.8571428571428571, :割り打ちの銀=>1.0, :銀矢倉=>1.0, :大駒全ブッチ=>1.0, :背水の陣=>1.0, :持久戦=>0.6521739130434783, :一間竜=>0.7777777777777778, :たたきの歩=>0.6363636363636364, :駒柱=>1.0, :桂頭の銀=>1.0, :端玉には端歩=>0.6666666666666666, :力戦=>0.6153846153846154, :名人に定跡なし=>1.0, :居飛車金無双=>0.75, :袖飛車=>1.0, :穴熊の姿焼き=>1.0, :新村田システム=>1.0, :遠見の角=>1.0, :腰掛け銀=>1.0, :対振り持久戦=>1.0, :新型雁木=>0.75, :石田流=>1.0, :坊主美濃=>1.0, :カニ囲い=>1.0, :田楽刺し=>1.0, :陽動振り飛車=>1.0, :入玉=>1.0, :腹銀=>1.0, :ツノ銀型右玉=>1.0}
Swars::User["SugarHuuko"].stat.win_stat.to_s                 # => "へなちょこ急戦,居飛車,対振り飛車,対穴熊,対抗形,短手数,こびん攻め,長手数,相掛かり,居玉,大駒コンプリート,相居飛車,対居飛車,ふんどしの桂,割り打ちの銀,銀矢倉,大駒全ブッチ,背水の陣,持久戦,一間竜,たたきの歩,駒柱,桂頭の銀,端玉には端歩,力戦,名人に定跡なし,居飛車金無双,袖飛車,穴熊の姿焼き,新村田システム,遠見の角,腰掛け銀,対振り持久戦,新型雁木,石田流,坊主美濃,カニ囲い,田楽刺し,陽動振り飛車,入玉,腹銀,ツノ銀型右玉"
Swars::User["SugarHuuko"].stat.win_stat.exist?(:"居飛車")    # => true
Swars::User["SugarHuuko"].stat.win_stat.include?("角換わり") # => false
Swars::User["SugarHuuko"].stat.win_stat.match?(/角交換/)     # => false
Swars::User["SugarHuuko"].stat.win_stat.anaguma_medal?       # => false
