require "./setup"
Swars::User["SugarHuuko"].stat.win_stat.to_h                 # => {:力戦=>0.6875, :居飛車=>0.66, :相居飛車=>0.7391304347826086, :対居飛車=>0.7391304347826086, :持久戦=>0.6923076923076923, :短手数=>0.72, :舟囲い=>0.625, :急戦=>0.65, :新型雁木=>1.0, :右玉=>1.0, :居玉=>0.8, :大駒コンプリート=>1.0, :ふんどしの桂=>1.0, :へなちょこ急戦=>0.8333333333333334, :桂頭の銀=>1.0, :相掛かり=>0.6666666666666666, :対振り持久戦=>0.6666666666666666, :継ぎ桂=>1.0, :角交換型=>0.75, :相居玉=>1.0, :地下鉄飛車=>1.0, :ツノ銀雁木=>1.0, :腹銀=>1.0, :棒銀=>1.0}
Swars::User["SugarHuuko"].stat.win_stat.to_s                 # => "力戦,居飛車,相居飛車,対居飛車,持久戦,短手数,舟囲い,急戦,新型雁木,右玉,居玉,大駒コンプリート,ふんどしの桂,へなちょこ急戦,桂頭の銀,相掛かり,対振り持久戦,継ぎ桂,角交換型,相居玉,地下鉄飛車,ツノ銀雁木,腹銀,棒銀"
Swars::User["SugarHuuko"].stat.win_stat.exist?(:"居飛車")    # => true
Swars::User["SugarHuuko"].stat.win_stat.include?("角換わり") # => false
Swars::User["SugarHuuko"].stat.win_stat.match?(/角交換/)     # => true
