require "./setup"
scope = Swars::Membership.where(id: Swars::Membership.last(100).collect(&:id))
tp QuickScript::Swars::TacticBattleAggregator.new(scope: scope).tap(&:cache_write).aggregate
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] win_only_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] general_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] base_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] win_only_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] general_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] base_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] win_only_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] win_only_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] win_only_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] general_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] win_only_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] win_only_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] win_only_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] win_only_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] general_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] win_only_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] general_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] win_only_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] general_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] win_only_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] win_only_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] general_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] win_only_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] win_only_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] general_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] win_only_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] general_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] win_only_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] win_only_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] general_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] win_only_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] win_only_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] win_only_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] win_only_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] general_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] base_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] win_only_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] win_only_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] win_only_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] win_only_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] win_only_conditon
# >> [2025-05-16 08:56:20][QuickScript::Swars::TacticBattleAggregator][#1/1] win_only_conditon
# >> 2025-05-15T23:56:20.790Z pid=5733 tid=68d INFO: Sidekiq 7.3.9 connecting to Redis with options {size: 10, pool_name: "internal", url: "redis://localhost:6379/4"}
# >> |--------------------------+------------|
# >> |                    UFO銀 | []         |
# >> |                     入玉 | []         |
# >> |                     全駒 | []         |
# >> |                     力戦 | [250, 251] |
# >> |                     右玉 | []         |
# >> |                     壁金 | []         |
# >> |                     壁銀 | [252, 253] |
# >> |                     尻金 | []         |
# >> |                     尻銀 | []         |
# >> |                     居玉 | []         |
# >> |                     急戦 | []         |
# >> |                     暴銀 | []         |
# >> |                     棒玉 | []         |
# >> |                     棒金 | []         |
# >> |                     棒銀 | []         |
# >> |                     穴熊 | []         |
# >> |                     肩金 | []         |
# >> |                     肩銀 | []         |
# >> |                     腹金 | []         |
# >> |                     腹銀 | []         |
# >> |                     蓋歩 | []         |
# >> |                     裾金 | []         |
# >> |                     裾銀 | [250, 251] |
# >> |                     銀冠 | []         |
# >> |                     頭金 | []         |
# >> |                     頭銀 | [250, 251] |
# >> |                     風車 | []         |
# >> |                     駒柱 | []         |
# >> |                   GAVA角 | [252, 253] |
# >> |                   一間竜 | []         |
# >> |                   勇気流 | []         |
# >> |                   右矢倉 | []         |
# >> |                   四手角 | []         |
# >> |                   垂れ歩 | [250, 251] |
# >> |                   嬉野流 | []         |
# >> |                   対抗形 | [252, 253] |
# >> |                   対穴熊 | []         |
# >> |                   居飛車 | [250, 251] |
# >> |                   左美濃 | []         |
# >> |                   幽霊角 | []         |
# >> |                   持久戦 | [250, 251] |
# >> |                   新風車 | []         |
# >> |                   早囲い | []         |
# >> |                   早石田 | []         |
# >> |                   片穴熊 | []         |
# >> |                   片銀冠 | []         |
# >> |                   玉単騎 | []         |
# >> |                   玉頭銀 | []         |
# >> |                   相入玉 | []         |
# >> |                   相居玉 | []         |
# >> |                   相穴熊 | []         |
# >> |                   真部流 | []         |
# >> |                   短手数 | [252, 253] |
# >> |                   石田流 | []         |
# >> |                   端棒銀 | []         |
# >> |                   紙穴熊 | []         |
# >> |                   継ぎ桂 | []         |
# >> |                   継ぎ歩 | []         |
# >> |                   総矢倉 | []         |
# >> |                   舟囲い | []         |
# >> |                   菱矢倉 | []         |
# >> |                   袖飛車 | []         |
# >> |                   裾固め | []         |
# >> |                   角不成 | []         |
# >> |                   角矢倉 | []         |
# >> |                   超急戦 | []         |
# >> |                   逆棒銀 | []         |
# >> |                   遠山流 | []         |
# >> |                   都詰め | []         |
# >> |                   金多伝 | []         |
# >> |                   金沢流 | []         |
# >> |                   金無双 | []         |
# >> |                   金矢倉 | []         |
# >> |                   金美濃 | []         |
# >> |                   金銀橋 | []         |
# >> |                   銀多伝 | []         |
# >> |                   銀矢倉 | []         |
# >> |                   銀美濃 | []         |
# >> |                   銀雲雀 | []         |
# >> |                   鎖鎌銀 | []         |
# >> |                   長手数 | [250, 251] |
# >> |                   隅矢倉 | []         |
# >> |                   雀刺し | []         |
# >> |                   青野流 | []         |
# >> |                   高矢倉 | []         |
# >> |                   鬼殺し | []         |
# >> |                   鳥刺し | []         |
# >> |                  5手爆弾 | []         |
# >> |                  ビッグ4 | []         |
# >> |                 舟囲いDX | []         |
# >> |                 ずれ美濃 | []         |
# >> |                 ウソ矢倉 | []         |
# >> |                 カギ囲い | []         |
# >> |                 カタ囲い | []         |
# >> |                 カニ囲い | []         |
# >> |                 レグスペ | []         |
# >> |                 ロケット | []         |
# >> |                 一間飛車 | []         |
# >> |                 三段右玉 | []         |
# >> |                 三間飛車 | []         |
# >> |                 下段の香 | [250, 251] |
# >> |                 中住まい | [252, 253] |
# >> |                 中原囲い | []         |
# >> |                 中原飛車 | []         |
# >> |                 中座飛車 | []         |
# >> |                 九間飛車 | []         |
# >> |                 位の確保 | [250, 251] |
# >> |                 升田美濃 | []         |
# >> |                 原始棒銀 | []         |
# >> |                 吊るし桂 | []         |
# >> |                 同型矢倉 | []         |
# >> |                 四枚穴熊 | []         |
# >> |                 四枚美濃 | []         |
# >> |                 四枚銀冠 | []         |
# >> |                 四段端玉 | []         |
# >> |                 四角矢倉 | []         |
# >> |                 四間飛車 | []         |
# >> |                 土居矢倉 | []         |
# >> |                 坊主美濃 | []         |
# >> |                 大山美濃 | []         |
# >> |                 大盾囲い | []         |
# >> |                 大隅囲い | []         |
# >> |                 天野矢倉 | []         |
# >> |                 対居飛車 | [252, 253] |
# >> |                 山田定跡 | []         |
# >> |                 左山囲い | []         |
# >> |                 悪形矢倉 | []         |
# >> |                 振り飛車 | [252, 253] |
# >> |                 控えの桂 | []         |
# >> |                 文鎮囲い | []         |
# >> |                 新型雁木 | []         |
# >> |                 新嬉野流 | []         |
# >> |                 新石田流 | []         |
# >> |                 新米長玉 | []         |
# >> |                 新鬼殺し | []         |
# >> |                 木村定跡 | []         |
# >> |                 木村美濃 | []         |
# >> |                 桂頭の銀 | [250, 251] |
# >> |                 横歩取り | []         |
# >> |                 歩頭の桂 | [250, 251] |
# >> |                 流れ矢倉 | []         |
# >> |                 流線矢倉 | []         |
# >> |                 無敵囲い | []         |
# >> |                 田楽刺し | []         |
# >> |                 相居飛車 | []         |
# >> |                 相掛かり | []         |
# >> |                 矢倉右玉 | []         |
# >> |                 矢倉棒銀 | []         |
# >> |                 矢倉穴熊 | []         |
# >> |                 稲庭戦法 | []         |
# >> |                 穴角戦法 | []         |
# >> |                 空中楼閣 | []         |
# >> |                 端玉銀冠 | []         |
# >> |                 筋違い角 | []         |
# >> |                 箱入り娘 | []         |
# >> |                 美濃囲い | []         |
# >> |                 背水の陣 | []         |
# >> |                 腰掛け銀 | []         |
# >> |                 菊水矢倉 | []         |
# >> |                 角交換型 | []         |
# >> |                 角換わり | []         |
# >> |                 豆腐矢倉 | []         |
# >> |                 連打の歩 | []         |
# >> |                 連盟美濃 | []         |
# >> |                 遠見の角 | []         |
# >> |                 金底の歩 | []         |
# >> |                 金盾囲い | []         |
# >> |                 金門矢倉 | []         |
# >> |                 金頭の桂 | []         |
# >> |                 銀ばさみ | []         |
# >> |                 銀冠穴熊 | []         |
# >> |                 錆刀戦法 | []         |
# >> |                 雁木右玉 | []         |
# >> |                 雪隠詰め | []         |
# >> |                 雲隠れ玉 | []         |
# >> |                 飛車不成 | []         |
# >> |                 鷺宮定跡 | []         |
# >> |                5筋位取り | []         |
# >> |                6筋位取り | []         |
# >> |               xaby角戦法 | []         |
# >> |              3→4→3戦法 | []         |
# >> |               いかだ囲い | []         |
# >> |               いちご囲い | []         |
# >> |               きｍきｍ金 | []         |
# >> |               こびん攻め | [250, 251] |
# >> |               たすきの角 | []         |
# >> |               たすきの銀 | []         |
# >> |               たたきの歩 | [250, 251] |
# >> |               ひねり飛車 | []         |
# >> |               へこみ矢倉 | []         |
# >> |               アヒル囲い | []         |
# >> |               アヒル戦法 | []         |
# >> |               エルモ囲い | []         |
# >> |               エルモ急戦 | []         |
# >> |               カニカニ金 | []         |
# >> |               カニカニ銀 | []         |
# >> |               カニ缶囲い | []         |
# >> |               カブト囲い | []         |
# >> |               カブト美濃 | []         |
# >> |               ゴリゴリ金 | []         |
# >> |               ゴリ違い角 | []         |
# >> |               ツノ銀囲い | []         |
# >> |               ツノ銀雁木 | []         |
# >> |               トマホーク | []         |
# >> |               ヒラメ戦法 | []         |
# >> |               ポンポン桂 | []         |
# >> |               一文字矢倉 | []         |
# >> |               一直線穴熊 | []         |
# >> |               串カツ囲い | []         |
# >> |               先手中飛車 | []         |
# >> |               原始中飛車 | []         |
# >> |               右四間飛車 | []         |
# >> |               向かい飛車 | []         |
# >> |               土下座の歩 | []         |
# >> |               地下鉄飛車 | []         |
# >> |               天守閣囲い | []         |
# >> |               天守閣美濃 | []         |
# >> |               富士見矢倉 | []         |
# >> |               対振り飛車 | [250, 251] |
# >> |               居飛車穴熊 | []         |
# >> |               居飛車金冠 | []         |
# >> |               居飛車銀冠 | []         |
# >> |               左美濃急戦 | []         |
# >> |               松尾流穴熊 | []         |
# >> |               無責任矢倉 | []         |
# >> |               片美濃囲い | []         |
# >> |               玉頭位取り | []         |
# >> |               相振り飛車 | []         |
# >> |               相横歩取り | []         |
# >> |               相筋違い角 | []         |
# >> |               矢倉中飛車 | []         |
# >> |               矢倉早囲い | []         |
# >> |               神吉流穴熊 | []         |
# >> |               糸谷流右玉 | [250, 251] |
# >> |               美濃熊囲い | []         |
# >> |               羽生流右玉 | []         |
# >> |               脇システム | []         |
# >> |               角頭歩戦法 | []         |
# >> |               金無双急戦 | []         |
# >> |               銀立ち矢倉 | []         |
# >> |               間宮久夢流 | []         |
# >> |               離れ金無双 | []         |
# >> |               高田流左玉 | []         |
# >> |               高美濃囲い | []         |
# >> |              2段ロケット | []         |
# >> |              3段ロケット | []         |
# >> |              4段ロケット | []         |
# >> |              5段ロケット | []         |
# >> |              6段ロケット | []         |
# >> |              Uターン飛車 | []         |
# >> |              ▲5七金戦法 | []         |
# >> |              △2三歩戦法 | []         |
# >> |              △3三桂戦法 | []         |
# >> |              △3三飛戦法 | []         |
# >> |              △4五角戦法 | []         |
# >> |             矢倉新24手組 | []         |
# >> |             矢倉旧24手組 | []         |
# >> |             あずまや囲い | []         |
# >> |             ふんどしの桂 | [250, 251] |
# >> |             やばボーズ流 | []         |
# >> |             オールド雁木 | []         |
# >> |             ゴリラの右手 | []         |
# >> |             セメント囲い | []         |
# >> |             ツノ銀中飛車 | []         |
# >> |             ツノ銀型右玉 | []         |
# >> |             パンツを脱ぐ | []         |
# >> |             ボナンザ囲い | []         |
# >> |             ムリヤリ矢倉 | []         |
# >> |             一間飛車穴熊 | []         |
# >> |             中飛車左穴熊 | []         |
# >> |             丸山ワクチン | []         |
# >> |             久保流早石田 | []         |
# >> |             割り打ちの銀 | []         |
# >> |             加藤流袖飛車 | []         |
# >> |             升田式石田流 | []         |
# >> |             大駒全ブッチ | []         |
# >> |             室岡システム | []         |
# >> |             対振り持久戦 | []         |
# >> |             居飛車の税金 | []         |
# >> |             居飛車金無双 | []         |
# >> |             居飛車金美濃 | []         |
# >> |             屋敷流二枚銀 | []         |
# >> |             幻想四間飛車 | []         |
# >> |             手得角交換型 | [252, 253] |
# >> |             手損角交換型 | [252, 253] |
# >> |             振り飛車穴熊 | []         |
# >> |             新ポンポン桂 | []         |
# >> |             村田システム | []         |
# >> |             森下システム | []         |
# >> |             楠本式石田流 | []         |
# >> |             極限早繰り銀 | []         |
# >> |             片ツノ銀囲い | []         |
# >> |             相掛かり棒銀 | []         |
# >> |             矢倉流中飛車 | []         |
# >> |             石田流本組み | []         |
# >> |             穴熊の姿焼き | []         |
# >> |             突き違いの歩 | []         |
# >> |             端玉には端歩 | []         |
# >> |             羽生式袖飛車 | []         |
# >> |             耀龍四間飛車 | []         |
# >> |             藤井システム | []         |
# >> |             裏アヒル囲い | []         |
# >> |             裏アヒル戦法 | []         |
# >> |             角換わり右玉 | []         |
# >> |             角換わり棒銀 | []         |
# >> |             跳ね違いの桂 | []         |
# >> |             鈴木流早石田 | []         |
# >> |             銀冠の小部屋 | []         |
# >> |             陽動振り飛車 | []         |
# >> |             魔界四間飛車 | []         |
# >> |            ▲4六銀右急戦 | []         |
# >> |            ▲4六銀左急戦 | []         |
# >> |            ▲5五龍中飛車 | []         |
# >> |            △7二飛亜急戦 | []         |
# >> |            天彦流▲6六角 | []         |
# >> |            都成流△3一金 | []         |
# >> |           戸辺流4→3戦法 | []         |
# >> |           かんぴょう囲い | []         |
# >> |           きんとうん戦法 | []         |
# >> |           ちょんまげ美濃 | []         |
# >> |           はく式四間飛車 | []         |
# >> |           へなちょこ急戦 | []         |
# >> |           オザワシステム | []         |
# >> |           オリジナル雁木 | []         |
# >> |           カメレオン戦法 | []         |
# >> |           ゴキゲン中飛車 | []         |
# >> |           ノーガード戦法 | []         |
# >> |           パックマン戦法 | []         |
# >> |           ミレニアム囲い | []         |
# >> |           ムリヤリ早石田 | []         |
# >> |           メイドシステム | []         |
# >> |           モノレール囲い | []         |
# >> |           一手損角換わり | []         |
# >> |           下町流三間飛車 | []         |
# >> |           中原流急戦矢倉 | []         |
# >> |           中原流相掛かり | []         |
# >> |           九間飛車左穴熊 | []         |
# >> |           右四間飛車急戦 | []         |
# >> |           名人に定跡なし | []         |
# >> |           塚田スペシャル | []         |
# >> |           対矢倉急戦棒銀 | []         |
# >> |           振り飛車エルモ | []         |
# >> |           新村田システム | []         |
# >> |           桐山流中原囲い | []         |
# >> |           清野流岐阜戦法 | []         |
# >> |           目くらまし戦法 | []         |
# >> |           神吉流三間飛車 | []         |
# >> |           穴角向かい飛車 | []         |
# >> |           立石流四間飛車 | []         |
# >> |           竹部スペシャル | []         |
# >> |           米長流急戦矢倉 | []         |
# >> |           耀龍ひねり飛車 | []         |
# >> |           菅井流三間飛車 | []         |
# >> |           藤森流急戦矢倉 | []         |
# >> |           角交換振り飛車 | []         |
# >> |          5筋位取り中飛車 | []         |
# >> |          ▲4五歩早仕掛け | []         |
# >> |          初手▲3六歩戦法 | []         |
# >> |          初手▲7八銀戦法 | []         |
# >> |          初手▲7八飛戦法 | []         |
# >> |          振り飛車ビッグ4 | []         |
# >> |          矢倉▲3七銀戦法 | []         |
# >> |          菜々河流△4四角 | []         |
# >> |          超速▲3七銀戦法 | []         |
# >> |         2手目△3ニ飛戦法 | []         |
# >> |         2手目△6二銀戦法 | []         |
# >> |         2手目△7四歩戦法 | []         |
# >> |         4手目△3三角戦法 | []         |
# >> |         うっかり三間飛車 | []         |
# >> |         タランチュラ戦法 | []         |
# >> |         ダイヤモンド美濃 | []         |
# >> |         チョコレート囲い | []         |
# >> |         ネコ式タテ歩取り | []         |
# >> |         ノーマル三間飛車 | []         |
# >> |         ノーマル四間飛車 | []         |
# >> |         中飛車ミレニアム | []         |
# >> |         右四間飛車左美濃 | []         |
# >> |         右四間飛車超急戦 | []         |
# >> |         大駒コンプリート | []         |
# >> |         天彦流向かい飛車 | []         |
# >> |         山崎流パックマン | []         |
# >> |         必笑ひっかけ戦法 | []         |
# >> |         振り飛車四枚美濃 | []         |
# >> |         振り飛車端玉銀冠 | []         |
# >> |         振り飛車銀冠穴熊 | []         |
# >> |         桐山流タテ歩棒銀 | []         |
# >> |         森安流袖飛車穴熊 | []         |
# >> |         花村流名古屋戦法 | []         |
# >> |         英ちゃん流中飛車 | []         |
# >> |         英春流カメレオン | []         |
# >> |         角換わり早繰り銀 | []         |
# >> |         角換わり腰掛け銀 | []         |
# >> |         角道不突き左美濃 | []         |
# >> |         阪田流向かい飛車 | []         |
# >> |         阿久津流急戦矢倉 | []         |
# >> |         飯島流引き角戦法 | []         |
# >> |         鬼殺し向かい飛車 | []         |
# >> |        △3三角型空中戦法 | []         |
# >> |        △3三金型早繰り銀 | []         |
# >> |       阪田流2手目△9四歩 | []         |
# >> |       つくつくぼうし戦法 | []         |
# >> |       コーヤン流三間飛車 | []         |
# >> |       ショーダンシステム | []         |
# >> |       メリケン向かい飛車 | []         |
# >> |       三間飛車ミレニアム | []         |
# >> |       四間飛車ミレニアム | []         |
# >> |       居飛穴音無しの構え | []         |
# >> |       屋敷流二枚銀棒銀型 | []         |
# >> |       振り飛車ミレニアム | []         |
# >> |       振り飛車串カツ囲い | []         |
# >> |       振り飛車天守閣美濃 | []         |
# >> |       筋違い角蟻地獄戦法 | []         |
# >> |       菜々河流向かい飛車 | []         |
# >> |       鬼六流どっかん飛車 | []         |
# >> |     2手目△3二銀システム | []         |
# >> |     ショーダンオリジナル | []         |
# >> |     ダイレクト向かい飛車 | []         |
# >> |     モノレール向かい飛車 | []         |
# >> |     三間飛車藤井システム | []         |
# >> |     英春流かまいたち戦法 | []         |
# >> |     角換わり腰掛け銀旧型 | []         |
# >> |     角道オープン四間飛車 | []         |
# >> |     飛騨の中飛車合掌造り | []         |
# >> |   対ひねり飛車たこ金戦法 | []         |
# >> | 飯島流相掛かり引き角戦法 | []         |
# >> |--------------------------+------------|
