require "./setup"

scope = Swars::Membership.where(id: Swars::Membership.last(200).collect(&:id))
instance = QuickScript::Swars::GradeStatScript::PrimaryAggregator.new(scope: scope)
tp instance.aggregate
# tp instance.aggregate[:counts_hash].values.sum { |e| e[:membership][:__tag_nothing__] } # => 196
# tp instance.aggregate[:counts_hash].values.sum { |e| e[:user][:__tag_nothing__] }       # => 124
exit

# p _ { QuickScript::Swars::GradeStatScript::PrimaryAggregator.new(batch_size: 500000).call }
# p QuickScript::Swars::GradeStatScript::PrimaryAggregator.new.population_count
# p QuickScript::Swars::GradeStatScript::PrimaryAggregator.new.call
# scope = Swars::Membership.where(id: Swars::Membership.last(200).collect(&:id))
# _ { QuickScript::Swars::GradeStatScript::PrimaryAggregator.new(scope: scope).call } # => "32.49 ms"
# s { QuickScript::Swars::GradeStatScript::PrimaryAggregator.new(scope: scope).call } # => {:memberships_count=>2, :counts_hash=>{"三段"=>{"__tag_nothing__"=>1, "高美濃囲い"=>1, "振り飛車"=>1, "大駒コンプリート"=>1, "対居飛車"=>1, "対抗形"=>1, "持久戦"=>1, "長手数"=>1, "割り打ちの銀"=>1}, "四段"=>{"__tag_nothing__"=>1, "対振り持久戦"=>1, "舟囲い"=>1, "居飛車"=>1, "対振り飛車"=>1, "大駒全ブッチ"=>1, "対抗形"=>1, "持久戦"=>1, "長手数"=>1}}, :primary_aggregated_at=>Sun, 25 Aug 2024 10:48:23.623478000 JST +09:00, :primary_aggregation_second=>0.006454}

# Swars::Battle.order(id: :desc).limit(30).destroy_all

s = Swars::Membership.where(id: Swars::Membership.unscoped.last(5).collect(&:id))
s.group("user_id").count # => 
tp s.collect(&:info)

s.count # => 
s.joins(:grade).group("swars_grades.key").count # => 
tp s.joins(:grade).group("swars_grades.key").joins(:taggings => :tag).group("tags.name").count # => 

# sql
s.joins(:grade).select(:user_id, "swars_grades.key").distinct.count # => 

s.joins(:grade).select(:user_id, "swars_grades.key").distinct.group("swars_grades.key").count # => 
tp s.joins(:grade).select(:user_id, "swars_grades.key").distinct.group("swars_grades.key").joins(:taggings => :tag).group("tags.name").count # => 
# >> [2024-08-28 21:42:46][QuickScript::Swars::GradeStatScript::PrimaryAggregator] Processing relation #0
# >> |------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
# >> |  1級 | {:user=>{:__tag_nothing__=>12, "ふんどしの桂"=>4, "三間飛車"=>1, "入玉"=>2, "力戦"=>4, "升田美濃"=>1, "原始中飛車"=>1, "原始棒銀"=>1, "右四間飛車"=>1, "右四間飛車急戦"=>1, "向かい飛車"=>1, "四間飛車"=>1, "垂れ歩"=>2, "大駒コンプリート"=>1, "大駒全ブッチ"=>1, "天守閣美濃"=>1, "嬉野流"=>1, "対抗形"=>6, "対振り飛車"=>3, "居玉"=>3, "居飛車"=>7,...              |
# >> |  2級 | {:user=>{:__tag_nothing__=>7, "5筋位取り中飛車"=>2, "ちょんまげ美濃"=>1, "ふんどしの桂"=>1, "カブト囲い"=>1, "ゴキゲン中飛車"=>1, "入玉"=>1, "力戦"=>1, "垂れ歩"=>1, "対抗形"=>2, "居飛車"=>2, "急戦"=>4, "手得角交換型"=>3, "手損角交換型"=>1, "持久戦"=>3, "振り飛車"=>5, "早囲い"=>1, "相居飛車"=>2, "相振り飛車"=>3, "短手数"=>2, "角換わり腰掛け銀"=...           |
# >> |  3級 | {:user=>{:__tag_nothing__=>17, "5筋位取り中飛車"=>1, "UFO銀"=>1, "ずれ美濃"=>1, "やばボーズ流"=>1, "エルモ囲い"=>2, "ロケット"=>2, "九間飛車"=>1, "力戦"=>2, "原始中飛車"=>1, "原始棒銀"=>4, "右四間飛車"=>3, "右四間飛車急戦"=>3, "右玉"=>1, "右矢倉"=>1, "四間飛車"=>2, "垂れ歩"=>7, "大駒コンプリート"=>1, "大駒全ブッチ"=>1, "天野矢倉"=>1, "嬉野流...             |
# >> |  4級 | {:user=>{:__tag_nothing__=>11, "ふんどしの桂"=>1, "ゴキゲン中飛車"=>1, "一手損角換わり"=>1, "入玉"=>1, "力戦"=>3, "向かい飛車"=>1, "四間飛車"=>2, "垂れ歩"=>3, "天守閣美濃"=>1, "対抗形"=>5, "対振り飛車"=>2, "居玉"=>7, "居飛車"=>6, "急戦"=>8, "手得角交換型"=>1, "手損角交換型"=>1, "持久戦"=>3, "振り飛車"=>6, "振り飛車穴熊"=>1, "新嬉野流"=>1, ...               |
# >> |  5級 | {:user=>{:__tag_nothing__=>5, "一間飛車"=>1, "力戦"=>1, "原始棒銀"=>1, "四間飛車"=>2, "垂れ歩"=>1, "嬉野流"=>1, "対抗形"=>3, "対振り飛車"=>1, "居玉"=>2, "居飛車"=>3, "急戦"=>3, "持久戦"=>1, "振り飛車"=>3, "早石田"=>1, "棒銀"=>1, "片美濃囲い"=>1, "相居玉"=>2, "相居飛車"=>3, "短手数"=>4, "石田流"=>1, "継ぎ桂"=>1, "角交換振り飛車"=>...                         |
# >> |  6級 | {:user=>{:__tag_nothing__=>1, "四間飛車"=>1, "対抗形"=>1, "居玉"=>1, "急戦"=>1, "振り飛車"=>1, "相居玉"=>1, "短手数"=>1}, :membership=>{:__tag_nothing__=>1, "四間飛車"=>1, "居玉"=>1, "振り飛車"=>1, "対抗形"=>1, "相居玉"=>1, "急戦"=>1, "短手数"=>1}}                                                                                                               |
# >> | 三段 | {:user=>{:__tag_nothing__=>9, "ふんどしの桂"=>1, "割り打ちの銀"=>1, "力戦"=>3, "右四間飛車"=>1, "向かい飛車"=>1, "四間飛車"=>3, "垂れ歩"=>3, "大駒コンプリート"=>3, "大駒全ブッチ"=>2, "対抗形"=>7, "対振り持久戦"=>1, "対振り飛車"=>3, "居玉"=>1, "居飛車"=>5, "居飛車穴熊"=>1, "急戦"=>5, "手得角交換型"=>1, "持久戦"=>5, "振り飛車"=>4, "振り飛車穴熊"=...          |
# >> | 二段 | {:user=>{:__tag_nothing__=>22, "5筋位取り中飛車"=>1, "かまいたち戦法"=>1, "はく式四間飛車"=>1, "ふんどしの桂"=>5, "エルモ囲い"=>1, "オールド雁木"=>1, "カブト囲い"=>1, "ゴキゲン中飛車"=>1, "ダイレクト向かい飛車"=>1, "ロケット"=>1, "一手損角換わり"=>1, "三間飛車"=>1, "入玉"=>1, "割り打ちの銀"=>1, "力戦"=>1, "原始棒銀"=>1, "右四間飛車"=>2, "向かい飛車"=>1,... |
# >> | 五段 | {:user=>{:__tag_nothing__=>6, "5筋位取り中飛車"=>1, "ふんどしの桂"=>3, "カブト囲い"=>1, "ツノ銀型右玉"=>1, "一手損角換わり"=>1, "中飛車左穴熊"=>1, "割り打ちの銀"=>1, "右四間飛車"=>1, "右玉"=>1, "向かい飛車"=>1, "垂れ歩"=>1, "大駒全ブッチ"=>1, "対抗形"=>2, "対振り持久戦"=>1, "対振り飛車"=>2, "居玉"=>1, "居飛車"=>5, "居飛車穴熊"=>1, "居飛車金美濃"=>1...      |
# >> | 六段 | {:user=>{:__tag_nothing__=>2, "対抗形"=>2, "対振り飛車"=>1, "居飛車"=>1, "左山囲い"=>1, "急戦"=>1, "持久戦"=>1, "振り飛車"=>1, "短手数"=>2, "袖飛車"=>1, "高美濃囲い"=>1, "鷺宮定跡"=>1, "４→３戦法"=>1}, :membership=>{:__tag_nothing__=>2, "鷺宮定跡"=>1, "袖飛車"=>1, "左山囲い"=>1, "居飛車"=>1, "対振り飛車"=>1, "対抗形"=>2...                                  |
# >> | 初段 | {:user=>{:__tag_nothing__=>14, "5筋位取り中飛車"=>1, "UFO銀"=>1, "▲４五歩早仕掛け"=>1, "ふんどしの桂"=>2, "三間飛車"=>1, "力戦"=>1, "升田式石田流"=>1, "原始中飛車"=>1, "原始棒銀"=>1, "四間飛車"=>3, "垂れ歩"=>5, "大駒コンプリート"=>2, "大駒全ブッチ"=>4, "天野矢倉"=>1, "対抗形"=>11, "対振り持久戦"=>1, "対振り飛車"=>5, "居玉"=>2, "居飛車"=>8, ...             |
# >> | 四段 | {:user=>{:__tag_nothing__=>18, "5筋位取り中飛車"=>2, "▲３七銀戦法"=>1, "ちょんまげ美濃"=>1, "ふんどしの桂"=>2, "やばボーズ流"=>1, "オールド雁木"=>1, "カブト囲い"=>2, "ゴキゲン中飛車"=>1, "ダイヤモンド美濃"=>1, "ボナンザ囲い"=>2, "ロケット"=>1, "三間飛車"=>2, "入玉"=>1, "割り打ちの銀"=>1, "力戦"=>3, "右四間飛車"=>3, "右四間飛車急戦"=>1, "四間飛車"=>1, ...  |
# >> |------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
