require "./setup"

Swars::Importer::AllRuleImporter.new(user_key: "DevUser1").run
Swars::Battle.count             # => 1797324

puts Swars::Crawler::ExpertCrawler.new.run.rows.to_t
# >> [fetch][history] https://shogiwars.heroz.jp/games/history?gtype=&page=1&user_id=DevUser1
# >> DevUser1 P1 10分 [全3件][新0件][最後]
# >> 最後のページと思われるので終わる
# >> [fetch][history] https://shogiwars.heroz.jp/games/history?gtype=sb&page=1&user_id=DevUser1
# >> DevUser1 P1 3分 [全3件][新0件][最後]
# >> 最後のページと思われるので終わる
# >> [fetch][history] https://shogiwars.heroz.jp/games/history?gtype=s1&page=1&user_id=DevUser1
# >> DevUser1 P1 10秒 [全3件][新0件][最後]
# >> 最後のページと思われるので終わる
# >> [fetch][history] https://shogiwars.heroz.jp/games/history?gtype=&page=1&user_id=DevUser1
# >> DevUser1 P1 10分 [全3件][新0件][最後]
# >> 最後のページと思われるので終わる
# >> [fetch][history] https://shogiwars.heroz.jp/games/history?gtype=sb&page=1&user_id=DevUser1
# >> DevUser1 P1 3分 [全3件][新0件][最後]
# >> 最後のページと思われるので終わる
# >> [fetch][history] https://shogiwars.heroz.jp/games/history?gtype=s1&page=1&user_id=DevUser1
# >> DevUser1 P1 10秒 [全3件][新0件][最後]
# >> 最後のページと思われるので終わる
# >> 2024-07-29T11:42:49.204Z pid=5029 tid=109 INFO: Sidekiq 7.1.6 connecting to Redis with options {:size=>10, :pool_name=>"internal", :url=>"redis://localhost:6379/4"}
# >> |-------------+--------------|
# >> |      notify | true         |
# >> |       sleep | 0            |
# >> |     subject |              |
# >> |   user_keys | ["DevUser1"] |
# >> |    page_max | 1            |
# >> | early_break | true         |
# >> |-------------+--------------|
# >> |---------------------+--------+------------+------+----+----+------+----------+------------+-------------------------------------+--------|
# >> | 日時                | ID     | ユーザー名 | 段級 | 前 | 後 | 差分 | 検索回数 | 最終検索   | 最終対局                            | エラー |
# >> |---------------------+--------+------------+------+----+----+------+----------+------------+-------------------------------------+--------|
# >> | 2024-07-29 20:42:49 | 966837 | DevUser1   | 30級 |  1 |  1 |   +0 |        3 | 6/25 00:02 | 2020-01-01 12:34 (2020-01-01 12:34) |        |
# >> |---------------------+--------+------------+------+----+----+------+----------+------------+-------------------------------------+--------|
# >> |---------------------+--------+------------+------+----+----+------+----------+------------+-------------------------------------+--------|
# >> | 日時                | ID     | ユーザー名 | 段級 | 前 | 後 | 差分 | 検索回数 | 最終検索   | 最終対局                            | エラー |
# >> |---------------------+--------+------------+------+----+----+------+----------+------------+-------------------------------------+--------|
# >> | 2024-07-29 20:42:49 | 966837 | DevUser1   | 30級 |  1 |  1 |   +0 |        3 | 6/25 00:02 | 2020-01-01 12:34 (2020-01-01 12:34) |        |
# >> |---------------------+--------+------------+------+----+----+------+----------+------------+-------------------------------------+--------|
