require "./setup"
# ENV["EXECUTE_ERROR_PURPOSE"] = "1"
user = Swars::User.create!
user.search_logs.create!
instance = Swars::Crawler::MomentumCrawler.new(period: 100.days, at_least: 1, limit: 2)
Swars::Battle.count                    # => 1895517
instance.run
Swars::Battle.count                    # => 1895517
# >> 2024-11-14T04:59:24.093Z pid=40616 tid=qyg INFO: Sidekiq 7.1.6 connecting to Redis with options {:size=>10, :pool_name=>"internal", :url=>"redis://localhost:6379/4"}
# >> "[将棋ウォーズ][クロール完了][直近数日で注目されているユーザー] +0"
# >> |-------------+----------------------------------|
# >> |      notify | true                             |
# >> |       sleep | 0                                |
# >> |     subject | 直近数日で注目されているユーザー |
# >> |    page_max | 1                                |
# >> | early_break | false                            |
# >> |      period | 8640000                          |
# >> |    at_least | 1                                |
# >> |       limit | 2                                |
# >> |-------------+----------------------------------|
# >> |---------------------+--------+------------+------+-----+-----+------+----------+------------+---------------------+-------------------|
# >> | 日時                | ID     | ユーザー名 | 段級 | 前  | 後  | 差分 | 検索回数 | 最終検索   | 最終対局            | エラー            |
# >> |---------------------+--------+------------+------+-----+-----+------+----------+------------+---------------------+-------------------|
# >> | 2024-11-14 13:59:24 |    169 | sinkensi   | 四段 | 102 | 102 |   +0 |       19 | 9/30 19:03 | 2024-10-17 14:25:48 | ZeroDivisionError |
# >> | 2024-11-14 13:59:24 | 135378 | raminitk   | 初段 | 104 | 104 |   +0 |       14 | 9/13 00:28 | 2024-10-17 22:09:05 | ZeroDivisionError |
# >> |---------------------+--------+------------+------+-----+-----+------+----------+------------+---------------------+-------------------|
