require "./setup"
tp Swars::CrawlReservation
Swars::Crawler::ReservationCrawler.new.call
tp Swars::CrawlReservation
# >> |------+---------+-----------------+-----------------+--------------+---------------------------+---------------------------|
# >> | id   | user_id | target_user_key | attachment_mode | processed_at | created_at                | updated_at                |
# >> |------+---------+-----------------+-----------------+--------------+---------------------------+---------------------------|
# >> | 4362 |      36 | alice           | with_zip        |              | 2024-07-28 20:05:35 +0900 | 2024-07-28 20:05:35 +0900 |
# >> | 4363 |      33 | BOUYATETSU5     | nothing         |              | 2024-07-28 20:23:01 +0900 | 2024-07-28 20:23:01 +0900 |
# >> |------+---------+-----------------+-----------------+--------------+---------------------------+---------------------------|
# >> [fetch][history] https://shogiwars.heroz.jp/games/history?gtype=&page=1&user_id=alice
# >> alice P1 10分 [全3件][新0件][最後]
# >> 最後のページと思われるので終わる
# >> [fetch][history] https://shogiwars.heroz.jp/games/history?gtype=sb&page=1&user_id=alice
# >> alice P1 3分 [全3件][新0件][最後]
# >> 最後のページと思われるので終わる
# >> [fetch][history] https://shogiwars.heroz.jp/games/history?gtype=s1&page=1&user_id=alice
# >> alice P1 10秒 [全3件][新0件][最後]
# >> 最後のページと思われるので終わる
# >> 2024-07-28T11:48:33.706Z pid=48574 tid=xs2 INFO: Sidekiq 7.1.6 connecting to Redis with options {:size=>10, :pool_name=>"internal", :url=>"redis://localhost:6379/4"}
# >> [fetch][history] https://shogiwars.heroz.jp/games/history?gtype=&page=1&user_id=BOUYATETSU5
# >> BOUYATETSU5 P1 10分 [全3件][新0件][最後]
# >> 最後のページと思われるので終わる
# >> [fetch][history] https://shogiwars.heroz.jp/games/history?gtype=sb&page=1&user_id=BOUYATETSU5
# >> BOUYATETSU5 P1 3分 [全3件][新0件][最後]
# >> 最後のページと思われるので終わる
# >> [fetch][history] https://shogiwars.heroz.jp/games/history?gtype=s1&page=1&user_id=BOUYATETSU5
# >> BOUYATETSU5 P1 10秒 [全3件][新0件][最後]
# >> 最後のページと思われるので終わる
# >> |--------+------|
# >> | notify | true |
# >> |  sleep | 0    |
# >> |--------+------|
# >> |---------------------+--------+-------------+------+------+------+------+----------+----------+-------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
# >> | 日時                | ID     | ユーザー名  | 段級 | 前   | 後   | 差分 | 検索回数 | 最終検索 | 最終対局                      | エラー                                                                                                                                                                                                                                                              |
# >> |---------------------+--------+-------------+------+------+------+------+----------+----------+-------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
# >> | 2024-07-28 20:48:33 | 967063 | alice       | 30級 |    1 |    1 |   +0 |        0 |          | 2024-07-21 14:41 (7/21 14:41) | undefined local variable or method `record' for #<Swars::CrawlReservation id: 4362, user_id: 36, target_user_key: "alice", attachment_mode: "with_zip", processed_at: nil, created_at: "2024-07-28 20:05:35.000000000 +0900", updated_at: "2024-07-28 20:05:35.0... |
# >> | 2024-07-28 20:48:33 | 228939 | BOUYATETSU5 | 六段 | 1803 | 1803 |   +0 |       37 | 20:22    | 2024-06-06 18:18 (6/6 18:18)  | undefined local variable or method `record' for #<Swars::CrawlReservation id: 4363, user_id: 33, target_user_key: "BOUYATETSU5", attachment_mode: "nothing", processed_at: nil, created_at: "2024-07-28 20:23:01.000000000 +0900", updated_at: "2024-07-28 20:23... |
# >> |---------------------+--------+-------------+------+------+------+------+----------+----------+-------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
# >> |------+---------+-----------------+-----------------+--------------+---------------------------+---------------------------|
# >> | id   | user_id | target_user_key | attachment_mode | processed_at | created_at                | updated_at                |
# >> |------+---------+-----------------+-----------------+--------------+---------------------------+---------------------------|
# >> | 4362 |      36 | alice           | with_zip        |              | 2024-07-28 20:05:35 +0900 | 2024-07-28 20:05:35 +0900 |
# >> | 4363 |      33 | BOUYATETSU5     | nothing         |              | 2024-07-28 20:23:01 +0900 | 2024-07-28 20:23:01 +0900 |
# >> |------+---------+-----------------+-----------------+--------------+---------------------------+---------------------------|
