<template lang="pug">
HelpContent.ShareBoardHelpBody
  article
    h2 対局するには？
    ol
      li 部屋を立てる
      li 順番を設定する
      li 対局時計を開始する

  article
    h2 対局するには？ (詳細)
    ol
      li
        | 部屋を立てる
        ul
          li 「合言葉」と「ハンドルネーム」を決めて入室する
          li 仲間には合言葉が含まれる「部屋のリンク」を伝える
          li 伝えられた側は合言葉を入力する手間を省略できる
      li
        | 順番設定
        ul
          li 有効にした時点で居るメンバー全員参加になる
          li 棋力が偏ってたら「シャッフル」や「…」のドラッグで調整する
          li 観戦するには参加の列のスイッチを OFF にする
          li 奇数人数でも対局できるけど1周する度に<b>先後がずれる</b>
      li
        | 対局時計
        ul
          li
            b-icon(icon="play" size="is-small")
            | で開始
          li ニワトリが鳴くので手番の人から指していく

      li
        | 対局中
        ul
          li 投了は右上の吹き出しボタンから発言する
          li 自分の手番がわからなくなったら「牛」や「盤の色」を合図に指す
          li
            | 時間切れにならないように指す
            ul
              li 切れても「秒読み」の設定があれば続行できる
              li しかし何度もやると顰蹙を買う
          li
            | 「待った」は「1手戻す」で指し直す
            ul
              li 合意を得た上でやろう
      li
        | 対局後
        ul
          li 時計を止める
          li
            | <b>順番設定を解除</b>する
            ul
              li 解除すると手番の制限が無くなり誰でも駒を動かせる状態に戻る
              li 必要ならみんなで盤をつついて検討する
          li
            | 他のアプリで検討する場合は「棋譜コピー」
            ul
              li 「ぴよ将棋」や「KENTO」の場合は直接メニューから起動する
          li
            | チャットアプリに棋譜を貼る場合
            ul
              li
                | 「棋譜リンクコピー」して貼る
                ul
                  li 棋譜リンクは共有将棋盤で棋譜を再現するURL
                  li ブラウザのURLでは(合言葉が含まれるため)部屋への招待になってしまうので注意
              li
                | 検討中で本筋を上書きしてしまっている場合
                ol.mt-1
                  li 指し手の履歴から「時計停止」を含む行をタップ
                  li その中の「リンク」をタップ
                  li これが対局終了時点の棋譜リンクになっている
      li
        | 再対局
        ol
          li 「初期配置に戻す」
          li 「順番設定」
          li
            | 「対局時計」の
            b-icon(icon="play" size="is-small")
            | で開始
  article
    h2 もっと簡単に開始できない？
    p
      | 自動マッチングを使うと「部屋に入る」「順番設定」「時計設置」を自動化する。
      | が、逆に細かい調整はできなくなる。

  article
    h2 リレー将棋をするには？
    p
      | 3人以上で対局する

  article
    h2 ツイッターを利用して対局するには？
    p
      | グループ内で順番に指してツイートを繰り返す通信将棋と呼ばれる方式
    ol
      li 「ツイート画像の視点設定」を「1手指し継いだとき自分の視点」に変更
      li
        | 「タイトル変更」で任意のタイトルに変更
        ul
          li このタイトルがハッシュタグになる
      li 1手指す
      li ツイートボタンからツイートして次の人を指名する
    p
      | 棋譜はすべてURLに含まれるので、指名されていない人がイタズラで盤を動かしても、指名された人が指す局面には影響がない

  article
    h2 対面で対局するには？
    p
      | 1つのスマホで向かい合って指す方式
    ol
      li 必要であれば「手合割」をする
      li 必要であれば「時間設定」する
      li そのまま指す

  article
    h2 詰将棋を作成するには？
    ol
      li 「局面編集」
      li ツイートボタンからツイート

  article
    h2 投了するには？
    p 右上の吹き出しアイコンから伝える

  article
    h2 リレー将棋で手番を間違えて指してしまう
    p 順番設定する

  article
    h2 リレー将棋で観戦者が指しちゃった
    p 順番設定する

  article
    h2 通信環境が不安定で指し手が正確に伝わらない
    p 順番設定する

  article
    h2 検討したいのに駒が動かない
    p 順番設定を解除する

  article
    h2 部屋のリンクを伝えるには？
    ol
      li 「部屋に入る」の中にある「部屋のリンク」
      li またはメニュー内の「部屋のリンクのコピー」をタップ
      li これで<b>部屋の合言葉だけ</b>が含まれるURLがクリップボードに入る
      li それをチャットツールに貼る
    p
      | ブラウザのURLにも部屋の合言葉は入っているが、余計な情報(現在の盤面の情報)も含んでいるため、単に部屋のリンクを伝えるときは上の方法が良い

  article
    h2 反転するには？
    p
      | ☗または☖をタップ
    ul
      li 時計開始のタイミングで後手番は自動的に反転する
      li なので自分で反転するは必要はない
      li しかし途中から参加したのが後手番だったときには自分で反転する必要がある
      li 単にひふみんアイしたいときにも用いる

  article
    h2 いまどちらの手番？
    p ☗または☖の大きい方

  article
    h2 ニワトリが鳴くのは？
    p 対局の開始を伝えている

  article
    h2 牛が鳴くのは？
    p あなたの手番を知らせている

  article
    h2 盤の色が変わるのは？
    p あなたの手番を知らせている

  article
    h2 アバターありとは？
    p 自分のアイコン画像が玉になる (不評)
    ul
      li ログインしていないとなんかしらの動物が玉になる
      li 対象が2人以上の場合は順番が早い方をリーダーとみなす

  article(v-if="false")
    h2 シャウトありとは？
    p 駒が動いたり取られたときに無駄に叫ぶ (不評)

  article(v-if="false")
    h2 N手毎交代とは？
    ul
      li N回指したら次の人と交代する
      li 例えば a b c d の4人で2手毎交代なら a b a b c d c d の順で繰り返す
      li a b c の3人で2手毎交代なら a b a b c a c a b c b c の順で繰り返す
      li 複数回指す理由は、対面で1手毎だと移動が慌ただしくなってしまうからと考えられる
      li また、1人で何回も連続で指してると後続が待ちくたびれる
      li なので、オンラインなら1手毎交代で良い

  article
    h2 盤の色を変更するには？
    p メニュー→配色

  article
    h2 発言するには？
    p 右上の吹き出しアイコン

  article
    h2 同じチーム内でチャットするには？
    ul
      li できない
      li 上位者の意向に沿って指していたらチームの意味がない

  article
    h2 観戦中に思いついた指し手を発言したら対局者に怒られた
    p チャットの右上から「観戦者宛」を選択

  article
    h2 対局中にぼやいていたら三味線行為だと怒られた
    p チャットの右上から「観戦者宛」を選択

  article
    h2 観戦者宛の発言は対局が終わったら対局者も見れる？
    p 順番設定を解除したら見れる

  article
    h2 発言が緑色なのは何？
    p 観戦者宛の発言
  //- --------------------------------------------------------------------------------

  article
    h2 リレー将棋を奇数人数で行うとどうなる？
    ul
      li 1周するたびに先後がずれる
      li とくに制限はしてない

  article
    h2 リレー将棋を1人で試すには？
    ul
      li 部屋を立てて1人で順番設定して時計を設置して始める
      li 自分vs自分になる

  article
    h2 駒を成る操作を間違えてしまう
    p 移動先に「成る」の選択肢があるので単にダブルタップする

  article
    h2 再戦するには？
    p 「初期配置に戻す」

  article
    h2 「初期配置に戻す」とは？
    ul
      li 0手目まで戻す
      li 全員に盤を転送する
      li 平手の初期配置をセットするの<b>ではない</b>

  article
    h2 「初期配置に戻す」で平手の初期配置に戻らないんだが？
    ul
      li 盤面編集したのが原因
      li 盤面編集すると確定した局面が0手目になる
      li 「初期配置に戻す」は0手目に移動する動作なので、正常に0手目になっていても「平手の初期配置」を想定している場合に戻ってないと受けとめてしまう

  article
    h2 平手の初期配置にするには？
    p 手合割で「平手」を選択する

  article
    h2 シャッフルとは？
    p 順番をランダムで決める

  article
    h2 振り駒とは？
    ul
      li チーム編成を維持したまま先後をランダムで決める
      li 誰が振るかには依存しない
      li 記録係が振り、すでに☗にいる人を上座と想定している
      li つまり「歩」が3枚以上ならそのままで、
      li 「と金」が3枚以上なら入れ替える
      li 実行は一瞬だが内部では実際に5枚の歩を10回から20回振っている

  article
    h2 先後入替とは？
    p 手動で手番の順序を逆にしたいときに使う

  article
    h2 駒落ちで対戦するには？
    p 手合割

  article
    h2 バリケード将棋をするには？
    ul
      li 手合割から設定
      li ただしプログラムではトライルールの判定を行なわない

  article
    h2 手合割の選択肢に希望のものがない
    p 局面編集

  article
    h2 相手が二歩や王手放置をしてしまって指摘しづらい
    p 順番設定で「反則」を「制限」にしておく

  article
    h2 持将棋・千日手の判定は？
    p ない

  article
    h2 トライルールの判定は？
    p ない。あらかじめ対戦者同士で決めておく

  article
    h2 死に駒を作れる？
    p 作れない。死に駒になりそうなときは勝手に成る。

  article
    h2 反則したけど指し直していいとだけ言われたら？
    ol
      li 「1手戻す」
      li 合法手を指す

  article
    h2 盤の大きさを調整するには？
    ul
      li メニューの一番下にある「スタイル設定」で調整する
      li デフォルトでは若干小さめにしているので各自のディスプレイに合わせて調整してほしい

  article
    h2
      | 盤はどのタイミングで同期する？
      span.has-text-danger.mx-1 重要
    ul
      li 着手した瞬間
      li 「初期配置に戻す」
      li 「1手戻す」
      li 「局面の転送」
    p 元々は上記だけで、それ以外は必要に応じて「局面の転送」をしてもらうようにしていた。が、なかなか難しいようなので次のタイミングでも自動的に同期するようにした。
    ul
      li 「手合割」適用時
      li 「棋譜の読み込み」した直後
      li 「局面編集」完了時
      li 履歴から「N手目まで戻る」実行時
      li 盤面下のコントローラー類を動かし終わって1秒後

  article
    h2 対局中なのに観戦者が「初期配置に戻す」を押しちゃった
    ul
      li 履歴から最後の指し手をタップ
      li 「N手目まで戻る」をタップ

  article
    h2 検討中に本譜(本筋)に戻すには？
    ul
      li 履歴から「時計停止」をタップ
      li 「N手目まで戻る」をタップ

  article
    h2 検討中に本譜(本筋)を取得するには？
    ul
      li 履歴から「時計停止」をタップ
      li 「コピー」または「リンク」をタップ

  article
    h2 ハンドルネームを変更するには？
    ul
      li 順番設定前であれば「ハンドルネームを変更」
      li 部屋を立てる前であれば「部屋に入る」

  article
    h2 盤の下のコントローラーが表示されなくなった？
    ul
      li 対局中に間違えて押して混乱する人がいるため時計動作中は消している
      li 時計を「取り除く」か「停止」か「一時停止」にすると表示する
      li 「設定」から常に表示するようにできる

  article
    h2 対局後に棋譜を関係者に公開するには？
    ul
      li 「棋譜リンクコピー」
      li 棋譜コピーでも良いが「棋譜リンクコピー」であればURLをタップするだけで確認できる

  article
    h2 変なタイミングで音が出た
    p
      | 一般的なWEBブラウザはユーザーが画面に触れるまでは音が出ないので、
      | 最初に画面に触れたタイミングでまとめて音が出たりする。これは仕方がない。

  article
    h2 牛が鳴かないときがある
    p
      | 「牛」と「次は○○の手番」の発声は順番設定の面子が3人以上のときだけ。2人以下では順番が明確なので鳴かない。

  article
    h2 時計の設定値の意味は？
    table.table
      tbody
        tr
          th 持ち時間(分)
          td
            | 最初に減っていく<br>
            | 1手毎に「1手毎加算」だけ回復する
        tr
          th 秒読み(秒)
          td
            | 「持ち時間」が0になると減っていく<br>
            | 1手毎に初期値まで<b>回復する</b><br>
        tr
          th 猶予(秒)
          td
            | 「秒読み」が0になると減っていく<br>
            | <b>回復しない</b><br>
            | 0になると負け
        tr
          th 1手毎加算(秒)
          td
            | フィッシャールール用<br>
            | 1手毎に「持ち時間」に加算する秒数<br>
            | この値だけは変動しない<br>
            | これを指定するときは「秒読み」と「猶予」は0にしておこう<br>

  article(v-if="development_p")
    h2 ログイン不要のメリットとデメリット
    p
      | メリット → ログインしなくてよい
    p
      | デメリット → ハンドルネームが衝突すると同じアカウントと見なされるため順番設定がまともに機能しなくなる。例えば4人で対局したくても名前が被っていると順番設定では3人になる

  article
    h2 棋譜に対局者名を含めたい
    ul
      li 順番設定している状況では「先手」「後手」「観戦」の項目に名前が入る
      li 順番設定していない状況では「面子」にすべてのメンバーの名前が入る

  article
    h2 棋譜コピーしただけでみんなに通知されたのはなぜ？
    p ソフト指しの疑念を生まないようにするため

  article
    h2 棋譜読み込み後に本筋を上書きしてしまった
    p 右の履歴の「棋譜読込後(本筋)」をタップすると読み込んだ直後の棋譜に復帰する

  article
    h2 共有将棋盤内のハンドネームを変更すると全体のログイン名も変わる？
    ul
      li 変わらない
      li 共有将棋盤内のハンドルネームは共有将棋盤内だけの扱い
      li ハンドルネームの入力初期値がログイン名になっているだけ

  article
    h2 観戦するには？
    ul
      li 順番設定後に入ると自動的に観戦者になる
      li 対局者が観戦に移行するには順番設定で参加の列のスイッチを OFF にする

  article
    h2 途中から参加するには？
    p 順番設定で参加の列のスイッチを ON にする

  article
    h2 順番設定のメリットは？
    ul
      li
        | 手番間違い防止
        ul
          li 手番の人は指せなくなる
      li
        | 指し手の伝達が正確になる
        span.has-text-danger.mx-1.has-text-weight-bold 重要
        ul
          li 次の指し手がわかるので伝わったかを内部で検証するようになる

  article
    h2 たまに出る局面再送とは？
    ul
      li 指し手を正確に転送するための機能で、失敗を検知したときに出る
      li 通信不調で自家は指したつもりになっているが下家はずっと待っているのような状態を防ぐ
      li 自家が下家に局面を転送したあと下家から応答がないと再送ダイアログを表示する
      li <b>順番設定しているときだけ</b>作動する

  article
    h2 同名の人が増殖している
    ul
      li きちんと退室せずに入り直したとき前の人がゾンビになる
      li プログラム側はゾンビと今の人が同じか区別できない
      li ゾンビは応答がないとそのうち抹殺される
      li
        | 順番設定は名前のみで決まるので同名のゾンビがいても無視してればよい
        ul
          li 同名のゾンビがいるからといってハンドルネームを変えると順番設定でゾンビを除外する手間がかかる

  article
    h2 ゾンビからの復活
    ul
      li ブラウザを閉じたり通信不調で応答がないとゾンビ化する
      li ゾンビは抹殺されるまで猶予がある
      li その猶予内に応答すれば人に戻れる

  article
    h2 よそ見中とは？
    p 別の画面を見ている

  article
    h2 特定メンバーをBANしたい
    p そういう機能はない

  article
    h2 ログインするメリットは？
    ul
      li
        | アバターありにした場合に自分のプロフィール画像を玉をできる
        ul
          li つまり玉をカスタマイズできる
      li ハンドルネームの初期値がログインネームになる
      li いまのところ他にはないがログインしている方を優待する

  article
    h2 部屋に知らない人が入ってきた
    ul
      li 単純な合言葉にしていると干渉する場合がある
      li 部屋のリンクをSNSに貼ると知らない人も来る

  article
    h2 相手の切れ負け判定が遅くない？
    ol
      li もともとは各自の対局時計で判定していたので遅延は無かった
      li しかし通信環境が悪い場合に各自で異なる切れ負け判定をしてしまう場合があった
      li それを防ぐため手番である当事者の時計だけで判定し全員に通知する方法に変更した
      li これによって誤判定はなくなった
      li しかし当事者から時間切れの通知が来なければ他者は時間切れになったことがわからなくなった
      li つまり速度を取れば不正確になり、正確性を取れば遅延することになった
      li 時間切れになる直前に当事者が切断すれば他者が待ち惚けをくらうのは避けたかった
      li なので他者もこれまで通り自分の時計で時間切れの判定は行うが猶予として30秒待つことにした
      //- 遅延の長さは CC_AUTO_TIME_LIMIT_DELAY に依存
      li したがって切れ負け判定まで最大30秒かかる

  article
    h2 ここに載ってない
    p
      | →
      a.mx-1(href="https://twitter.com/sgkinakomochi") @sgkinakomochi
</template>

<script>
import { support_child } from "./support_child.js"

export default {
  name: "ShareBoardHelpBody",
  mixins: [
    support_child,
  ],
  data() {
    return {
    }
  },
}
</script>

<style lang="sass">
@import "support.sass"
.ShareBoardHelpBody
  th
    text-align: right ! important
</style>
