// 正規化した文字列に対して比較を行うため基本的に「全角ひらがな」「半角英数」を対象にする
// ../../../test/handle_name_validator.spec.js
export const HandleNameNgWordUserList = [
  // 手動
  "名前|はんどるねーむ|にっくねーむ",
  "したしみのある|ゆうこうてきな|しんきんかんのある|ふれんどりーな|すてはんでない|もっと素敵な|素敵なはんどる",
  "おはよう|こんばんわ|こんばんは",
  "小学生|中学生|高校生|大学生|大学院生",
  "失礼",
  ".(しています|します|です|である)$",
  "時間",
  "893|半ぐれ",
  "ひっとら|ひとら",

  // 捨てハン
  "test|てすと",
  "nanashi|nanasi|noname|unknown|名無し|ななし|通りすがり|荒らし|匿名|無名|見学",
  "^asdf",
  "^hoge",
  "^fuga",
  "aiueo",
  "ほげほげ",
  "ふがふが",
  "^[aあ\\d\\.]+$",
  "ごみ|くず|くそ",

  // 捨てハン2
  "段位者|級位者",

  // ひらがな
  "^あいう$",
  "^あいうえ$",
  "あいうえお",
  "かきくけこ",

  // エロサイト名
  "xvideo|pornhub",

  // システム予約
  "^GPT$",
  "shogi.*extend",

  // ネガティブ
  "死",
  "鬱",
  "行方不明",
  "雑魚",
  "無駄",
  "麻痺",
  "戦犯|せんぱん|初心者|しょしんしゃ",

  // 汎用罵詈雑言系
  "馬鹿|ばか",
  "阿呆|あほ",
  "死ね|しね",
  "殺す|ころす",

  // 放送禁止用語
  "ちんちん",
  "低脳|ていのう",
  "土左衛門",
  "癩病",
  "気違い",
  "乞食",
  "manko",

  // 無理矢理NGを抜けてくるやつ
  "あなぁる",
]
