require File.expand_path('../../../config/environment', __FILE__)
ApplicationRecord.connection.execute("SET foreign_key_checks = 0")

Swars::Battle.destroy_all
Swars::User.destroy_all

user1 = Swars::User.create!
user2 = Swars::User.create!

create = -> s, n {
  grade = Swars::Grade.fetch(s)
  n.times do
    Swars::Battle.create! do |e|
      e.memberships.build(user: user1, grade: grade)
      e.memberships.build(user: user2, grade: grade)
    end
  end
}

create.call("2級", 1)
create.call("1級", 2)
# create.call("初段", 3)
# create.call("二段", 2)
# create.call("三段", 1)

ActiveSupport::LogSubscriber.colorize_logging = false
ActiveRecord::Base.logger = ActiveSupport::Logger.new(STDOUT)

s = Swars::Membership.all
# s = s.joins(:battle).merge(Swars::Battle.rule_eq("10分"))
# s = s.tagged_with("新嬉野流")
s = s.where(grade: Swars::Grade.all.unscope(:order))
ids = s.order(id: :desc).pluck(:id)
counts = Swars::Membership.where(id: ids).group(:grade).count
tp counts

# tp Swars::Membership.tagged_with("")
# tp Swars::Membership.tag_counts_on(:attack_tags)

# tp Swars::User
# tp Swars::Membership

# >> |----------------------|
# >> | 天守閣囲い           |
# >> | 居玉                 |
# >> | カニ囲い             |
# >> | カブト囲い           |
# >> | 金矢倉               |
# >> | 銀矢倉               |
# >> | 角矢倉               |
# >> | 豆腐矢倉             |
# >> | 隅矢倉               |
# >> | 矢倉右玉             |
# >> | 流れ矢倉             |
# >> | 四角矢倉             |
# >> | へこみ矢倉           |
# >> | カタ囲い             |
# >> | 悪形矢倉             |
# >> | 天野矢倉             |
# >> | 総矢倉               |
# >> | 金門矢倉             |
# >> | 矢倉穴熊             |
# >> | 菊水矢倉             |
# >> | 銀立ち矢倉           |
# >> | 菱矢倉               |
# >> | 一文字矢倉           |
# >> | 富士見矢倉           |
# >> | 矢倉早囲い           |
# >> | 土居矢倉             |
# >> | 高矢倉               |
# >> | カニ缶囲い           |
# >> | オリジナル雁木       |
# >> | オールド雁木         |
# >> | ツノ銀雁木           |
# >> | 新型雁木             |
# >> | 右玉                 |
# >> | 糸谷流右玉           |
# >> | 羽生流右玉           |
# >> | 角換わり右玉         |
# >> | 雁木右玉             |
# >> | ツノ銀型右玉         |
# >> | 三段右玉             |
# >> | カギ囲い             |
# >> | ボナンザ囲い         |
# >> | 美濃囲い             |
# >> | 連盟美濃             |
# >> | 早囲い               |
# >> | 三手囲い             |
# >> | ずれ美濃             |
# >> | 振り飛車エルモ       |
# >> | カブト美濃           |
# >> | 高美濃囲い           |
# >> | 銀冠                 |
# >> | 片銀冠               |
# >> | 銀美濃               |
# >> | 振り飛車四枚美濃     |
# >> | ダイヤモンド美濃     |
# >> | 木村美濃             |
# >> | 大山美濃             |
# >> | 裾固め               |
# >> | 片美濃囲い           |
# >> | ちょんまげ美濃       |
# >> | 坊主美濃             |
# >> | 金美濃               |
# >> | 左美濃               |
# >> | 角道不突き左美濃     |
# >> | 居飛車金美濃         |
# >> | 升田美濃             |
# >> | 天守閣美濃           |
# >> | 四枚美濃             |
# >> | 端玉銀冠             |
# >> | かんぴょう囲い       |
# >> | 四枚銀冠             |
# >> | 串カツ囲い           |
# >> | 舟囲い               |
# >> | 舟囲いDX             |
# >> | 居飛車穴熊           |
# >> | 松尾流穴熊           |
# >> | 神吉流穴熊           |
# >> | 紙穴熊               |
# >> | 銀冠穴熊             |
# >> | ビッグ４             |
# >> | 文鎮囲い             |
# >> | 箱入り娘             |
# >> | 金盾囲い             |
# >> | 大盾囲い             |
# >> | ミレニアム囲い       |
# >> | 振り飛車穴熊         |
# >> | 振り飛車ミレニアム   |
# >> | 右矢倉               |
# >> | 金無双               |
# >> | 離れ金無双           |
# >> | 中住まい             |
# >> | 中原囲い             |
# >> | 桐山流中原囲い       |
# >> | アヒル囲い           |
# >> | 裏アヒル囲い         |
# >> | いちご囲い           |
# >> | 無敵囲い             |
# >> | エルモ囲い           |
# >> | 左山囲い             |
# >> | 無責任矢倉           |
# >> | 居飛穴音無しの構え   |
# >> | あずまや囲い         |
# >> | セメント囲い         |
# >> | 銀多伝               |
# >> | 金多伝               |
# >> | 美濃熊囲い           |
# >> | モノレール囲い       |
# >> | チョコレート囲い     |
# >> | 四段端玉             |
# >> | 空中楼閣             |
# >> | 高田流左玉           |
# >> | 力戦                 |
# >> | 花村流名古屋戦法     |
# >> | 清野流岐阜戦法       |
# >> | GAVA角               |
# >> | ▲５五龍中飛車       |
# >> | ノーガード戦法       |
# >> | ▲３七銀戦法         |
# >> | 脇システム           |
# >> | ウソ矢倉             |
# >> | 矢倉棒銀             |
# >> | 森下システム         |
# >> | 雀刺し               |
# >> | 米長流急戦矢倉       |
# >> | カニカニ銀           |
# >> | カニカニ金           |
# >> | 中原流急戦矢倉       |
# >> | 阿久津流急戦矢倉     |
# >> | 藤森流急戦矢倉       |
# >> | 屋敷流二枚銀         |
# >> | 屋敷流二枚銀棒銀型   |
# >> | 矢倉中飛車           |
# >> | 右四間飛車           |
# >> | 原始棒銀             |
# >> | かまいたち戦法       |
# >> | 英春流カメレオン     |
# >> | パックマン戦法       |
# >> | 山崎流パックマン     |
# >> | 新米長玉             |
# >> | 稲庭戦法             |
# >> | 四手角               |
# >> | 一間飛車             |
# >> | 一間飛車穴熊         |
# >> | 都成流△３一金       |
# >> | 右四間飛車左美濃     |
# >> | 角換わり             |
# >> | 一手損角換わり       |
# >> | 手得角交換型         |
# >> | 手損角交換型         |
# >> | 角換わり腰掛け銀     |
# >> | 角換わり棒銀         |
# >> | 角換わり早繰り銀     |
# >> | 角換わり新型         |
# >> | 筋違い角             |
# >> | 相筋違い角           |
# >> | 木村定跡             |
# >> | 相掛かり             |
# >> | 相掛かり棒銀         |
# >> | 塚田スペシャル       |
# >> | 中原流相掛かり       |
# >> | 中原飛車             |
# >> | 腰掛け銀             |
# >> | 鎖鎌銀               |
# >> | ▲８五飛車戦法       |
# >> | UFO銀                |
# >> | 横歩取り             |
# >> | △３三角型空中戦法   |
# >> | △３三桂戦法         |
# >> | △２三歩戦法         |
# >> | △４五角戦法         |
# >> | 相横歩取り           |
# >> | 先手中飛車           |
# >> | ゴキゲン中飛車       |
# >> | 5筋位取り中飛車      |
# >> | ツノ銀中飛車         |
# >> | 英ちゃん流中飛車     |
# >> | 原始中飛車           |
# >> | 中飛車左穴熊         |
# >> | 平目                 |
# >> | 風車                 |
# >> | 新風車               |
# >> | 加藤流袖飛車         |
# >> | ▲５七金戦法         |
# >> | 超急戦               |
# >> | 遠山流               |
# >> | 四間飛車             |
# >> | 角道オープン四間飛車 |
# >> | 耀龍四間飛車         |
# >> | 藤井システム         |
# >> | 立石流四間飛車       |
# >> | レグスペ             |
# >> | 三間飛車             |
# >> | 石田流               |
# >> | 早石田               |
# >> | ムリヤリ早石田       |
# >> | 升田式石田流         |
# >> | 鬼殺し               |
# >> | 2手目△３ニ飛戦法    |
# >> | 中田功XP             |
# >> | 真部流               |
# >> | ▲７八飛戦法         |
# >> | ４→３戦法           |
# >> | 楠本式石田流         |
# >> | 新石田流             |
# >> | 新鬼殺し             |
# >> | ダイレクト向かい飛車 |
# >> | 向かい飛車           |
# >> | メリケン向かい飛車   |
# >> | 阪田流向飛車         |
# >> | 角頭歩戦法           |
# >> | 鬼殺し向かい飛車     |
# >> | 陽動振り飛車         |
# >> | 玉頭銀               |
# >> | つくつくぼうし戦法   |
# >> | ひねり飛車           |
# >> | 耀龍ひねり飛車       |
# >> | 相振り飛車           |
# >> | 角交換振り飛車       |
# >> | はく式四間飛車       |
# >> | 幻想四間飛車         |
# >> | タランチュラ戦法     |
# >> | 久夢流               |
# >> | きｍきｍ金           |
# >> | ポンポン桂           |
# >> | 銀雲雀               |
# >> | 玉頭位取り           |
# >> | ６筋位取り           |
# >> | 地下鉄飛車           |
# >> | 飯島流引き角戦法     |
# >> | 丸山ワクチン         |
# >> | 新丸山ワクチン       |
# >> | ▲４六銀右急戦       |
# >> | ▲４六銀左急戦       |
# >> | ▲４五歩早仕掛け     |
# >> | エルモ急戦           |
# >> | 鷺宮定跡             |
# >> | 棒銀                 |
# >> | 暴銀                 |
# >> | 左美濃急戦           |
# >> | 右四間飛車急戦       |
# >> | 鳥刺し               |
# >> | 嬉野流               |
# >> | 新嬉野流             |
# >> | メイドシステム       |
# >> | 棒金                 |
# >> | 棒玉                 |
# >> | 超速▲３七銀         |
# >> | 対振り持久戦         |
# >> | ▲７二飛亜急戦       |
# >> | 袖飛車               |
# >> | 一直線穴熊           |
# >> | 穴角戦法             |
# >> | 穴角向かい飛車       |
# >> | うっかり三間飛車     |
# >> | 菅井流三間飛車       |
# >> | アヒル戦法           |
# >> | 裏アヒル戦法         |
# >> | 矢倉左美濃急戦       |
# >> | 青野流               |
# >> | 勇気流               |
# >> | 極限早繰り銀         |
# >> | 33金型早繰り銀       |
# >> | トマホーク           |
# >> | 羽生式袖飛車         |
# >> | 初手７八銀戦法       |
# >> | 初手３六歩戦法       |
# >> | 2手目△74歩戦法      |
# >> | 4手目△３三角戦法    |
# >> | きんとうん戦法       |
# >> | 魔界四間飛車         |
# >> | 目くらまし戦法       |
# >> | 端棒銀               |
# >> | 金銀橋               |
# >> | カメレオン戦法       |
# >> | xaby角戦法           |
# >> | オザワシステム       |
# >> | 金底の歩             |
# >> | パンツを脱ぐ         |
# >> | 腹銀                 |
# >> | 垂れ歩               |
# >> | 遠見の角             |
# >> | 割り打ちの銀         |
# >> | 桂頭の銀             |
# >> | ロケット             |
# >> | ふんどしの桂         |
# >> | 継ぎ桂               |
# >> | 銀冠の小部屋         |
# >> | 入玉                 |
# >> | 角不成               |
# >> | 飛車不成             |
# >> | 居飛車               |
# >> | 振り飛車             |
# >> | 相入玉               |
# >> | 大駒全消失           |
# >> | 相居玉               |
# >> | 背水の陣             |
# >> | 相居飛車             |
# >> | 対振り               |
# >> | 相振り               |
# >> | 対抗型               |
# >> | 大駒コンプリート     |
# >> | 駒柱                 |
# >> |----------------------|
