require "./setup"
Wkbk.setup
puts Wkbk::Article.first.moves_answers.first.to_kif
# >> 問題ID：746
# >> 問題KEY：vFo52WwVPB0
# >> 問題タイトル：寄せの手筋200 001
# >> 投稿者：運営
# >> 公開設定：非公開
# >> *詳細URL：http://localhost:4000/rack/articles/vFo52WwVPB0
# >> 種類：手筋
# >> 難易度：1
# >> メッセージ：
# >> タグ：
# >> 解説：
# >> 正解番号：1
# >> *画像URL：http://localhost:3000/share-board.png?abstract_viewpoint=black&body=position+sfen+7k1%2F9%2F9%2F9%2F9%2F9%2F9%2F9%2F9+b+GSN2r2b3g3s3n4l18p+1+moves+S%2A2c+G%2A2b+N%2A3c+2a1a+G%2A2a+2b2a+3c2a%2B+1a2a+G%2A2b&turn=0
# >> *共有将棋盤：http://localhost:3000/share-board?abstract_viewpoint=black&body=position+sfen+7k1%2F9%2F9%2F9%2F9%2F9%2F9%2F9%2F9+b+GSN2r2b3g3s3n4l18p+1+moves+S%2A2c+G%2A2b+N%2A3c+2a1a+G%2A2a+2b2a+3c2a%2B+1a2a+G%2A2b&title=%E5%AF%84%E3%81%9B%E3%81%AE%E6%89%8B%E7%AD%8B200+001&turn=0
# >> 人間向けの解答：▲23銀打 △22金打 ▲33桂打 △11玉 ▲21金打 △同金 ▲同桂成 △同玉 ▲22金打
# >> 正解作成日時：2021-02-24 21:50
# >> 後手の持駒：飛二 角二 金三 銀三 桂三 香四 歩十八
# >>   ９ ８ ７ ６ ５ ４ ３ ２ １
# >> +---------------------------+
# >> | ・ ・ ・ ・ ・ ・ ・v玉 ・|一
# >> | ・ ・ ・ ・ ・ ・ ・ ・ ・|二
# >> | ・ ・ ・ ・ ・ ・ ・ ・ ・|三
# >> | ・ ・ ・ ・ ・ ・ ・ ・ ・|四
# >> | ・ ・ ・ ・ ・ ・ ・ ・ ・|五
# >> | ・ ・ ・ ・ ・ ・ ・ ・ ・|六
# >> | ・ ・ ・ ・ ・ ・ ・ ・ ・|七
# >> | ・ ・ ・ ・ ・ ・ ・ ・ ・|八
# >> | ・ ・ ・ ・ ・ ・ ・ ・ ・|九
# >> +---------------------------+
# >> 先手の持駒：金 銀 桂
# >> 先手番
# >> 手数----指手---------消費時間--
# >>    1 ２三銀打     (00:00/00:00:00)
# >>    2 ２二金打     (00:00/00:00:00)
# >>    3 ３三桂打     (00:00/00:00:00)
# >>    4 １一玉(21)   (00:00/00:00:00)
# >>    5 ２一金打     (00:00/00:00:00)
# >>    6 ２一金(22)   (00:00/00:00:00)
# >>    7 ２一桂成(33) (00:00/00:00:00)
# >>    8 ２一玉(11)   (00:00/00:00:00)
# >>    9 ２二金打     (00:00/00:00:00)
# >>   10 投了
# >> まで9手で先手の勝ち
