require "./setup"
# tp Swars::TagFrequency.new.as_json

sample_max = 5000
batch_size = 1000

all = {}
Bioshogi::Analysis::TacticInfo.each do |e|
  hv = Hash.new(0)
  Swars::Membership.in_batches(of: batch_size, order: :desc).each_with_index do |relation, batch|
    if batch >= sample_max.ceildiv(batch_size)
      break
    end
    relation.tag_counts_on("#{e.key}_tags", at_least: 1).each do |tag|
      hv[tag.name] += tag.count
    end
  end
  all[e.key] = hv.sort_by { |_, v| -v }.to_h
end
tp all

# >> |-----------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
# >> |    attack | {"力戦"=>702, "四間飛車"=>552, "右四間飛車"=>314, "手得角交換型"=>309, "腰掛け銀"=>248, "棒銀"=>242, "早石田"=>242, "角交換型"=>239, "三間飛車"=>237, "5筋位取り中飛車"=>218, "向かい飛車"=>215, "手損角交換型"=>209, "対振り持久戦"=>197, "角交換振り飛車"=>179, "袖飛車"=>139, "角換わり腰掛け銀"=>131, "原始中飛車"=>128, "原始棒銀"=>124, "石田流"=>... |
# >> |   defense | {"居玉"=>932, "美濃囲い"=>349, "舟囲い"=>289, "片美濃囲い"=>255, "高美濃囲い"=>225, "左美濃"=>90, "カブト囲い"=>89, "振り飛車穴熊"=>85, "居飛車穴熊"=>83, "金無双"=>68, "エルモ囲い"=>65, "早囲い"=>64, "金矢倉"=>56, "銀冠"=>48, "中住まい"=>48, "左山囲い"=>45, "カニ囲い"=>45, "ツノ銀雁木"=>42, "木村美濃"=>38, "天守閣美濃"=>37, "ボナンザ囲い"=>...   |
# >> | technique | {"垂れ歩"=>983, "ふんどしの桂"=>496, "桂頭の銀"=>399, "継ぎ桂"=>153, "割り打ちの銀"=>142, "腹銀"=>114, "金底の歩"=>109, "幽霊角"=>53, "銀冠の小部屋"=>8, "遠見の角"=>7, "位の確保"=>3, "2段ロケット"=>3, "こびん攻め"=>3}                                                                                                                                   |
# >> |      note | {"居飛車"=>2886, "対居飛車"=>2886, "対抗形"=>2716, "長手数"=>2512, "急戦"=>2496, "短手数"=>2388, "持久戦"=>2272, "振り飛車"=>2070, "対振り飛車"=>2070, "相居飛車"=>1554, "相振り飛車"=>712, "大駒コンプリート"=>544, "大駒全ブッチ"=>544, "相居玉"=>456, "入玉"=>71, "屍の舞"=>59, "穴熊の姿焼き"=>32, "角不成"=>31, "駒柱"=>24, "飛車不成"...            |
# >> |-----------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
